main.floors.A23=
{
    "floorId": "A23",
    "title": "小巷道",
    "name": "小巷道",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 2,
    "defaultGround": 170056,
    "bgm": "3.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,11": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "6,2": [
            {
                "type": "if",
                "condition": "(item:I582==1)",
                "true": [
                    {
                        "type": "win",
                        "reason": "小巷道 Easy"
                    }
                ],
                "false": []
            },
            {
                "type": "win",
                "reason": "小巷道 Chaos"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [144,144,144,144,144,144,144,144,144,144,144,144,144],
    [144, 33,  0,144, 22,267,  0, 81, 28,144,  0, 32,144],
    [144,144, 82,144,144, 21,270, 31,144,144, 81,144,144],
    [144, 27,  0, 31,  0,260,  0, 82, 33,144,  0, 32,144],
    [144,266,144,144,259,144, 82,144,144,144, 81,144,144],
    [144, 21,144, 28,  0,257,  0, 28,144,  0,576,256,144],
    [144,  0,256,  0, 29,144, 33,  0, 81, 29,144,  0,144],
    [144,257,144,144,144,144,144,144,144,266,144, 82,144],
    [144, 28,144,  0,260, 31,  0,144, 28,  0, 29,  0,144],
    [144,  0,266, 21,144,  0, 29,144,144, 81,144,259,144],
    [144,144,144,267,144, 27,  0,144,  0,260, 34,  0,144],
    [144,576,  0, 32, 82,  0,259, 81, 32,144,  0, 88,144],
    [144,144,144,144,144,144,144,144,144,144,144,144,144]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}