main.floors.C3=
{
    "floorId": "C3",
    "title": "白骨岭",
    "name": "白骨岭",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": 50041,
    "bgm": "1.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,3": {
            "floorId": "C3",
            "loc": [
                6,
                3
            ],
            "direction": "up"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "6,2": [
            {
                "type": "if",
                "condition": "(item:I582==1)",
                "true": [
                    {
                        "type": "win",
                        "reason": "白骨岭 Easy"
                    }
                ],
                "false": []
            },
            {
                "type": "win",
                "reason": "白骨岭 Chaos"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [158,158,158,158,158,158,158,158,158,158,158,158,158],
    [158,158,158, 32, 81, 33,  0, 34, 82, 33,158,158,158],
    [158,158,158,158,576,  0,235,  0,577,158,158,158,158],
    [158,158,158,158,158,  0,  0,  0,158,158,158,104,158],
    [158, 30,158,158,158,158,158,158,158,158, 28,213,158],
    [158,226,158, 34,  0,226, 27,  0,210, 32,223,578,158],
    [158, 81,158,158,158, 81,158,158,158, 82,158,158,158],
    [158,  0,223, 81,  0, 28,158,  0, 81,  0,210, 21,158],
    [158,576,  0,158, 29,  0,214, 33,158, 27,158,213,158],
    [158, 82,158,158,213,158,158,158,158,158,158, 81,158],
    [158,577,  0,223, 21,  0,158, 34,158, 28,158,  0,158],
    [158,  0,578,158,  0,226, 81,  0,213,  0, 82, 88,158],
    [158,158,158,158,158,158,158,158,158,158,158,158,158]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}