main.floors.ex750=
{
    "floorId": "ex750",
    "title": "幻音圣树",
    "name": "幻音圣树",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 5000000000000,
    "defaultGround": 460456,
    "bgm": "39.mp3",
    "weather": [
        "snow",
        1
    ],
    "firstArrive": [
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 1000,
            "keep": true
        },
        {
            "type": "setBlock",
            "number": "N1842",
            "loc": [
                [
                    6,
                    8
                ]
            ]
        },
        {
            "type": "setCurtain",
            "time": 1000
        },
        "一长段剧情。\n纳可的水火法则得到了精进！\n\r[pink]领域级初期\r的\r[aqua]秘法晋升栏\r解锁了\r[gold]初成水火法则感悟\r。",
        {
            "type": "if",
            "condition": "(item:I1491==0)",
            "true": [
                "诶诶？你没有水火法则嘛？\n就算前面的炎眸族人被绕过去了，\n可后面给的领悟点数也完全够这个了呀。",
                "原来如此，一定是你不喜欢领悟这个叭。\n既然你这么不喜欢，\n那以后就都不用领悟水火法则了！",
                "领悟商店的\r[gold]初成水火法则感悟\r已消失。"
            ],
            "false": [
                {
                    "type": "setValue",
                    "name": "item:I1491",
                    "value": "0"
                },
                {
                    "type": "setValue",
                    "name": "item:I1492",
                    "value": "1"
                }
            ]
        },
        "\r[#66ccff]白依\r加入了队伍。\n现在，可以前往密林极深之处，\n那座神秘的\r[pink]冗律之塔\r了。",
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    8
                ]
            ],
            "remove": true
        },
        {
            "type": "follow",
            "name": "yi.png"
        },
        {
            "type": "setValue",
            "name": "flag:rlzt",
            "value": "1"
        },
        {
            "type": "show",
            "loc": [
                [
                    6,
                    22
                ]
            ],
            "floorId": "MT755"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,11": [
            {
                "type": "choices",
                "text": "\t[绿色按钮,A985]如果觉得打不动的话，\n不妨来点补给再前进吧！\n又或者，如果你更喜欢绿钥匙……？",
                "choices": [
                    {
                        "text": "获得30把绿钥匙",
                        "color": [
                            75,
                            217,
                            63,
                            1
                        ],
                        "need": "flag:750tree<1",
                        "action": [
                            {
                                "type": "animate",
                                "name": "green"
                            },
                            {
                                "type": "setValue",
                                "name": "item:greenKey",
                                "operator": "+=",
                                "value": "30"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:750tree",
                                "operator": "+=",
                                "value": "1"
                            }
                        ]
                    },
                    {
                        "text": "获得[一倍领悟获取速度]",
                        "color": [
                            167,
                            217,
                            167,
                            1
                        ],
                        "need": "flag:750tree<1",
                        "action": [
                            {
                                "type": "animate",
                                "name": "green"
                            },
                            {
                                "type": "setValue",
                                "name": "item:I1788",
                                "operator": "+=",
                                "value": "1"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:750tree",
                                "operator": "+=",
                                "value": "1"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:saltygreen",
                                "operator": "+=",
                                "value": "30"
                            }
                        ]
                    },
                    {
                        "text": "离去…",
                        "action": []
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "12,8": {
            "floorId": "MT750",
            "loc": [
                0,
                6
            ],
            "direction": "right"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [296,296,296,296,296,296,296,296,296,296,296,296,296],
    [296,296,296,296,296,270353,270354,270355,296,296,296,296,296],
    [295,295,295,296,270368,270369,270370,270371,270372,296,295,295,295],
    [295,295,295,295,270376,270377,270378,270379,270380,295,295,295,295],
    [295,295,295,295,270384,270385,270386,270387,270388,295,295,295,295],
    [295,295,295,295,270392,270393,270394,270395,270396,295,295,295,295],
    [295,295,1486,295,270400,270401,270402,270403,270404,295,  0,295,295],
    [295,1012,1007,270367,270408,270409,270410,270411,270412,270367,  0,  0,295],
    [1486,1184,1012,966,  0,  0,1840,  0,  0,  0,  0,  0,672],
    [296,270381,270383,  0,  0,  0,  0,  0,  0,  0,296,296,296],
    [296,296,296,296,  0,  0,  0,  0,  0,296,296,296,296],
    [296,296,296,296,296,296,985,296,296,296,296,296,296],
    [1500,296,296,296,296,296,296,296,296,296,296,296,1500]
],
    "bgmap": [

],
    "fgmap": [
    [296,296,296,296,296,296,296,296,296,296,296,296,296],
    [  0,296,296,296,296,296,296,296,296,296,296,296,  0],
    [  0,  0,296,296,296,296,296,296,296,296,296,  0,  0],
    [  0,  0,  0,296,296,296,  0,296,296,296,  0,  0,  0],
    [  0,  0,  0,296,296,  0,  0,  0,296,296,  0,  0,  0],
    [  0,  0,  0,270351,  0,  0,  0,  0,  0,270351,  0,  0,  0],
    [  0,  0,  0,270359,  0,  0,  0,  0,  0,270359,  0,  0,  0],
    [  0,270365,270366,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,270373,270374,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [
    [460785,460786,  0,460768,460769,460770,  0,460768,460769,460770,  0,460784,460785],
    [  0,  0,  0,460776,460777,460778,  0,460776,460777,460778,  0,  0,  0],
    [  0,  0,  0,460784,460785,460786,  0,460784,460785,460786,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
]
}