main.floors.JC1=
{
    "floorId": "JC1",
    "title": "基础 1 层",
    "name": "基础 1 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": 30060,
    "bgm": "j1.mp3",
    "firstArrive": [
        {
            "type": "sleep",
            "time": 200
        },
        {
            "type": "animate",
            "name": "wuyu",
            "loc": [
                6,
                8
            ]
        },
        "\t[屑猫头]嗨，你来啦。\n这里是纳可物语的世界！",
        "\t[屑猫头]纳可物语是《吞噬星空》的同人塔，从现在开始，\n你就是原作主角罗峰的第一个弟子——\n\r[yellow]纳可\r。",
        "\t[屑猫头]你问为什么这只\r[pink]纳可\r和原作有些不一样？\n这个嘛，你猜。",
        "\t[屑猫头]嗯……看来你正在进行魔塔的基础教程。\n这个教程面向初次接触魔塔类游戏的新人。\n如果是资深玩家，请尽量挑战\r[lime]全绿通关\r吧。",
        "\t[屑猫头]现在，按上下左右或鼠标瞬移，走到喵面前。\n诶？你说不会这个就走不到教程这里？\n哎呀，走一个形式嘛。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,8": [
            {
                "type": "if",
                "condition": "core.platform.isPC",
                "true": [
                    "\t[屑猫头]非常棒！现在让本喵继续下一阶段的教学。\n注意到屏幕左侧的属性面板了嘛？"
                ],
                "false": [
                    "\t[屑猫头]非常棒！现在让本喵继续下一阶段的教学。\n注意到屏幕上方的属性面板了嘛？"
                ]
            },
            "\t[屑猫头]左上角是你的角色形象，\n在它右侧是你的升级进度——\n为了成为强者，请努力打怪升级吧。",
            {
                "type": "if",
                "condition": "core.platform.isPC",
                "true": [
                    "\t[屑猫头]这之下的几行是你的\r[#66CCFF]属性值\r。\n红色剑形代表\r[#f28a94]「攻击」\r，决定你对敌人造成的伤害。\n蓝色盾牌代表\r[#8aa0f2]「防御」\r，可以抵消敌人的攻击伤害。",
                    "\t[屑猫头]绿色魔法球代表\r[#a5eda4]「生命」\r，要留意以免卡关哦。\n紫色鞋子代表\r[#ada4ed]「护盾」\r，每次战斗时自动恢复——\n战斗会优先消耗护盾，当护盾归零再消耗生命。"
                ],
                "false": [
                    "\t[屑猫头]右边的几行是你的\r[#66CCFF]核心数值\r。\n红色剑形代表\r[#f28a94]「攻击」\r，决定你对敌人造成的伤害。\n蓝色盾牌代表\r[#8adbf2]「防御」\r，可以抵消敌人的攻击伤害。",
                    "\t[屑猫头]绿色魔法球代表\r[#a5eda4]「生命」\r，要留意以免卡关哦。\n紫色鞋子代表\r[#ada4ed]「护盾」\r，每次战斗时自动恢复——\n战斗会优先消耗护盾，当护盾归零再消耗生命。"
                ]
            },
            "\t[屑猫头]魔塔游戏的战斗形式为回合制，由你先手攻击。\n你每回合造成的伤害 = \r[#f28a94]自身攻击力 - 怪物防御力\r。\n承受伤害 = \r[#8adbf2]怪物攻击力 - 自身防御力\r。",
            "\t[屑猫头]如果你的攻击 < 怪物的防御……\n嗯，伤害显示会是\r[red]???\r，代表无法战斗。\n反之，你的防御 > 怪物攻击，就能\r[blue]0伤防杀\r怪物。",
            "\t[屑猫头]不用担心计算有困难。\n当你接触怪物时会\r[yellow]自动触发战斗\r，\n系统将根据双方属性，自动帮你把伤害演算好。",
            "\t[屑猫头]喂！别看到大量的文字就犯困啊！\n本喵讲的不好吗！\n好吧，现在让我们来看看怪物吧。",
            "\t[屑猫头]按\r[yellow]X键\r（PC端）或\r[yellow]左下角的手册图标\r（手机端），\n可以打开怪物手册，它记录了怪物的各项属性。\n既然是第一次，那就喵来帮你打开咯。",
            {
                "type": "callBook"
            },
            "\t[屑猫头]这只绒布球……毛茸茸就是你面对的第一只怪物啦。\n除了之前介绍的属性之外，\n还有击败它会掉落的经验——打怪升级游戏的标配。",
            "\t[屑猫头]至于「临界」和「1防」的意思，\n一个代表\r[yellow]减少战斗回合数\r所需提升的攻击数值。\n一个代表增加 1 防御会\r[#66CCFF]减免怪物多少伤害\r。",
            "\t[屑猫头]减少战斗回合数嘛……\n比如毛茸茸防御是 0 ，生命是 21 。\n你的攻击是 1 ，显然要 21 回合才能击败它。",
            "\t[屑猫头]当你提升了 1 点攻击后，\n便只需要 11 回合。\n因此，临界显示你需要提升的攻击数值为 1 。",
            "\t[屑猫头]然后是伤害数字的颜色。\n它代表了击败这只毛茸茸，你生命损失的比重。\n绿色无伤，白色代表33%以下，黄色33%-66%。",
            "\t[屑猫头]橙色是66%-100%。\n至于红色……啊，那个是打不过的。\n撞上去也只会提示打不过啦。",
            "\t[屑猫头]嗯？还站在这里干什么呀！\n看到那只绒布球……不，毛茸茸了没有，\n去和它战斗吧。",
            {
                "type": "hide",
                "remove": true,
                "time": 500
            }
        ],
        "6,3": [
            "\t[屑猫头]啊，可怜的小毛茸茸……\n昏过去了。\n没办法，教学需要嘛。",
            "\t[屑猫头]对了，刚才那扇铁门是无需任何消耗的，\n它一般是用来装饰地图、堵飞点之类……\n至于飞点是什么——暂时还没有讲到那里呢。",
            "\t[屑猫头]现在让本喵继续下一阶段的教学。\n通过前方的上楼梯可以进入下一层，\n走下楼梯则是回到上一层。",
            "\t[屑猫头]按\r[yellow]G键\r（PC端）或\r[yellow]下边栏第二个图标\r（手机端），\n打开楼层传送器，在你经过的楼层中快捷传送。\n毕竟这个塔很高的，来回跑楼梯多累呀……",
            "\t[屑猫头]楼层传送器的妙用之处很多，\n和之前的飞点一样，\n在后面本喵也会慢慢讲到那些。",
            "\t[屑猫头]那么，走上楼梯继续前进吧，\n更多的教学部分在等着你。",
            {
                "type": "hide",
                "remove": true,
                "time": 500
            }
        ]
    },
    "changeFloor": {
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [147,147,147,147,147,147,147,147,147,147,147,147,147],
    [147,147,  0,147,147,  0, 87,  0,147,147,2089,147,147],
    [147,147,10181,147,147,  0,  0,  0,147,147,10265,147,147],
    [147,147,  0,147,147,  0,1838,  0,147,147,803,147,147],
    [147,147,1140,147,147,147, 86,147,147,147,10198,147,147],
    [147,147,147,147,147,  0,201,  0,147,147,147,147,147],
    [147,147,10178,147,147,  0,  0,  0,147,147,10232,147,147],
    [147,147,10180,147,147,  0,  0,  0,147,147,10253,147,147],
    [147,147,10177,147,147,147,1838,147,147,147,10243,147,147],
    [147,147,10180,147,147,147,  0,147,147,147,10240,147,147],
    [147,147,10234,147,147,147,  0,147,147,147,10233,147,147],
    [147,147,10232,147,147,147,  0,147,147,147,10232,147,147],
    [147,147,147,147,147,147,147,147,147,147,147,147,147]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,629,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,793,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}