main.floors.JC10=
{
    "floorId": "JC10",
    "title": "基础 10 层",
    "name": "基础 10 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": 30060,
    "bgm": "j1.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,2": [
            "\t[屑猫头]哼哼，新人哟，\n能走到这里已经很不错了。\n让我们继续来介绍特殊属性。",
            "\t[屑猫头]看到铺满整张地图的数字没有，\n是不是非常眼花缭乱——\n视觉效果不代表实际难度！",
            "\t[屑猫头]嗯……这也就是我们接下来要介绍的——\n\r[#66CCFF]地图伤害类属性\r。",
            {
                "type": "text",
                "text": "\t[屑猫头]你看，本层每个格子上的数字，\n实际上代表你\r[yellow]经过这个格子\r时，\n预期会受到的地图伤害。",
                "pos": [
                    80,
                    270
                ]
            },
            {
                "type": "text",
                "text": "\t[屑猫头]就比如右上角那一圈，\n你走上去就会掉 8000 生命。\n当然，只要把右上那个怪物打晕，也就不会受伤了。",
                "pos": [
                    90,
                    100
                ]
            },
            {
                "type": "text",
                "text": "\t[屑猫头]简单列举一下吧！\n像右上角那种是\r[#c677dd]「领域」\r，\n在领域怪身边的x格内，每走一步都会受到领域伤害。",
                "pos": [
                    90,
                    100
                ]
            },
            {
                "type": "text",
                "text": "\t[屑猫头]再看左上角的\r[#c0ddbb]「捕捉」\r属性，\n要是你敢踏入它的\r[#c0ddbb]十字\r范围，\n直接就会被那个家伙拖进强制战斗……",
                "pos": [
                    0,
                    100
                ]
            },
            {
                "type": "text",
                "text": "\t[屑猫头]再看我身后站成一排的四个小机器人，\n也就是\r[#bb99ee]「夹击」\r怪！\n从两个夹击怪之间穿过，生命值直接砍半！",
                "pos": [
                    30,
                    160
                ]
            },
            {
                "type": "text",
                "text": "\t[屑猫头]不过放心啦，在《纳可物语》中，\n\r[#bb99ee]夹击伤害\r不超过怪物本身的战斗伤害。\n总之过夹击不会比直接打怪更疼就是了。",
                "pos": [
                    30,
                    160
                ]
            },
            {
                "type": "text",
                "text": "\t[屑猫头]至于地图正左和正右侧，\r[#8888e6]「阻击」\r属性的怪物……\n当你踏进它的警戒区，它会朝你的反方向后退，\n顺便薅走你一些生命。",
                "pos": [
                    15,
                    270
                ]
            },
            {
                "type": "text",
                "text": "\t[屑猫头]显然有这种属性不一定是坏事嘛。\n比如本图中，可以推动阻击怪物向下或是向上，\n以白嫖它身后的珍贵宝物。",
                "pos": [
                    25,
                    270
                ]
            },
            "\t[屑猫头]类似的属性还有很多，喵就不再一一介绍了。\n总之，遇到地图伤害，先打开手册，\n查看怪物的详细机制，再做出应对！",
            "\t[屑猫头]最后还有一个叫做「轻按」的小技巧。\n按\r[yellow]空格/space键\r（PC端）或\r[yellow]双击角色\r（手机端），\n能直接拾取你面前的物品，无需多踩一步地图伤害。",
            "\t[屑猫头]啊对了，送你一个中心对称飞行器。",
            {
                "type": "setValue",
                "name": "item:centerFly",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "hide",
                "remove": true,
                "time": 500
            }
        ]
    },
    "changeFloor": {
        "6,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,6": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [147,147,147,147,147,147,147,147,147,147,147,147,147],
    [147,635,147,147,147,147, 88,147,147,147,147,587,147],
    [147,2151,  0, 81,638,147,891,147,236,  0, 21,2149,147],
    [147, 22,147,147, 86,147,147,147,635,147,147,  0,147],
    [147,  0,147,2148,636,2148,641,2148,  0,2148,147,  0,147],
    [150723,  0,2151,572,  0,147,147,147, 21, 81,636, 81,150723],
    [895,2150,147,147,236,147, 87,147,240,147,147,2150, 47],
    [147,  0,147,147, 21,147,147,147,637,147,147,  0,147],
    [147,  0, 81, 81,234,  0,619,  0,234, 58, 82, 21,147],
    [147, 34,147,147,147,2148,  0,2148,147,147,147, 81,147],
    [147,2149,147,147,639, 84,  0, 84,640,147,147,2151,147],
    [147, 60,587,147,147, 24,  0, 24,147,147,636, 60,147],
    [147,147,147,147,147,147,147,147,147,147,147,147,147]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [150707,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,150707],
    [150715,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,150715],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}