main.floors.JC2=
{
    "floorId": "JC2",
    "title": "基础 2 层",
    "name": "基础 2 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": 30060,
    "bgm": "j1.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,4": [
            "\t[屑猫头]嗯，接下来是血瓶。\n看到你左右两边装着彩色液体的不明瓶子了嘛？\n触碰它们可以恢复你的生命。",
            "\t[屑猫头]最小的红血瓶可以回100血。\n之后按照红、蓝、黄、绿的顺序二倍递增。",
            "\t[屑猫头]这张图下侧展示了更高阶的血瓶外观。\n高一阶的红血瓶，回血是低一阶绿血瓶的两倍。\n而当血瓶达到\r[aqua]四阶\r后，这一倍率变为四倍。",
            "\t[屑猫头]现在送你20血当作认真听讲的奖励！\n拿起你旁边的血瓶，\n击败我身后的这只训练用小飞蛾吧。",
            {
                "type": "setValue",
                "name": "status:hp",
                "operator": "+=",
                "value": "20"
            },
            {
                "type": "hide",
                "remove": true,
                "time": 500
            }
        ],
        "6,6": [
            "\t[屑猫头]非常棒！现在让本喵继续下一阶段的教学。\n接下来要了解简单的魔塔游戏布局。",
            "\t[屑猫头]看到我身后的这些怪物和血瓶了嘛？\n它们和墙体组成了这一层的\r[#8aa0f2]「地图结构」\r。",
            "\t[屑猫头]魔塔是固定数值的RPG游戏，\n可不是那种随便逛街的开放世界。\n在高难度下，每层的地图结构可都是暗藏杀机的。",
            {
                "type": "text",
                "text": "\t[屑猫头]比如这里，中间的荧光飞蛾显然不用考虑。\n看起来走右边能够拿到蓝血瓶，\n比起走左边收益更高些。",
                "pos": [
                    35,
                    80
                ]
            },
            {
                "type": "text",
                "text": "\t[屑猫头]可只拿右边的血瓶是打不过后续怪物的。\n嗯……这个时候就要回左边去凑血，\n而左下的绒布球相对右下较弱，变为了优势路。",
                "pos": [
                    15,
                    80
                ]
            },
            "\t[屑猫头]哎呀……实战的情况要比这复杂很多啦。\n去亲手试试吧。\n站在原地听理论会变成蘑菇的……",
            "\t[屑猫头]找到正确的路线，继续前进吧——\n我在下一层等你。",
            {
                "type": "hide",
                "remove": true,
                "time": 500
            }
        ]
    },
    "changeFloor": {
        "6,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [147,147,147,147,147,147,147,147,147,147,147,147,147],
    [147,147,147,147,147,  0, 88,  0,147,147,147,147,147],
    [147, 34,147, 31, 86,  0,  0,  0, 86, 32,147, 33,147],
    [147,147,147,147,147,  0,  0,  0,147,147,147,147,147],
    [147,10189,147,10186,147,147,891,147,147,10187,147,10196,147],
    [147,147,147,147,147,147,204,147,147,147,147,147,147],
    [147,147,147,147,147,147,891,147,147,147,147,147,147],
    [147,147,203, 31,  0,201,  0,201,  0, 32,203,147,147],
    [147, 31,  0,147,147,147, 31,147,147,147,  0, 31,147],
    [147,  0, 32,147,147,147,211,147,147,147, 32,  0,147],
    [147,147,202,  0, 31,204,  0,204, 32,  0,203,147,147],
    [  4,  4,  4,  4,  4,147, 87,147,  4,  4,  4,  4,  4],
    [10187, 58,10188,619,  4,147,147,147,  4,10189,1009,10193,1486]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}