main.floors.JC20=
{
    "floorId": "JC20",
    "title": "基础 20 层",
    "name": "基础 20 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": 30060,
    "bgm": "j1.mp3",
    "firstArrive": [
        {
            "type": "changePos",
            "direction": "down"
        },
        "\t[屑猫头]嗯，你来到了基础教程的最后一层。\n这表明你从新人成长为了一名魔塔勇士。",
        "\t[屑猫头]不过……基础教程教的不过是魔塔游戏的底层逻辑，\n相当于「塔基」，是游玩魔塔的基石。\n真正的魔塔是建立在基石之上的「建筑物」。",
        "\t[屑猫头]那些冲层偷宝物、绕Boss的路线，\n看似危机重重实则可以零伤清空的布局，\n堪称解谜游戏一般巧妙的道具用法……",
        "\t[屑猫头]唔……哪怕只涉及到魔塔的基本规则，\n真要讲起来是讲不完的——\n喵怕麻烦，你也会听得不耐烦啦。",
        "\t[屑猫头]不过这也不是基础教程的本意。\n很显然，作为新晋的勇者，\n你已经具备去见识更多塔的资本了。",
        "\t[屑猫头]喵目的是——大致教会你理解魔塔机制，\n以便更轻松地进行游戏。\n至于各种更深入的内容或是梗之类的……",
        "\t[屑猫头]就在玩塔过程中进行参透吧！\n以及——在基础教程之后，\n还有服务于愿意深入研究的玩家的\r[yellow]进阶教程\r。",
        "\t[屑猫头]你问进阶教程有什么？\n嗯，会教你怎么用本塔特殊的\r[aqua]高阶道具\r、\n怎么用\r[yellow]楼层传送器\r的锚点来多点出击……",
        "\t[屑猫头]玩转可怕的\r[lime]败移/求援\r怪物，\n或者是把各种奇怪的Buff怪变为免费血瓶……\n啊，剧透得有点多了。",
        "\t[屑猫头]那么，在这里进行结算之后，\n就来进阶教程挑战一下吧。",
        "\t[屑猫头]参考数据：\n如果你拿到了全部绿钥匙，\n那么当前绿钥匙数量将是\r[lime]52把\r！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,9": [
            {
                "type": "choices",
                "text": "\t[屑猫头]做得不错，算你通过啦。\n要结算成绩吗？",
                "choices": [
                    {
                        "text": "要",
                        "action": [
                            "计分方式：绿钥匙*100亿+当前累计分数。",
                            {
                                "type": "setValue",
                                "name": "status:hp",
                                "operator": "+=",
                                "value": "item:greenKey*1e14"
                            },
                            {
                                "type": "win",
                                "reason": "基础 - 茧之门"
                            }
                        ]
                    },
                    {
                        "text": "不要",
                        "action": [
                            "\t[纳可]不要！",
                            "\t[屑猫头]诶？"
                        ]
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "6,3": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  4,  4,  4,147,10180,147,10243,147,10243,147,  4,  4,  4],
    [  4,  4,  4,147,147,147,147,147,147,147,  4,  4,  4],
    [  4,  4,147,147,147,  0,  0,  0,147,147,147,  4,  4],
    [  4,147,147,147,147,  0, 88,  0,147,147,147,147,  4],
    [  4,  4,147,147,  0,  0,  0,  0,  0,147,147,  4,  4],
    [  4,  4,  4,147,  0,  0,  0,  0,  0,147,  4,  4,  4],
    [  4,  4,  4,147,  0,  0,  0,  0,  0,147,  4,  4,  4],
    [  4,  4,  4,147,  0,  0,  0,  0,  0,147,  4,  4,  4],
    [  4,  4,  4,147,  0,  0,  0,  0,  0,147,  4,  4,  4],
    [  4,  4,  4,147,147,  0,891,  0,147,147,  4,  4,  4],
    [  4,  4,147,147,147,  0,  0,  0,147,147,147,  4,  4],
    [  4,147,147,147,147,147,147,147,147,147,147,147,  4],
    [147,147,10169,147,10243,147,10232,147,10180,147,10249,147,147]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}