main.floors.JC3=
{
    "floorId": "JC3",
    "title": "基础 3 层",
    "name": "基础 3 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": 30060,
    "bgm": "j1.mp3",
    "firstArrive": [
        {
            "type": "changePos",
            "direction": "up"
        },
        "\t[屑猫头]嗨，你来啦。\n现在让本喵继续下一阶段的教学。",
        "\t[屑猫头]怎么样，小飞蛾咬人很疼吧。\n也对呢，在没有\r[#66CCFF]「宝石」\r加成的时候，\n以初始面板是很难应对越来越强的怪物的。",
        "\t[屑猫头]在现代魔塔中，一般有四种能提升属性的宝石。\n\r[#f28a94]红宝石加「攻击」\r，\r[#8aa0f2]蓝宝石加「防御」\r。\n\r[#a5eda4]绿宝石加「护盾」\r，\r[yellow]黄宝石加「全属性」\r。",
        "\t[屑猫头]你每通过若干层，就能进入更高等级的区域。\n在高级区域，宝石、血瓶效果会比上个区域，\n增强 2 到 2.5 倍不等。",
        "\t[屑猫头]与血瓶一样，宝石也是有等级的。\n同色不同形状的宝石，效果天差地别——\n本层上方便展示了五种不同的宝石等级。",
        "\t[屑猫头]现在，拿起你身边的这些宝石吧。\n魔塔游戏的属性是\r[yellow]重中之重\r，当你变得更强，\n什么小飞蛾还是红布球都是小意思啦。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,8": [
            {
                "type": "if",
                "condition": "(status:lv==2)",
                "true": [
                    "\t[屑猫头]嗯，接下来是同时带有宝石和血瓶的布局。\n看起来你已经成功升了一级，\n那喵就不用特意介绍升级体系了。"
                ],
                "false": [
                    "\t[屑猫头]嗯，接下来是同时带有宝石和血瓶的布局。\n等等，你说后面这只法师破不了防御吗……",
                    "\t[屑猫头]唔，注意你现在升级所需的经验。\n回到刚才那一层，打掉剩下的小怪，\n就能升到下个等级——重要的是升级可以得到属性。",
                    "\t[屑猫头]《纳可物语》对清怪要求并不是很严谨，\n但总有某些情况是升级收益很高的。"
                ]
            },
            "\t[屑猫头]听——好——啦——！\n由于属性的重要性，\n一般而言宝石的优先级往往在血瓶之上。",
            "\t[屑猫头]而在前期属性紧缺的时候，\n我们注意到「临界」是特别密集的。\n因此这时往往是\r[#f28a94]红宝石＞蓝宝石\r。",
            "\t[屑猫头]同样的，当后期你的防御接近怪物攻击，\n即将达成「0伤防杀」时，\n优先级又变成了\r[#8aa0f2]蓝宝石＞红宝石\r。",
            "\t[屑猫头]\r[yellow]黄宝石\r同时增加三围属性和生命，收益一般很显著。\n而\r[lime]绿宝石\r对处理低伤小怪很有帮助，优先级不高。\n明确这些，继续前进，走到下一层吧。",
            {
                "type": "hide",
                "remove": true,
                "time": 500
            }
        ]
    },
    "changeFloor": {
        "6,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [147,147,147,10188,147,147,147,147,147,10189,147,147,147],
    [147,10187,147,586,147,  0, 87,  0,147,637,147,10193,147],
    [147,578,147,147,147,  0, 31,  0,147,147,147,641,147],
    [147,147,147,147,147,  0,208,  0,147,147,147,147,147],
    [147,147, 32,  0,147,147, 34,147,147,  0, 34,147,147],
    [147, 29,  0, 31,210, 32,  0, 31,210, 31,  0, 29,147],
    [147,206,147,147,147,147,147,147,147,147,147,206,147],
    [147,  0,205, 27,204,  0,207,  0,204, 28,205,  0,147],
    [147,147,147,147,147,147,1838,147,147,147,147,147,147],
    [147,  0,147,  0,147,  0,  0,  0,147,  0,147,  0,147],
    [147,147,147,147,147,  0,  0,  0,147,147,147,147,147],
    [147, 28, 86, 27, 86,  0, 88,  0, 86, 29, 86, 30,147],
    [147,147,147,147,147,147,147,147,147,147,147,147,147]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,793,  0,629,  0,  0,  0,  0,  0,803,  0,10248,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}