main.floors.JC4=
{
    "floorId": "JC4",
    "title": "基础 4 层",
    "name": "基础 4 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": 30060,
    "bgm": "j1.mp3",
    "firstArrive": [
        {
            "type": "changePos",
            "direction": "down"
        },
        "\t[屑猫头]非常棒！现在让本喵继续下一阶段的教学。\n在你左右两边的是钥匙和门。",
        "\t[屑猫头]魔塔中的门锁系统遵循同颜色对应法则。\n讲人话就是，\r[yellow]黄钥匙开黄门\r，\r[#66ccff]蓝钥匙开蓝门\r，\n\r[#f28a94]红钥匙开红门\r……",
        "\t[屑猫头]非常好理解！但别看只是这样子，\n钥匙转化可是魔塔世界里非常重要的玩法。\n而在高难度下留一堆钥匙也是「强者」的证明。",
        "\t[屑猫头]什么？你问那两把\r[lime]绿色\r的钥匙……\n那可是价值连城的收藏品！",
        "\t[屑猫头]简而言之，它的作用是\r[yellow]动态调节难度\r，\n在本塔之中，你使用的\r[lime]绿钥匙\r越少，\n游戏难度也就越高。",
        "\t[屑猫头]当然，一把不用也是可以通关的！\n你使用的绿钥匙数量，\n记录在你面板上的那个\r[lime]绿门图标\r里。",
        "\t[屑猫头]现在去试试开门的感觉吧！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,4": [
            "\t[屑猫头]嗯，按理来讲开掉除了绿门之外的门，\n可以刚好击败这只曾经卡了我们很久的荧光飞蛾。",
            "\t[屑猫头]同样的，开掉本层所有门，\n你刚好能够击败下面那只大飞蛾。",
            "\t[屑猫头]实战中一些高手玩家会在低级区域囤积钥匙，\n只保留刚好击败boss的血量。",
            "\t[屑猫头]他们将钥匙留在高级区域使用，\n以达成越来越高的收益。",
            "\t[屑猫头]这里就没必要要求这么多了！\n黄钥匙多用一些无伤大雅，蓝钥匙相对稀少，\n而红钥匙属于战略资源，与道具等价。",
            "\t[屑猫头]尽管在本层你可以随意使用钥匙，但在魔塔游戏里，\n当看到被门挡住的路或者宝石时，不要着急开门，\n简单考虑一下钥匙持有量和后续需求吧。",
            {
                "type": "hide",
                "remove": true,
                "time": 500
            }
        ],
        "6,6": [
            "\t[屑猫头]嗯，这堆钥匙堆在这里，\n要一个个上去捡有点烦诶。",
            "\t[屑猫头]按\r[yellow]T键\r（PC端）或\r[yellow]下边栏第三个图标\r（手机端），\n打开道具栏，你可以看到一个\r[#66CCFF]「自动化开关」\r。",
            "\t[屑猫头]点开它，\n\r[#66CCFF]「自动拾取」\r可以帮你拾取当前能接触到的资源。\n\r[yellow]「自动清怪」\r则会自动击杀零伤害怪物。",
            "\t[屑猫头]为了更方便的游戏体验，现在就统统打开吧。\n一般只在高难度的少数特殊情况下时，\n需要关掉自动拾取/清怪，来控血/控buff等。",
            {
                "type": "hide",
                "remove": true,
                "time": 500
            }
        ]
    },
    "changeFloor": {
        "6,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,12": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [147,147, 58, 84, 24,  0,  0,  0, 24, 84, 58,147,147],
    [147,147,147,147,147,  0, 88,  0,147,147,147,147,147],
    [ 59,147, 31, 81, 21,  0,  0,  0, 22, 82, 32,147, 27],
    [212,147,147,147,147,  0,  0,  0,147,147,147,147,  0],
    [ 23,147, 34, 83, 23,  0,891,  0,1006, 15, 33,147, 28],
    [ 81,147,147,147,147,147,211,147,147,147,147,147,211],
    [210, 28,  0,207, 81,  0,891,  0, 82,207, 27,  0, 32],
    [147, 81,147,147,147, 22, 21, 21,147,147,147,210,147],
    [147, 31,147, 32, 81, 21,1006, 22, 82, 33,147, 34,147],
    [147, 81,147,147,147, 22, 21, 21,147,147,147,  0,147],
    [147,  0,209, 27,147,147,966,147,147, 33,209, 28,147],
    [147, 15,147,208, 23,147,214,147, 23,216,147, 82,147],
    [585,208,147,147,147,147, 87,147,147,147,147,208,576]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}