main.floors.JC5=
{
    "floorId": "JC5",
    "title": "基础 5 层",
    "name": "基础 5 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": 30060,
    "bgm": "j1.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,10": [
            "\t[屑猫头]哎呀！我的绿钥匙！\n怎么被你吃掉了……",
            "\t[屑猫头]可恶，不肯交出来是嘛。\n好，你已经掌握了魔塔的基本技巧！",
            {
                "type": "setValue",
                "name": "status:atk",
                "operator": "-=",
                "value": "5"
            },
            {
                "type": "setValue",
                "name": "status:def",
                "operator": "-=",
                "value": "5"
            },
            {
                "type": "setValue",
                "name": "status:mdef",
                "operator": "-=",
                "value": "20"
            },
            "\t[屑猫头]先把你能力扣掉！\n来，试试前面这张图吧。\n让我看看你学得怎么样了。",
            "\t[纳可]……\n\n那，那是——！",
            {
                "type": "function",
                "function": "function(){\ncore.drawWarning(6, 1, '血洛游卒')\n}"
            },
            {
                "type": "sleep",
                "time": 3000,
                "noSkip": true
            },
            "\t[屑猫头]怎么样，怕了吧？\n你以为还是对付之前的小怪物，\n没想到是这个塔前期的某个卡血怪哒。",
            "\t[屑猫头]但是不要慌，这塔不难。\n这一层蕴含了之前所有教学内容，\n可以说是绝佳的试炼机会。",
            "\t[屑猫头]实在是被怪物追着打的话，\n就把喵刚才放在这里的绿钥匙用了吧。\n哼……便宜你了。",
            {
                "type": "hide",
                "remove": true,
                "time": 500
            }
        ]
    },
    "changeFloor": {
        "6,12": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,0": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [147,147,147,147,147,147, 87,147,147,147,147,147,147],
    [147,577,  0,147, 34,147,215,147,578,147,576,  0,147],
    [147, 32, 22,212,577,209,579,209, 32,213, 34, 28,147],
    [ 86,211,  0,147, 32,147, 15,147, 27,147,586,  0, 82],
    [ 81,147,147,147, 82,147, 22,147,214,147,147,147, 86],
    [ 86, 30, 15, 28,  0,147, 81,147, 29, 82, 28, 31, 82],
    [147,214,147,147, 21,208, 31,211, 21,147,147, 81,147],
    [147, 27, 21,147, 82,147,208,147, 82,147, 21,  0,147],
    [147, 31,211, 81,576,147, 22,147, 32, 82,210, 27,147],
    [147,  0, 21,147,  0,207, 21,207,  0,147, 21,  0,147],
    [147,147,147,147,147,147,1838,147,147,147,147,147,147],
    [147, 27, 28, 84, 30, 84,902, 84, 33, 84, 34, 33,147],
    [147,147,147,147,147,147, 88,147,147,147,147,147,147]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}