main.floors.JC6=
{
    "floorId": "JC6",
    "title": "基础 6 层",
    "name": "基础 6 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": 30060,
    "bgm": "j1.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,2": [
            "\t[屑猫头]非常棒！现在让本喵继续下一阶段的教学。\n怎么样，刚才那层爽不爽？",
            "\t[屑猫头]你以为这就是高复杂度了嘛？\n错了！看看我身后门里关着的，\n这两个长得像锄头的东西吧。",
            "\t[屑猫头]没错，这是大名鼎鼎的道具\r[gray]「破墙镐」\r，\n简称\r[gray]「破」\r，\n能破坏面前 1 格「标准墙体」！",
            "\t[屑猫头]每个区域的「标准墙体」材质不尽相同，\n而一般情况下，\n它都代表组成地图结构最多的那种墙体。",
            "\t[屑猫头]比如这个教程关，\n就是代表两侧的灰黑格子墙咯。",
            "\t[屑猫头]破墙镐的话，一般是优先砸开——\n能提供大量属性的剑/盾等重要资源，\n或是挡在迅速过图捷径上的墙等。",
            "\t[屑猫头]破开这层的剑盾，\n之前这只凶恶的精英怪也变成菜菜了，\n一剑足以制敌！",
            {
                "type": "hide",
                "remove": true,
                "time": 500
            }
        ],
        "6,6": [
            "\t[屑猫头]嗯，然后是一如既往的实战环节，\n打掉下方这只暴露的兽人进入下一层……",
            "\t[屑猫头]Boss旁边的星空不属于标准墙体，\n肯定是不能破开的。\n喂喂，也不能用镐子砸Boss的脑壳！",
            "\t[屑猫头]还是用这两把镐子凑够血和属性，\n然后正面赢下来吧！\n这应该不难。毕竟你的进步也很快嘛。",
            "\t[屑猫头]打赢之后，\n本喵在下一层等你。",
            {
                "type": "hide",
                "remove": true,
                "time": 500
            }
        ]
    },
    "changeFloor": {
        "6,0": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [147,147,147,147,147,147, 88,147,147,147,147,147,147],
    [147,147,10287,147,615,147,  0,147,773,147,10286,147,147],
    [147,147,147,147,147,147,891,147,147,147,147,147,147],
    [147,147,147,147, 47, 81, 32, 82, 47,147,147,147,147],
    [147,576,147,  4,  4,  4,215,  4,  4,  4,147,585,147],
    [147,218,147,  4, 58, 84,  0,965,587,  4,147,222,147],
    [147,  0,217,  4,  4,  4,891,  4,  4,  4,217,  0,147],
    [147,218, 34,219, 33,216,902,216, 33,219, 34,222,147],
    [147,584,147,147,147,147, 58,147,147,147,147,586,147],
    [147,  0,147,147,147, 47,  0, 47,147,147,147,  0,147],
    [ 59,220, 32,215,147,  4,221,  4,147,215, 32,220,587],
    [147,147,147,585,147,  4, 87,  4,147,576,147,147,147],
    [147,147,147,147,147,  4,  4,  4,147,147,147,147,147]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}