main.floors.JC7=
{
    "floorId": "JC7",
    "title": "基础 7 层",
    "name": "基础 7 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": 30060,
    "bgm": "j1.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,8": [
            {
                "type": "if",
                "condition": "(flag:jc7===0)",
                "true": [
                    "\t[屑猫头]遇到很多墙堵在前进的路上，\n要怎么办呢。\n首先排除破墙，那需要的破墙镐太多了。",
                    "\t[屑猫头]让喵为你介绍下一种道具——\n\r[orange]「中心对称飞行器」\r，\n简称\r[orange]「飞」\r。",
                    "\t[屑猫头]这个塔的地图是13*13，\n而它能够以地图中央的格子（7,7）位置为中心点，\n把你送到你\r[orange]当前位置\r的\r[orange]中心对称点\r。",
                    "\t[屑猫头]中心对称飞行器也不是什么地方都可以飞，\n传送的落点必须得是空地才行。",
                    "\t[屑猫头]也就是只能飞到上面没有墙壁、怪物，\n也没有宝石血瓶道具等任何事物的格子。\n没错，这也就是几层之前提到过的\r[orange]飞点\r了。",
                    "\t[屑猫头]就比如，站在我所处的点位，\n就能飞向对面铁门里的那个点位啦。",
                    "\t[屑猫头]紧急脱战、快速冲层、偷偷宝物……\n虽然飞的泛用性没有破那样强，\n但毫无疑问在特定场合能提供极大的收益。",
                    "\t[屑猫头]顺便一提，\n作为道具，飞、破与红钥匙原则上是等价的，\n在结算分数时统一计分10分。",
                    "\t[屑猫头]而在许多场合下并非如此，\n就像现在，几乎是 1飞 = 3破 甚至更高的局面。",
                    "\t[屑猫头]好啦，取得飞行器，并找到一个好的中心对称点，\n然后学习使用中心对称飞行器吧。",
                    {
                        "type": "setValue",
                        "name": "flag:jc7",
                        "operator": "+=",
                        "value": "1"
                    }
                ],
                "false": [
                    "\t[纳可]麻烦让一让，你挡飞点了……",
                    "\t[屑猫头]不要！",
                    "\t[纳可]诶？！"
                ]
            }
        ]
    },
    "changeFloor": {
        "6,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {
        "3,3": [
            {
                "type": "if",
                "condition": "(flag:jc7>=0)",
                "true": [
                    "\t[屑猫头]非常好！你面前的怪物暂时是打不过的。\n现在按G键，\n用楼层传送器离开这里吧。"
                ],
                "false": []
            }
        ],
        "11,1": [
            {
                "type": "if",
                "condition": "(flag:jc7>=0)",
                "true": [
                    "\t[屑猫头]啊对了，如果想不使用任何一把绿钥匙，\n务必利用楼层传送器做一个【锚点】。",
                    "\t[屑猫头]具体操作是，使用楼传而不是楼梯离开本层时，\n你离开前站的地方便会变为【锚点】——\n再次传送回到本层的时候，会传送到【锚点】处。",
                    "\t[屑猫头]在这里，你只需要知道这个就行了。\n要深入探究，就去进阶教程里看看吧。"
                ],
                "false": []
            }
        ]
    },
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [147,147,147,147,147,147,147,147,147,147,147,147,147],
    [147,584,585,  0,208,224, 87,223,221,  0, 58, 59,147],
    [147,147,147,218,147,147, 86,147,147,224,147,147,147],
    [147,147,147, 58,147,147, 86,147,147,587,147,147,147],
    [147,147,147,147,147,147,  0,147,147,147,147,147,147],
    [147,147,147,147,147,147,147,147,147,147,147,147,147],
    [147,10284,147,10285,147,147,147,147,147,10285,147,10284,147],
    [147,147,147,147,147,147,147,147,147,147,147,147,147],
    [147,147,147,147,147,147,1838,147,147,147,147,147,147],
    [147,147,147,584,147,147, 86,147,147,585,147,147,147],
    [147,147,147, 84,147,147, 86,147,147, 84,147,147,147],
    [147, 50,219, 34,  0, 24, 88, 24,  0, 34,222, 50,147],
    [147,147,147,147,147,147,147,147,147,147,147,147,147]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}