main.floors.JC8=
{
    "floorId": "JC8",
    "title": "基础 8 层",
    "name": "基础 8 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": 30060,
    "bgm": "j1.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,4": [
            "\t[屑猫头]非常棒！现在是破飞联立的战斗层。",
            "\t[屑猫头]道具联立层可以构造极高复杂度。\n如果再加上喵之后会讲到的地图伤害等……\n不敢想呀。",
            "\t[屑猫头]但显然《纳可物语》不是高难塔，\n复杂度？卡血？不存在的！",
            "\t[屑猫头]在这里，你只需要一个额外的提示就够了——\n如果你不想用绿钥匙，\n又眼馋绿门里面的资源的话……",
            "\t[屑猫头]嗯，喵带的新人肯定能悟到什么啦，\n就不需要额外点破了。\n那么，祝你好运~",
            {
                "type": "hide",
                "remove": true,
                "time": 500
            }
        ]
    },
    "changeFloor": {
        "6,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [147,147,147,587,147,147, 31,147,147, 59,147,147,147],
    [147,585,147, 84, 86,  0, 88,  0, 86, 84,147,584,147],
    [147,228,147,147,147,  0,  0,  0,147,147,147,225,147],
    [147, 34,  0,586,147, 24,  0, 24,147, 33,  0, 34,147],
    [147,  0,577,  0,147,147,891,147,147,  0,579,  0,147],
    [147,147,223,147,147,147, 86,147,147,147,224,147,147],
    [147,147,  0, 58,221,  0, 50,  0,221,586,  0,147,147],
    [147,224,576,147,147,147,223,147,147,147,577,227,147],
    [147,  0,147,  0, 33,223,637,225, 58,  0,147,  0,147],
    [147,584,228, 47,147,147,576,147,147,578,228,585,147],
    [147,147, 59,147,147,147,233,147,147,147, 33,147,147],
    [147,147,227,579,  0,  4, 87,  4,  0,584,225,147,147],
    [147,147,147,147,579,  4,  4,  4,585,147,147,147,147]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}