main.floors.JC9=
{
    "floorId": "JC9",
    "title": "基础 9 层",
    "name": "基础 9 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": 30060,
    "bgm": "j1.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,9": [
            "\t[屑猫头]非常棒！现在来看一些特殊属性。",
            "\t[屑猫头]实际上，你之前击败的怪物，\n也有不少具备各种特殊属性。\n什么迅捷啦，魔攻啦，坚固连击牵制……",
            "\t[屑猫头]在手册中按\r[yellow]空格/space键\r（PC端）或\r[yellow]直接触屏\r（手机端），\n便可打开关于该怪物特殊属性的详细介绍。",
            "\t[屑猫头]像迅捷这种先手攻击一次的属性，\n影响不大，喵也就不一一介绍了。",
            "\t[屑猫头]但遇到那种一眼看上去很陌生的属性，\n甚至伤害数字带\r[aqua]诡异图标\r的怪物……\n请打起十二分精神！",
            "\t[屑猫头]比如左下角的\r[yellow]「光环」\r，\n当它在场时，为全图怪物提供攻防属性！",
            "\t[屑猫头]属性在魔塔中的影响是决定性的，\n这种怪物也自然是很关键——\n只要代价不算太大，就要优先处理\r[yellow]「光环」\r！",
            "\t[屑猫头]再看地图右侧的\r[gray]「异界之门」「时封」\r。\n一个是回合数平方化，\n一个是伤害直接变为（回合数+1）倍。",
            "\t[屑猫头]喵这样说，你肯定明白了——\n这和那些杂鱼属性有本质区别。\n让它多活过几回合就会出事了啊！",
            "\t[屑猫头]至于左上角那个边战斗边回血的\r[lime]「回春」\r，\n既然血高攻低，又是牵制怪，\n那就可以考虑防杀了。",
            "\t[屑猫头]总之，遇到强大的属性不要害怕，\n不必像解数学题那样精确计算。\n但也不要不看手册就撞上去就是啦。",
            "\t[屑猫头]请利用好本层的资源，\n击败Boss通过这一层吧。",
            {
                "type": "hide",
                "remove": true,
                "time": 500
            }
        ]
    },
    "changeFloor": {
        "6,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [147,147,147,147,  4,  4,  4,  4,  4,147,147,147,147],
    [147, 22,572,586,  4,  0, 87,  0,  4,584, 23,637,147],
    [147,584,2144,584,  4,  0,240,  0,  4,587,2146, 60,147],
    [147,147, 82,  4,  4,  4, 82,  4,  4,  4, 81,147,147],
    [147,636, 21,  0,147,147, 83,147,147,235,  0, 21,147],
    [147,147,147,225,147, 21, 58,584,147, 81,147,147,147],
    [894, 15, 16, 22,228, 33,902, 59,227, 21, 84,965,893],
    [147,147,147, 81,147,585,572, 21,147,232,147,147,147],
    [147, 22,  0,230,147,147, 86,147,147,  0, 59,635,147],
    [147,147, 81,147,147,  0,1838,  0,147,147, 82,147,147],
    [147, 22,2147, 21,147,  0,  0,  0,147,585,2145,636,147],
    [147, 21, 60, 47,147,  0, 88,  0,147,586,572, 22,147],
    [147,147,147,147,147,147,147,147,147,147,147,147,147]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}