main.floors.MT1=
{
    "floorId": "MT1",
    "title": "1 层",
    "name": "1 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "2,1": [
            "\t[老人]血洛大陆强者为尊，\n能量充盈，于修炼而言多有裨益。",
            "\t[老人]大陆上的人类，出生就是微尘级，\n成长中便能达到万物级。\n加以勤奋修炼，有望达到潮汐级。",
            "\t[老人]在这之后则是\r[#75E97E]大地级\r，\n已能算正式立足于大陆的阶层，\n受到各方势力青睐，再无温饱之忧。",
            "\t[老人]而如果想要更进一步，再之上的修炼，\n便是困难重重了。",
            "\t[老人]传说中，达到\r[#75E97E]大地级巅峰\r的强者，\n翻手即可削平一座山头，\n跺脚便能震动数里方圆。",
            "\t[老人]在燕岗领，\r[#75E97E]大地级\r强者是中坚力量。\n但放眼无边无际的血洛大陆，却只是沧海一粟。\n不过，你暂时不需要深入了解这些。",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "1,1": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "6,12": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1, 87,121,  0,201,203,201,  0, 29,  0,202, 31,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,202,  1],
    [  1, 29,  0, 27,210,  0,  1, 28, 31, 21,  1,  0,  1],
    [  1,  0, 21,  0,  1, 28,  1, 27, 31, 21,  1, 50,  1],
    [  1,  1,209,  1,  1,202,  1,  1,  1, 81,  1,  0,  1],
    [  1,  0, 27,  0,  1, 31, 81,203,201,203,  1,201,  1],
    [  1, 32,  0, 29,  1,201,  1,  1,  1,  1,  1,  0,  1],
    [  1,  1, 82,  1,  1, 29,  0, 31,  0,201,  0, 21,  1],
    [  1,  0,213,  0,  1,  1, 83,  1,  1,  1, 81,  1,  1],
    [  1, 23,  0, 28,  1,  0, 22,  0,  1, 21,218, 21,  1],
    [  1,  0, 28,  0,  1, 21,  0, 23,  1, 22, 21, 22,  1],
    [  1,  1,  1,  1,  1,  1, 88,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "bgm": "1.mp3"
}