main.floors.MT105=
{
    "floorId": "MT105",
    "title": "105 层",
    "name": "105 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 100,
    "defaultGround": 70017,
    "bgm": "7.mp3",
    "weather": [
        "rain",
        3
    ],
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,9": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        }
    },
    "changeFloor": {
        "11,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {
        "6,7": [
            "\t[纳布]可可！\n你没事吧，这身伤是怎么回事？",
            "\t[纳可]说来话长……和百家的人在外面打了一架。\n还好有那张符咒在呢。",
            "纳可将之前的事情告诉了纳布，\n也包括自己受伤后，\n观想清野瀑布的意外收获。",
            "\t[纳布]岂有此理，百家那群混蛋！他们真是该死！\n不过是眼红我纳家此次所得，便做出此等勾当。",
            "\t[纳布]那个百兰连大地级都不是，在百家根本没什么地位，\n说帮他出气只不过是个可耻的借口罢了！",
            "\t[纳可]这件事……我也有一部分责任。\n我不该去招惹强大的百家，给家族添麻烦。",
            "\t[纳布]可可，这不是你的错。\n最近一段时间不要单独出去了，我会派人保护你。",
            "\t[纳可]我没关系的。\n父亲大人，您说过的，只有危险的地方才有机遇。\n我能有现在的实力，也正是拜这次生死危机所赐。",
            {
                "type": "if",
                "condition": "(status:lv==11)",
                "true": [
                    "\t[纳布]……大地级二阶？！"
                ],
                "false": [
                    "\t[纳布]……大地级三阶？！"
                ]
            },
            "\t[纳可]没有让父亲大人失望吧？",
            "\t[纳布]哈哈哈，不愧是我纳布的女儿。\n这些天让你受苦了，\n或许我纳家即将要崛起一位真正的强者。",
            "\t[纳可]父亲大人，还有一件事情想问你……\n天外族群，到底是什么？",
            "\t[纳布]也是时候让你知道了。\n这是血洛大陆上流传很久远的一个传说。\n那是在很久很久以前，非常古老的一个时期。",
            "\t[纳布]那时候，我血洛大陆强者如云，\n一位伟大的兽神，带领着整个大陆繁荣昌盛。",
            "\t[纳布]可后来，那天外族群降临，\n欲要奴役整片大陆，掠夺其上的资源！\n难以想象他们是何其强大，没有任何世界能够阻挡。",
            "\t[纳布]之后，伟大的兽神大人，\n率领不朽神殿的神灵们，奋起反抗！",
            "\t[纳布]他们付出了无法想象的牺牲，\n最终兽神大人以陨落为代价，\n终于击退了天外族群！",
            "\t[纳可]……击退吗？\n最终的结果是……两败俱伤？",
            "\t[纳布]算是吧。此后，他们退守那十八重云层之上，\n任何我血洛大陆的强者，\n一旦冲出云层便会被击杀。",
            "\t[纳布]天外族群，也时有强者降临。\n而我血洛大陆，悠久岁月以来，\n也击杀了不少天外来的那些强者。",
            "\t[纳可]原来如此……\n神灵的战争，真是令人震撼，\n可惜离现在的我还太遥远了。",
            "\t[纳可]不知道那个天外世界，\n是不是也有类似的传说呢。\n真是令人神往的世界——",
            "\t[纳布]不要胡闹，可可。\n在你成为真正的强者之前，\n要把生存放在第一位。",
            "\t[纳布]……也是时候，送你进入家族秘境磨炼了。\n要知道，进入纳家秘境的标准，\n就是实力达到大地级中期。",
            "\t[纳可]诶，家族秘境吗？\n可是我现在还差一点……",
            "\t[纳布]你的自创剑法，\n足以令你发挥出超过大地级五阶的实力。\n待你历练有成，那区区百方，自是不足为惧！",
            "\t[纳可]我明白了，父亲大人。",
            "\t[纳布]家族秘境，每半年开启一次。\n这段时间，你就留在家族，\n巩固你当前的境界实力吧。",
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        9
                    ]
                ],
                "remove": true
            }
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [155,155,155,155,155,155,914,914,914,914,914,914,914],
    [155,155,155,155,155,155,914,915,914,914,  0, 88,914],
    [155,155,155,155,155,155,914,914,914,  0, 21,  0,914],
    [155,155,155,155,155,155,914,914,  0, 22,914,914,914],
    [914,62750,62751,914,914,914,914,  0, 21,914,62750,62751,914],
    [914,62758,62759,914,914,914,  0,584,914,914,62758,62759,914],
    [914,914,915,914,914,914,585,914,914,914,914,914,914],
    [914,914,914,914,914,914, 86,914,914,914,914,914,914],
    [915,914,914,914,914,  0,  0,  0,914,914,914,914,915],
    [914,914,914,914,914,  0,706,  0,914,914,914,914,914],
    [914,70197,70198,70199,914,  0,  0,  0,914,70197,70198,70199,914],
    [914,70205,70206,70207,914,914, 87,914,914,70205,70206,70207,914],
    [914,914,914,914,915,914,914,914,914,914,914,915,914]
],
    "bgmap": [

],
    "fgmap": [
    [146,146,146,146,146,146,  0,  0,  0,  0,  0,  0,  0],
    [146,146,146,146,146,146,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,62821,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [62820,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,70173,70174,70175,  0,  0,  0,  0,  0,70173,70174,70175,  0],
    [  0,70181,70182,70183,  0,  0,  0,  0,  0,70181,70182,70183,  0],
    [  0,70189,70190,70191,  0,  0,  0,  0,  0,70189,70190,70191,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [
    [  0,  0,  0, 90,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0, 90,  0,  0,  0, 90,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
]
}