main.floors.MT11=
{
    "floorId": "MT11",
    "title": "11 层",
    "name": "11 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 2,
    "defaultGround": "ground",
    "firstArrive": [
        "\t[纳可]呼……有惊无险呢。\n天空级强者的剑盾，\n足以让我发挥出超过寻常人的力量。",
        "\t[纳可]虽然燕岗城只是一个小型的领地主城，\n可潮汐级，甚至大地级以上的修者……\n并不少见。",
        "\t[纳可]本来按照规定，大地级之下的家族子弟，\n必须向长老申请才能进出家族。\n但现在也管不了这么多了。",
        "\t[纳可]说起来，姐姐在离开前告诉我说，\n最近城外有一处宝藏出世，是一个历练的好机会。",
        "\t[纳可]但是没想到横生变故。\n姐姐……一定不要有事啊。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "8,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  4,  4,  4,  4,  4,  1,  1,  1,  1,  1,  1,  1,  1],
    [  4, 58, 28,576, 84,  0, 88,  0,  1,  0,225,577,  1],
    [  4,  4,  4,  4,  4, 24, 24, 24, 82,224,  0,  1,  1],
    [  4, 58, 27,577, 84,  0, 24,  0,  1,  0,224, 29,  1],
    [  4,  4,  4,  4,  4,  1,  1,220,  1,  1,  1, 81,  1],
    [  1, 27,  0,226, 82, 28,  1, 33,  1, 27,  1,235,  1],
    [  1,  0, 28,  0,  1,  0,224,  0, 81,226, 21,  0,  1],
    [  1,  1, 81,  1,  1, 82,  1,225,  1, 32,  1, 32,  1],
    [  1, 82,  0,227, 32,  0, 21,  0,  4, 84,  4, 84,  4],
    [  1, 21,  1, 82,  1,  1,  1,225,  4, 23,  4, 22,  4],
    [  1, 21,  1,224, 31,  0,227,  0,  4, 23,  4, 59,  4],
    [  1, 21,  1, 28,  1, 29,  1, 34, 87,  4,  4, 22,  4],
    [  1,  1,  1,  1,  1,  1,  1,  1,  4,  4,  4,  4,  4]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "bgm": "2.mp3"
}