main.floors.MT121=
{
    "floorId": "MT121",
    "title": "121 层",
    "name": "121 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 500,
    "defaultGround": 917,
    "bgm": "9.mp3",
    "firstArrive": [
        {
            "type": "changePos",
            "direction": "up"
        },
        "\t[纳鹰]你来了，小丫头。",
        "\t[纳可]……这位前辈，您是？",
        "\t[纳鹰]呵呵，你还不认识我吗？\n确实，距我陨落，也已经过去数千年之久了吧。",
        "\t[纳鹰]想当初，我追随燕岗城主创下战功，\n在燕岗城中建立起纳家，\n也没有想到家族能走到如今这一步。",
        "\t[纳可]您是纳家的先祖！\n这……怎么可能，长老和父亲都说您……",
        "\t[纳鹰]不必惊讶，我确实是纳家的先祖，名为纳鹰。\n如今纳家的后人，也无人知晓我这道意念，\n隐藏在秘境之中。",
        "\t[纳鹰]若是为人知晓，只怕这秘境，\n就要被那群探险者掀个天翻地覆吧。",
        "\t[纳可]这是怎么回事，当年您遭遇了什么变故，\n才变成这个样子？",
        "\t[纳鹰]呵呵，小丫头，别急。\n这也不过是一段无聊的往事罢了。",
        "\t[纳鹰]当年，我为了筹集一笔交易的材料，\n铤而走险，深入危险的血魔海，\n猎取强大的荒兽。",
        "\t[纳鹰]在血魔海，我不慎中了圈套，\n沦为一位\r[pink]领域级\r强者的灵魂奴仆。\n那强者……恐怕与燕岗城主实力相差无几。",
        "\t[纳鹰]这些强者缔结灵魂奴仆，\n无非就是想要获得一个强大的“炮灰”罢了。\n当时的我，根本就无法逃脱。",
        "\t[纳鹰]那些灵魂奴仆，终生服从于主人，没有自由，\n死亡随时会降临到头顶。\n大多数都在没日没夜经受各种危险之后，悲惨死去！",
        "\t[纳鹰]为了摆脱这种宿命，我选择自毁灵魂！\n并且将意识转移到这一缕念头上。",
        "\t[纳鹰]这道念头，原本是寄存在家族秘境之中，\n以备与家族传讯，此时却是派上了用场。",
        "\t[纳可]啊……",
        "\t[纳鹰]能在这般境界和年龄，走到结界湖这里，\n你已经是非常优秀的纳家后人。",
        "\t[纳鹰]若我纳家诞生一位天才，\n或许能重新兴盛，替我报了未尽的仇怨。",
        "\t[纳可]我……可以吗？\n有什么我能帮到前辈的，请尽管说吧。",
        "\t[纳鹰]你的火元素领悟已有小成，\n但提升空间仍然很大。",
        "\t[纳鹰]那领域境界的强者，\n能够张开蕴含法则感悟的【领域】对敌，\n我也曾见识他施展过几次。",
        "\t[纳鹰]数千年过去，我对这领域也有了自己的几分见解。\n现在，我便将自己对这等秘法的领悟，\n传授于你。你仔细听好。",
        "\t[纳可]是，晚辈遵命。",
        "纳鹰伸出手指，点在了纳可眉心处，\n顿时，庞杂的信息涌入了她的脑海中，\n令她一时间沉浸在种种玄妙的领悟意境之内。",
        "过了片刻后，纳可睁开眼睛，\n眼底闪烁着兴奋的光芒。\n她能感受到这些领悟对她的帮助有多大。",
        "\t[纳可]前辈，谢谢您。\n我对之后的路，已经有了清晰的认知。",
        "\t[纳鹰]谢就不必了。\n我想，我的传承到这里也差不多快结束了。",
        "\t[纳鹰]接下来，你要做的是好好努力提升自己，\n等我再次苏醒之后，希望看见你更上一层楼。",
        "\t[纳可]前辈您……要沉睡了？",
        "\t[纳鹰]呵呵，一缕念头自是无法长期维持。\n下一次，就不知道什么时候才能醒了。",
        "\t[纳鹰]如果你希望检验自己——\n去这片结界湖的深处。",
        "\t[纳鹰]那里有一些结界里自然滋生的“灵”，\n诞生了意识，想要反抗和挣脱结界。\n为了秘境的稳固，这个任务便交予你。",
        "\t[纳鹰]去吧，我就不打扰了。",
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    9
                ]
            ],
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    5
                ]
            ],
            "floorId": "MT120",
            "remove": true
        },
        "\t[纳可]前辈放心，等我实力足够，我会去了却您的心愿。\n我……一定会成为家族最优秀的后辈。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,9": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                {
                    "type": "hide",
                    "remove": true
                }
            ]
        }
    },
    "changeFloor": {
        "6,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [151,151,151,151,151, 60,  0, 60,151,151,151,151,151],
    [151,151, 59,151,151,  0, 87,  0,151,151, 60,151,151],
    [151,151, 81,151,151,584,  0,585,151,151, 82,151,151],
    [ 59,151, 58,151,637,  0, 60,  0,637,151,572,151, 60],
    [ 81, 59, 81, 58, 81,151,151,151, 82,572, 82, 60, 82],
    [ 58,151,151,151, 33,151,151,151, 59,151,151,151,572],
    [ 58,151,151,151, 33,151,151,151, 59,151,151,151,572],
    [ 81, 59, 81, 58, 81,151,151,151, 82,572, 82, 60, 82],
    [ 59,151, 58,151,586,  0, 33,  0,586,151,572,151, 60],
    [151,151, 81,151,151,  0,719,  0,151,151, 82,151,151],
    [151,151, 59,151,151,576,  0,577,151,151, 60,151,151],
    [151,151,151,151,151,  0, 88,  0,151,151,151,151,151],
    [151,151,151,151,151, 33,  0, 33,151,151,151,151,151]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}