main.floors.MT128=
{
    "floorId": "MT128",
    "title": "128 层",
    "name": "128 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 500,
    "defaultGround": 917,
    "bgm": "9.mp3",
    "firstArrive": [
        "\t[纳可]越深入结界湖，遇到的“灵”就越强大。\n似乎还滋生了类似于魔族的生命。",
        "\t[纳可]这种生命身上携带的时元素能量……\n恐怕无法取巧，只有纯粹的力量才能将之击破，\n这或许也是魔族以硬实力为尊的原因。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "8,10": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,4": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [151,151,151,151,151,151,151,151,151,151,151,151,151],
    [151,587,  0, 59, 82, 58,  0,576,405, 60,  0,586,151],
    [151,151,151,409,151,411,151,151,151,151,151,404,151],
    [151,151,151, 81,151, 81,151,151,151,151,151, 82,151],
    [151, 87, 82, 58,  0,577, 22,151,151,579,151, 22,151],
    [151,408,151,151,151,151,406,151,151,403,586,  0,151],
    [151,576,  0,579, 81,572,  0,577,151,151,151,406,151],
    [151, 82,151,151,151,381,151,151,151,151,151, 81,151],
    [151,409, 21,151,151, 21, 81, 21,  0,151,151,572,151],
    [151,151,  0,151,151,403,151,151,572,151,151,407,151],
    [151,151, 59,381,586,  0,151,151, 88,151,151, 21,151],
    [151,654,411,151,151, 59,151,151,577,414, 81, 60,151],
    [151,151,151,151,151,151,151,151,151,151,151,151,151]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}