main.floors.MT123=
{
    "floorId": "MT123",
    "title": "123 层",
    "name": "123 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 500,
    "defaultGround": 917,
    "bgm": "9.mp3",
    "firstArrive": [
        "\t[灵]我……是……谁？",
        "\t[纳可]果然，结界湖内有一些已经诞生意识的灵物。\n它们会在内部冲击秘境结界，\n对整个秘境的稳定，造成一定的影响。",
        "\t[纳可]接下来，就在这里寻找达到大地级后期，\n已经足以产生威胁的“灵”，\n将它们的意识重新放归自然吧。",
        "系统提示：结界湖里存在大量短程传送术式，\n同层的两个传送术式之间，能够进行传送。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "1,8": {
            "floorId": "MT123",
            "loc": [
                11,
                1
            ]
        },
        "11,1": {
            "floorId": "MT123",
            "loc": [
                1,
                8
            ]
        },
        "11,10": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "10,2": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [151,151,151,151,151,151,151,151,151,151,151,151,151],
    [151,151,151,151,151,151,151,151, 59, 81,  0,104,151],
    [151,579,  0, 59,404,  0,619,403,  0,151, 87,  0,151],
    [151,151, 81,151,151,151, 82,151,151,151,405,151,151],
    [151,  0,400,572,151,151, 58,151,151,151, 21,576,151],
    [151,572,151,  0,151,151,402,151,151,151,577, 22,151],
    [151,397, 59,401,577, 81,586, 86,151,151,151,400,151],
    [151,151,151, 81,151,151,151,401,151,151,151, 82,151],
    [151,104,151, 58,151,151,151, 86,577,151,151,401,151],
    [151,401,151,402, 82,576,  0,572,151,151,151,572,151],
    [151, 58,  0,572,151,151,151,381, 82, 60,  0, 88,151],
    [151,151,151,403, 81,400,  0,579,151,151,151,151,151],
    [151,151,151,151,151,151,151,151,151,151,151,151,151]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}