main.floors.MT142=
{
    "floorId": "MT142",
    "title": "142 层",
    "name": "142 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1000,
    "defaultGround": 969,
    "bgm": "10.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "3,8": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[燕岗领探险者]这不是纳家的那个小丫头吗？\n现在燕岗城的大地级强者圈子，\n可经常谈到你的名字。",
                "\t[燕岗领探险者]这废墟里现在可不太平，\n抢夺财宝，互相之间的杀戮可少不了。\n我看，还是等那些强者满意离去之后，再进入为好。"
            ]
        },
        "10,9": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[声律城难民]……",
                "\t[纳可]……\n\n你渴了吗？我去帮你找水。",
                "\t[声律城难民]谢谢你，小姑娘，但是没有必要。\n多亏了这次遭难，\n我欠城主府的债务就不需要还了。",
                "\t[声律城难民]过一会，我还会去城里，\n这城里天空乃至云霄级的身家，\n可有不少留在了里面。",
                "\t[声律城难民]哪怕只是一位强者的部分家当，\n也足以令我后半生无忧，哈哈哈——",
                "\t[纳可]……那，那打扰了。"
            ]
        }
    },
    "changeFloor": {
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "6,11": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [159,159,159,159,159,159,159,159,159,159,159,159,159],
    [159,159,159,159,159,159, 87,159,159,159,159,159,159],
    [159,620, 22, 22, 22, 84,  0, 84, 21, 21, 21,621,159],
    [159,159,159,159,159,159, 86,159,159,159,159,159,159],
    [159,159,159,159,159,159, 86,159,159,159,159,159,159],
    [159, 50, 60, 60, 60, 84,  0, 84, 60, 60, 60, 47,159],
    [159,159,159,159,159,159,902,159,159,159,159,159,159],
    [159,159,159,159,159,159, 86,159,159,159,159,159,159],
    [159,159,159,422,  0,  0,  0,  0,  0,  0,159,159,159],
    [159,159,  0,  0,  0,  0,  0,  0,  0,  0,424,159,159],
    [159,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,159],
    [159,159,159,159,159,159, 88,159,159,159,159,159,159],
    [159,159,159,159,159,159,159,159,159,159,159,159,159]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}