main.floors.MT141=
{
    "floorId": "MT141",
    "title": "141 层",
    "name": "141 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1000,
    "defaultGround": 969,
    "bgm": "10.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,9": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[纳可]姐姐，这片庞大的废墟……\n就是曾经的声律城所在地吗？",
                "\t[纳娜米]是的。据传那位天外来客，\n操纵着一艘庞大的飞行物，\n被称之为“D9级飞船”的宫殿类奇宝。",
                "\t[纳娜米]那奇宝将整座城池炸成了废墟，\n令我血洛大陆一方死伤惨重。",
                "\t[纳娜米]最终——靠着几百位城主级别强者的合力围攻，\n甚至还有一位通天彻地的存在出手，\n才终于将那奇宝击落！",
                "\t[纳可]……几百位城主级！\n临近十几座领的强者，已经齐聚在此了吗？",
                "\t[纳娜米]至少来了一多半呢。\n可当强者们攻入“D9飞船”之内，\n才发现那天外来客根本就不在里面。",
                "\t[纳娜米]我们低估了天外来客，\n他早就已经悄悄放出上百艘小型的，\n被称为“B9飞船”的飞行物，欲要逃跑。",
                "\t[纳可]D9，B9。\n感觉上，像是某种划分一样，是什么呢……",
                "\t[纳娜米]谁知道呢。\n的确，这种小型飞行物，材质仅仅是珍宝级，\n可体型小，速度快，一时间无人能够发现它的踪迹。",
                "\t[纳娜米]还是那位大人物亲自出手，\n在他的灵魂探测范围内，\n一切都无所遁形。",
                "\t[纳娜米]最终，强者们在接近第十八层云层之下，\n拦截了他搭乘的那艘珍宝飞船，\n并将所有的飞船尽数击毁。",
                "\t[纳可]呼……跌宕起伏呢。\n我们的目的，就是去寻找那些掉落的“飞船”，\n搜寻所需的宝物吧？",
                "\t[纳娜米]正是。那座主战的飞船奇宝，\n之中的宝藏，此刻正在被云霄级之上的强者抢夺。\n而我们的目标，却是那些小型的飞船。",
                "\t[纳娜米]不过——还有一个目标，\n可可，就在你的眼前。\n声律城的废墟。",
                "\t[纳可]声律城的……废墟？",
                "\t[纳娜米]嗯，没错。\n曾经繁荣昌盛的声律城，\n化作废墟之后，众多原住民死去，遗落下不少东西。",
                "\t[纳娜米]家主大人已经下令，\n纳家全体分开搜寻，\n找到有用的财物、宝物之后——",
                "\t[纳可]等一下，姐姐，\n这种做法……不好吧。\n这座城池的人，难道不会无法安息吗？",
                "\t[纳娜米]可可，姐姐只知道，\n只要能够让纳家更快发展起来，\n这些事情都是值得的。",
                "\t[纳娜米]如今，临近城池所有大小势力，都在做同样的事情。\n我们想要争取到更多，并非容易，\n更没有时间为那些难民感到悲痛。",
                "\t[纳可]……我，我听姐姐的。",
                "\t[纳可]（如果燕岗城发生了同样的事情，\n大家……也会这样对待我们吗？）",
                {
                    "type": "hide",
                    "remove": true
                }
            ]
        }
    },
    "changeFloor": {
        "6,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [159,159,159,159,159,159,159,159,159,159,159,159,159],
    [159,159,159,159,159,159, 88,159,159,159,159,159,159],
    [159,150344,150345,150346,159, 60,  0, 60,159,150344,150345,150346,159],
    [159,150352,150353,150354,159,  0, 60,  0,159,150352,150353,150354,159],
    [159,150360,150361,150362,159,619,  0,619,159,150360,150361,150362,159],
    [159,159,159,159,159,  0, 21,  0,159,159,159,159,159],
    [159,150344,150345,150346,159, 21,  0, 21,159,150344,150345,150346,159],
    [159,150352,150353,150354,159,  0, 21,  0,159,150352,150353,150354,159],
    [159,150360,150361,150362,159, 22,  0, 22,159,150360,150361,150362,159],
    [159,159,159,159,159,159,711,159,159,159,159,159,159],
    [159,159,159,159,159,  0,  0,  0,159,159,159,159,159],
    [159,159,159,159,159,  0, 87,  0,159,159,159,159,159],
    [159,159,159,159,159,  0,  0,  0,159,159,159,159,159]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}