main.floors.MT156=
{
    "floorId": "MT156",
    "title": "156 层",
    "name": "156 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "02.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 2000,
    "defaultGround": 906,
    "bgm": "11.mp3",
    "firstArrive": [
        "\t[纳可]刚出城就有刺鼻的血腥味传来……\n好难受。",
        "\t[纳可]只这一个天外来客，\n便造成这么多的强者陨落。",
        "\t[纳可]我必须保持清醒，\n不能制造无谓的杀戮。\n不然……只会在这条路上越走越远。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,6": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [918,918,918,918,918,918,918,918,918,918,918,918,918],
    [ 22, 15, 22, 15, 22, 15, 88, 16, 23, 16, 23, 16, 23],
    [  4,  4,  4,  4,  4,  4,  0,  4,  4,  4,  4,  4,  4],
    [  4, 27,576,584,635, 84, 21, 84,636,585,577, 28,  4],
    [  4,  4,918,918,  4,  4, 86,  4,  4,918,918,  4,  4],
    [  4,918,918,918,  4, 24,  0, 24,  4,918,918,918,  4],
    [  4,620,619,620, 84,  0, 87,  0, 84,620,619,620,  4],
    [  4,918,918,918,  4, 24,  0, 24,  4,918,918,918,  4],
    [  4,  4,918,918,  4,  4, 86,  4,  4,918,918,  4,  4],
    [  4,619,637,641,619, 84, 21, 84,619,587,579,619,  4],
    [  4,  4,  4,  4,  4,  4,  0,  4,  4,  4,  4,  4,  4],
    [619, 15, 60, 15, 60, 15, 21, 16,620, 16,620, 16,621],
    [918,918,918,918,918,918,918,918,918,918,918,918,918]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}