main.floors.MT163=
{
    "floorId": "MT163",
    "title": "163 层",
    "name": "163 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "02.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 2000,
    "defaultGround": 906,
    "bgm": "11.mp3",
    "firstArrive": [
        "\t[纳可]之前在那圣荒领的将军口中，\n得知了飞船就在附近的消息。\n那么，就在这片战场范围之内寻找吧。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,4": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [918,918,918,918,918,918,918,918,918,918,918,918,918],
    [918, 58,918,576,  0, 81, 60,637, 60,918, 59,  0,918],
    [918, 59, 81,  0,572,918,  0,426,  0, 82,  0, 58,918],
    [918,918,918,434,918,918,918, 81,918,918,918, 81,918],
    [918, 87,918, 21,  0,918,584,  0,918, 22,  0,576,918],
    [918,587,918,  0, 22, 82,445,918,918,918,435,918,918],
    [918,  0,442, 21,  0,918,  0,619, 81,586,  0,918,918],
    [918,918, 82,918, 81,918,918,918,918,426,918,918,918],
    [918, 59,434,918, 21,  0, 60,918,579,  0,438,572,918],
    [918,  0,918,918,918,918,438, 82,  0, 81, 59,  0,918],
    [918,577,918,918,436,  0, 59,918,918, 58,435,918,918],
    [918,918,918,918,585,918,  0,437, 59, 82,  0, 88,918],
    [918,918,918,918,918,918,918,918,918,918,918,918,918]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}