main.floors.MT172=
{
    "floorId": "MT172",
    "title": "172 层",
    "name": "172 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 5000,
    "defaultGround": 30048,
    "bgm": "12.mp3",
    "firstArrive": [
        "\t[纳可]飞船内似乎有很多用不明材料锻造的傀儡，\n就和之前那些蓝皮的家伙一样。",
        "\t[纳可]在之前的试探中，它们似乎没有意识，\n只是凭借自己的本能行动。",
        "\t[纳可]等等，如果没有看错的话，\n右上角的那个家伙是……！",
        "\t[纳可]哼，百方少爷？真是冤家路窄呢。\n被本小姐在这里遇到的话……\n是时候让你付出代价了！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "10,2": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[百方]你，你是——",
                "\t[纳可]不记得了吗？\n百方少爷，看起来记性不怎么样呢。\n嗯，现在，为你的所作所为付出代价吧？",
                "\t[百方]该死，该死，\n纳家小鬼，你进步怎么会如此迅速？\n早知道，当初便杀了你——",
                "\t[百方]你虽然强，可我也并非在原地踏步！\n哈哈，你还不知道吧，\n我在这拿到的天外神兵，就让你见识一下——",
                "\t[纳可]（……那是什么？\n算了，不管了！）",
                {
                    "type": "battle",
                    "loc": [
                        10,
                        2
                    ]
                },
                "\t[百方]谔谔啊啊啊啊啊啊！\n给我等着，我一定会回来的！",
                "\t[纳可]喂喂，怎么这样啊。\n跑得也太快了，连你的神兵都不要了吗。",
                "\t[纳可]……天外神兵，就是这个？\n似乎，这家伙高得吓人的攻击力都来自于它，\n相应地，防守也会变得脆弱。",
                "\t[纳可]嘛……以我的速度追不上他呢，\n就先放过他吧，以后还有机会。\n至少这次收获不小，心情好，就不去计较了。",
                "获得器械：玻璃大炮。\n将为你自动装备，可在装备栏查看详情。",
                {
                    "type": "setValue",
                    "name": "item:I977",
                    "value": "1"
                },
                {
                    "type": "loadEquip",
                    "id": "I977"
                }
            ]
        }
    },
    "changeFloor": {
        "6,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "9,6": [
            {
                "type": "setValue",
                "name": "flag:door_MT172_10_5",
                "operator": "+=",
                "value": "1"
            }
        ],
        "11,6": [
            {
                "type": "setValue",
                "name": "flag:door_MT172_10_5",
                "operator": "+=",
                "value": "1"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "10,5": {
            "0": {
                "condition": "flag:door_MT172_10_5==2",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_MT172_10_5",
                        "operator": "=",
                        "value": "null"
                    }
                ]
            }
        }
    },
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [971,971,971,971,971,971,971,971,  4,110037,110038,110039,  4],
    [971,971,971,971,579,971,586,  0,  4,110045,110046,110047,  4],
    [971,971,971, 21,469,971,  0,579,  4,110320,717,110320,  4],
    [971,971,451,  0,572,971,458,971,  4,110328, 23,110328,  4],
    [971,576,  0, 81,  0, 59,  0,577,971,619,  0,619,971],
    [971,449,971,971,971, 81,971,971,971,971, 85,971,971],
    [971,577,  0,971,  0,586,  0,576,971,446,  0,446,971],
    [971,  0,572,454, 21,  0,577,  0,971,577,  0, 60,971],
    [971,446,971,971,971,452,971,971,971,971, 22,  0,971],
    [971, 21,  0, 82, 59,  0, 59, 81,  0, 82,451,576,971],
    [971,  0, 21,971,455,971,971,971, 86,971,971,971,971],
    [971,576,  0,971,619,971, 88, 58,  0,449, 58, 87,971],
    [971,971,971,971,971,971,971,971,971,971,971,971,971]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}