main.floors.MT185=
{
    "floorId": "MT185",
    "title": "185 层",
    "name": "185 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 5000,
    "defaultGround": 30048,
    "bgm": "12.mp3",
    "firstArrive": [
        "\t[储存姬B1]咕……咕咕……",
        "\t[纳可]姐姐，前面的那个科技造物好强大，\n还会发出奇怪的声音。",
        "\t[纳娜米]是记载中的【储存姬】！\n听说天外族群利用它存储一些重要讯息，\n因此它本身的材质强度也不低。",
        "\t[纳可]我明白了！\n也就是说，只要狠狠把它砸烂掉，\n就能得到重要的情报了对吧！",
        "\t[纳娜米]……确定这样搞不会让它自我销毁吗……"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,2": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,10": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "6,9": [
            "\t[储存姬B1]咕！咕咕！",
            "\t[纳娜米]……还好，资料里有记载，\n这种器械详细的使用方法。",
            "\t[纳可]姐姐，怎么样？",
            "\t[纳娜米]这样，然后这样。\n应该就可以读取出信息了。",
            "\t[储存姬B1]咕咕……",
            "储存姬的屏幕一闪，\n浮现出了大量文字，\n并被自动翻译成血洛大陆通用语。",
            "摩羽星历285714年3月16日：\n本天才终于宇宙级九阶了，哇哈哈！\n这营养仓可真是个好东西，省去了多少年的积累。\n摩羽星历285714年5月10日：\n那可恶的大块头竟敢羞辱我，\n本大爷一气之下，接了个标注为危险级的任务。\n任务目标写得很简单，去一个什么大陆寻找一块石头。\n待我历练归来，晋升天地秘境不是信手沾来？\n今日之仇，势必百倍奉还！",
            "摩羽星历285716年7月15日：\n两年了，终于来到了任务所在的太初秘境。\n公司也真是的，两块地盘居然相隔如此之远的距离。\n摩羽星历285716年8月1日：\n终于降落了，随便在路边抓了个行星级土著搜魂，\n那瑟瑟发抖的样子真是有意思。\n一搜才知道，这地方的土著竟如此敌视本天才？\n气得我随手把他灭口了，看来之后行事得注意隐藏身份才是。",
            "摩羽星历285716年8月15日：\n这大陆都是什么鬼天气，\n本天才水土不服，干脆明天就去闯那什么城主府，\n做完任务了事。\n毕竟所谓的城主都有血洛晶的份额，\n可真实实力不过是区区域主罢了。",
            "………………\n纳可和纳娜米一行行看过去，\n虽然对上面蕴含的信息一知半解，\n可也有一些熟悉的字眼引起了注意。",
            "\t[纳可]城主、血洛晶、血洛大陆……\n每个字都熟悉，可连在一起就完全看不懂了呢。",
            "\t[纳娜米]这样效率也太低了……\n直接看最后的部分吧。",
            "\t[纳娜米]从这里开始——\n记述变成了以分钟为单位。\n看来这个家伙的时间，逐渐变得急迫起来了。",
            "摩羽星历285717年1月25日8时30分：\n如此完美的计划居然还是被发现了，\n可又如何？既然身份败露，\n那就杀出一条血路来！\n毕竟只说要完成任务，可没说用什么样的手段。\n摩羽星历285717年1月25日12时50分：\n不好办了，出大事了。\n这城主府里怎么突然冒出这么多域主来？\n他们的增援还在源源不断赶到，得想个办法才行。",
            "摩羽星历285717年1月25日20时10分：\n虽然虚惊一场，可还是心有余悸。\n他们做梦都想不到，\n我如今躲在这艘不起眼的B9级飞船里。\n土著毕竟还是愚蠢的土著啊。\n想杀本天才？还早了一万年，哈哈……\n摩羽星历285717年1月25日21时5分：\n什么？信号被屏蔽了？\n不，只要冲破云层，到达那个地方——",
            "摩羽星历285717年1月25日21时10分：\n来不及了。\n那些家伙隔着那么远的距离随手一扇，\n一艘飞船就失去所有性能掉下来。\n差距实在太大了，该死，该死，\n早知道当初就该订购C9级飞船的。\n摩羽星历285717年1月25日21时20分：\n堂堂界主欺负我一个宇宙级？\n呵，被包围了，B9级飞船已经摔了一大半，\n想必快要轮到这一艘了吧。",
            "摩羽星历285717年1月25日21时25分：\n一切都结束了。\n想不到本天才竟然栽在这区区历练任务上。\n如果虚拟宇宙公司的前辈们收到这些消息，\n请照顾好我的家族，我的家人们……\n摩羽星历285717年1月25日21时30分：\n谔谔啊啊啊啊啊啊啊！\n^跟&*$*格&(&^嘎%^",
            "………………",
            "纳可似乎受到了惊吓一般，\n抓紧了纳娜米的衣袖，瑟瑟发抖。",
            "\t[纳可]姐姐……这都是什么跟什么啊。\n这种奇怪的东西，真的可以当作情报看吗。",
            "\t[纳娜米]我不理解……没事的。\n可可，这些东西和我们此行的目的无关，\n不要多想，继续前进吧。",
            "\t[纳可]唔唔，明白。"
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [971,971,971,971,971,971,971,971,971,971,971,971,971],
    [971,971,971,971,971,971,971,971,971,971,971,971,971],
    [971,971,584,482, 60, 81,585, 81, 60,482,  0, 88,971],
    [971,971,971,971,471,971,469,971,471,971,971,971,971],
    [971,971,579,  0,587,971,637,971,587,  0,579,971,971],
    [971,971,  4,473,  0,971,469,971,  0,473,  4,971,971],
    [971,  4,642,642,  4,971, 21,971,  4,642,642,  4,971],
    [971,971,180555,180556,971,971, 83,971,971,180555,180556,971,971],
    [971,971,180563,180564, 60,971,585,971, 60,180563,180564,971,971],
    [971,971,180571,180572, 60,971,472,971, 60,180571,180572,971,971],
    [971,971,971,971,971,  4, 87,  4,971,971,971,971,971],
    [971,971,971,971,971,971,971,971,971,971,971,971,971],
    [971,971,971,971,971,971,971,971,971,971,971,971,971]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}