main.floors.MT186=
{
    "floorId": "MT186",
    "title": "186 层",
    "name": "186 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 10000,
    "defaultGround": 970,
    "bgm": "13.mp3",
    "firstArrive": [
        "\t[纳娜米]想必我们已经进入了核心地域，\n之后的路，恐怕遍地都是强大的科技造物。",
        "\t[纳可]真不可思议呢……这些没有生命的傀儡，\n每一个的实力放到燕岗领，\n都是受人尊敬的天空级强者。",
        "\t[纳娜米]可可，说起来，\n你如今也离再次突破不远了吧。",
        "纳娜米看着纳可，\n自从地宫一行后，自己这个平平无奇的妹妹，\n仿佛觉醒了什么天赋一般。",
        "\t[纳娜米]也许……以你的进步速度，\n你甚至能够先姐姐一步，踏入天空级！",
        "\t[纳可]天空级？！诶，还太早了点吧。\n那可是父亲大人和雷叔他们的境界。",
        "\t[纳娜米]理论上，任何人都能够成为大地级巅峰。\n可天空级不同——\n那需要一定的天赋、灵性，以及勇气。",
        "\t[纳娜米]可可，这些都是你身上的特质，\n而这或许才是成为【强者】的关键所在。",
        "\t[纳可]说得我好难为情啊，姐姐……",
        "系统提示：本区域为【第二幕】最终区，\nBoss损失极高，请尽可能保留更多生命值与之交战！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,10": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "3,5": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [899,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4],
    [ 84,  4,  4, 87,  0,467,  0,  4,  4,  4,  4,  4,  4],
    [ 84, 84, 84,  0, 81,  0, 86, 84,576,577,584,577,576],
    [  4,  4,  4,471,  0, 86,  0,  4,  4,  4,  4,  4,  4],
    [  4,  4,  4,  0, 86,  0, 24,  4,  4,  4,  4,  4,  4],
    [587, 84, 84, 86,  0,902,  0, 84,577,576,585,576,577],
    [620,  4,  4,  0, 24,  0, 88,  4,  4,  4,  4,  4,  4],
    [579,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4],
    [156,156,156,156,156,156,156,156,156,156,156,156,156]
],
    "bgmap": [

],
    "fgmap": [
    [190188,190188,190182,190188,190188,190182,190188,190188,190182,190188,190188,190182,190188],
    [190188,190189,190190,190188,190189,190190,190188,190189,190190,190188,190189,190190,190188],
    [  0,190180,190181,  0,190180,190181,  0,190180,190181,  0,190180,190181,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}