main.floors.MT197=
{
    "floorId": "MT197",
    "title": "197 层",
    "name": "197 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 10000,
    "defaultGround": 970,
    "bgm": "13.mp3",
    "firstArrive": [
        "\t[纳娜米]这些包围我们的科技造物，\n实力似乎又上了一个台阶，\n和之前那批不是一个级别。",
        "\t[纳娜米]舱门……都锁死了。\n如果记载属实，这种【B9】级的材料，\n凭借我们现在的实力，是无论如何都无法破坏的。",
        "\t[纳可]没有别的办法了吗？\n这样吧姐姐，我们就在这里待着，\n等到修炼到天空级九阶……",
        "\t[纳娜米]都这种时候了，\n还带着这么脱线的想法是要干什么啊！",
        "\t[纳娜米]我是说，可可，\n如果不快点想办法的话，\n只这些包围我们的机械，就足以把我们耗死。",
        "\t[纳可]呜，想不出来。",
        "\t[纳娜米]只能走一步看一步了……\n不过，这舰船并非毫无弱点，比如——\n它的控制中枢部分，并没有抵御攻击的需求。",
        "\t[纳娜米]有了！可可，我们继续朝着深处进发，\n直到核心区域，破坏那个控制中枢！",
        "\t[纳可]好诶，这个我擅长！\n那姐姐，我们马上出发——"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "1,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "9,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156, 88,  0,156,572,156,577,491,  0, 87,156,620,156],
    [156,  0, 22, 82,  0,483, 59,156, 60,  0, 86,492,156],
    [156, 82,156,192493,192494,156, 81,156,192493,192494,156,585,156],
    [156,  0,576,192501,192502,156,488,  0,192501,192502, 21,  0,156],
    [156, 21,  0,472, 59, 81,  0,579,572,486,  0, 21,156],
    [156,491,156,156,490,156,156, 82,156,156, 82,156,156],
    [156,619,  0, 82,  0,487,  0,482,576,487,  0, 50,156],
    [156,  0, 22,156,579,156, 59,  0,192493,192494, 21,  0,156],
    [156,156, 82,156,156,156,482,156,192501,192502,156, 81,156],
    [156,637,585,492,  0,483,  0,156,577,  0, 81,473,156],
    [156,584, 21,156,586,156, 47,489,  0, 21,156,638,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}