main.floors.MT192=
{
    "floorId": "MT192",
    "title": "192 层",
    "name": "192 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 10000,
    "defaultGround": 970,
    "bgm": "13.mp3",
    "firstArrive": [
        "\t[纳娜米]可可有感觉到吗？\n附近的能量有一些躁动，似乎在环绕着某个中心旋转。",
        "\t[纳娜米]如果没有猜错的话，\n恐怕这里还隐藏着珍贵的某样东西。",
        "\t[纳可]说不定呢。\n可万一是一只强大的怪物该怎么办……",
        "\t[纳娜米]如果是怪物，那应该感应到强者气息才是。\n可这里只有浓郁的能量，指向了——\n下方红门内的那个房间。",
        "\t[纳可]既然姐姐这样说，那就可以放心了。\n是宝物的话……就要想办法把它拿到手，\n然后卖很多很多钱才行。",
        "\t[纳娜米]怎么又在想钱的事情啊！\n可可你之前想变强的心哪去了！",
        "系统提示：请打开\r[aqua]本层下方红门\r，\n以继续推动剧情。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,5": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {
        "6,9": [
            "\t[纳娜米]果然，以纯粹的能量构造成的结晶体，\n蕴含的能量，恐怕比起进化果实，\n还要强大无数倍……",
            "\t[纳可]该不会是……传说中的进化结晶吧？\n听说这种宝物在血洛大陆是无法出产的，\n只有天外来客才会有！",
            "\t[纳娜米]没想到居然能亲眼见到呢。\n可可，这次真的是一场难得的机缘，\n将它收下，然后——",
            {
                "type": "playSound",
                "name": "xiong.mp3"
            },
            {
                "type": "screenFlash",
                "color": [
                    234,
                    12,
                    12,
                    0.5
                ],
                "time": 888,
                "times": 4
            },
            "\t[B9舰船]警报！警报！\n发现不明来历生命体闯入重要舱室！",
            "\t[B9舰船]舱门已闭锁，\n开始执行清扫任务。",
            "\t[纳可]怎，怎么回事？",
            "\t[纳娜米]坏了，看来是这扇门的开启，\n触动了某个机关。\n那些铁皮怪物……似乎突然有意识地包围过来了！",
            "\t[纳娜米]可可，以最快的速度吸收这晶体的能量，\n我们现在的能力还不够应付这么多的怪物，\n一定要想办法破局——",
            "\t[纳可]姐姐……！\n我明白了，这里就交给我吧。\n就像姐姐曾经保护我那样。",
            "\t[纳娜米]可可……",
            "\t[纳娜米]（或许，就在这舰船里，\n我会见证燕岗城最年轻的天空级强者诞生！）"
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156, 87,156,156,576,  0,483,  0,579,156,  0,576,156],
    [156, 22,  0, 83,  0,577,156, 60, 59,482,572,  0,156],
    [156,156,487,156, 21,156,156,475,156,156,156, 81,156],
    [156,586,  0,156, 82,156,  0,577,477,  0,481,  0,156],
    [156,  0,579,477, 21, 81,572,  0,156,576,156, 88,156],
    [156,484,156,156,156,156,472,156,156,156,156,484,156],
    [156,  0,482,586,156, 59,  0, 22,156,577,156,  0,156],
    [156,576,156,  0,475,  0,486,  0, 81,  0, 81, 21,156],
    [  4,  4,  4,  4,  4,  4, 83,  4,  4,  4,  4,  4,  4],
    [190125,190124,190125,190124,190125,619, 86, 22,190126,190127,190126,190127,190126],
    [190133,190132,190133,190132,190133, 86,734, 86,190134,190135,190134,190135,190134],
    [190141,190140,190141,190140,190141, 22, 86,638,190142,190143,190142,190143,190142]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}