main.floors.MT201=
{
    "floorId": "MT201",
    "title": "201 层",
    "name": "201 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 20000,
    "defaultGround": 90000,
    "bgm": "14.mp3",
    "firstArrive": [
        {
            "type": "sleep",
            "time": 1000
        },
        "两年后，燕岗领以北，赫尔沼泽。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,3": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[纳布]没人能够想到，\n天外来客飞船坠落后的辐射，\n竟能让如此之多的荒兽产生变异。",
                "\t[纳布]这或许是外来者最后的报复……\n这些荒兽变得比之前更强大、更凶残。\n大量天空级乃至云霄级的荒兽诞生，兽潮产生。",
                "\t[纳可]父亲大人以前经历过兽潮吗？\n是什么样子的？",
                "\t[纳布]顾名思义……\n无数发疯的荒兽冲击人类的城镇，\n众多弱小的平民家破人亡，流离失所。",
                "\t[纳可]……好可怜……",
                "\t[纳布]事实上，此前司雍世界也有过不少次兽潮，\n但都没有这一次大，也没有这一次严重。\n即使燕岗城这种领地主城，恐怕也要遭到一定冲击。",
                "\t[纳可]是呢……\n仅仅是接近兽潮席卷的这片沼泽，\n都能隐约听到荒兽的吼啸与嘶鸣声。",
                "\t[纳布]可可，此次城主府开出了丰厚的奖励，\n乃是几大领在天外来客的身上所得。\n只要猎杀荒兽并带回证明，就能领取奖励。",
                "\t[纳可]父亲大人，姐姐她现在，\n已经跟着家族的第一批队伍出发了吗？",
                "\t[纳布]是啊，迫不及待就离开了。\n娜娜这孩子，也有一颗强者的心啊。",
                "纳可沉默。\n天外来客一役，自己临阵突破，解除危机。\n继自己之后，姐姐在一年之前，也迈足了天空级。",
                "这件事在燕岗城内引起震动，\n纳可姐妹修炼时长很短，却双双突破天空级，\n这绝对是燕岗领罕有的事情。无数人前来贺喜。",
                "很多人甚至认为，未来的纳家，\n很可能会诞生一位，\n实力不弱于曾经家祖纳鹰的强者。",
                "一直以来，纳娜米的天赋，\n都是纳家公认的强。\n在她崛起之前，甚至非常可能成为下一任家主。",
                "纳可曾经一直觉得自己比不上姐姐，\n只是把姐姐当作追赶的目标。",
                "但是如今，拥有领域，\n又在天空级沉淀了两年时间的纳可，\n实力恐怕已经超乎纳娜米的想象。",
                "\t[纳可]（姐姐她的这种心态……\n也是在经历这些事情之后形成的，\n她确实不希望被我甩得太远。）",
                "\t[纳布]你姐姐的事，不用太担心。\n你只管好好修炼，直到彻底成长起来，\n到时候再去协助她就是。",
                "\t[纳可]……明白。",
                "\t[纳布]好了，时间也差不多了，\n纳家的下一批队伍已经开拨，\n那就收拾心情出发吧。",
                {
                    "type": "hide",
                    "loc": [
                        [
                            6,
                            3
                        ]
                    ],
                    "remove": true
                }
            ]
        }
    },
    "changeFloor": {
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [150,150,150,150,150,150,150,150,150,150,150,150,150],
    [150,150,150,150,150,150, 87,150,150,150,150,150,150],
    [150,150,150,150,150,150, 86,150,150,150,150,150,150],
    [90059,90060,150,150,150,90010,723,90010,150,150,150,90057,90058],
    [90067,90068,  0,150,150,  0,  0,  0,150,150,  0,90065,90066],
    [145,145,145,  0,1006,  0, 23,  0,1006,  0,145,145,145],
    [145,145,145, 47,  0,1007,  0,1007,  0, 50,145,145,145],
    [145,145,145,145, 60,  0,  0,  0, 60,145,145,145,145],
    [145,145,145,145,  0,619,  0,619,  0,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145],
    [150,150,150,150,145,145,145,145,145,150,150,150,150],
    [150,150,150,150,145,145,145,145,145,150,150,150,150]
],
    "bgmap": [

],
    "fgmap": [
    [90035,90036,90037,  0,  0,  0,  0,  0,  0,  0,90032,90033,90034],
    [90043,90044,90045,  0,  0,  0,  0,  0,  0,  0,90040,90041,90042],
    [90051,90052,90053,  0,  0,  0,  0,  0,  0,  0,90048,90049,90050],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [90102,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,90021,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,90029,  0],
    [  0,  0,90014,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,90005,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,90015,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}