main.floors.MT202=
{
    "floorId": "MT202",
    "title": "202 层",
    "name": "202 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 20000,
    "defaultGround": 90000,
    "bgm": "14.mp3",
    "firstArrive": null,
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {
        "6,2": [
            "\t[纳可]从远处就能感受到强烈的压迫感。\n好像是……燕岗城现任的城主大人，\n石风雄！",
            "\t[纳可]虽然已经见过一面，\n可在这等强者面前，\n不由自主就会心惊胆战呢。",
            "\t[纳可]每一位城主强者，\n不仅拥有领域级的恐怖修为，\n同时还身负血武者的身份，在大陆上地位尊崇。",
            "\t[纳可]此次纳家的队伍紧随燕岗城大部队之后，\n有这些超级强者在前面开路，\n就不用担心碰到游荡的云霄、领域级兽王了。",
            {
                "type": "hide",
                "loc": [
                    [
                        4,
                        3
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        3
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        8,
                        3
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        5,
                        4
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        7,
                        4
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        5
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        4,
                        6
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        8,
                        6
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        7
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        4,
                        8
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        8,
                        8
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        9
                    ]
                ],
                "remove": true
            }
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [90091,90092,90093,145,145,145,145,145,145,145,90088,90089,90090],
    [90099,90100,90101,145,145,145, 88,145,145,145,90096,90097,90098],
    [90107,90108,145,145,145,  0, 86,  0,145,145,145,90105,90106],
    [145,145,145,145,468,  0,468,  0,468,145,145,145,145],
    [145,145,145,  0,  0,490,  0,490,  0,  0,145,145,145],
    [145,145,145,145,  0,  0,490,  0,  0,145,145,145,145],
    [145,145,145,145,513,  0,  0,  0,513,145,145,145,145],
    [145,145,145,  0,  0,  0,1097,  0,  0,  0,145,145,145],
    [145,145, 15,  0,1200,  0,  0,  0,1200,  0, 82,145,145],
    [ 22,150, 22,150,  0,  0,1227,  0,  0,150,1006,150,1006],
    [ 15,150, 15,150,150,  0,  0,  0,150,150, 82,150, 82],
    [ 22,150, 22,150,150,150, 87,150,150,150,1006,150,1006],
    [ 15, 22, 15,150,150,150,150,150,150,150, 82,1006, 82]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,90021],
    [90038,90039,  0,  0,  0,  0,  0,  0,  0,  0,90019,  0,90029],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,90006,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,90018],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}