main.floors.MT220=
{
    "floorId": "MT220",
    "title": "220 层",
    "name": "220 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 20000,
    "defaultGround": 90000,
    "bgm": "14.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,4": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "4,10": [
            {
                "type": "openDoor",
                "loc": [
                    6,
                    8
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    6,
                    7
                ]
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {
        "8,10": [
            "\t[纳可]……前面那是，一只魅影幻姬吗？\n这是一种擅长幻术的荒兽，\n看气息在天空级四阶左右。",
            "\t[魅影幻姬]嘶！嘶！",
            "\t[燕岗精英佣兵]怪物……不要过来！",
            {
                "type": "move",
                "loc": [
                    6,
                    9
                ],
                "time": 400,
                "keep": true,
                "async": true,
                "steps": [
                    "right:1"
                ]
            },
            {
                "type": "move",
                "loc": [
                    6,
                    11
                ],
                "time": 400,
                "keep": true,
                "steps": [
                    "right:1"
                ]
            },
            {
                "type": "waitAsync"
            },
            "\t[纳可]不好，那两个人有危险！",
            {
                "type": "moveHero",
                "time": 100,
                "steps": [
                    "left:3"
                ]
            },
            {
                "type": "battle",
                "loc": [
                    4,
                    10
                ]
            },
            "\t[纳可]（呼，有惊无险，拿下了。）",
            {
                "type": "changePos",
                "direction": "right"
            },
            "\t[燕岗精英佣兵]纳、纳可小姐！\n多亏有你相助，我们……",
            "\t[纳可]好了，你们都没事了，我也该走了。\n下次注意不要招惹到强大的荒兽。",
            "\t[纳可]魅影幻姬，拥有能让人短暂失去意识的能力，\n如果打不过的话，最好离她远一点。",
            "纳可摆了摆手，没有再做停留，\n转身离开。",
            {
                "type": "setHeroOpacity",
                "opacity": 0,
                "time": 0
            },
            "\t[燕岗精英佣兵]……纳可小姐，谢谢。",
            "两名佣兵站在原地，\n望着渐行渐远的少女，\n嘴角勾起一丝不易察觉的苦涩。",
            "\t[燕岗精英佣兵]纳可小姐，其实人真的很好。",
            "\t[燕岗精英佣兵]对不起，我们也是被迫的……",
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 1000,
                "keep": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        7,
                        9
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        7,
                        11
                    ]
                ],
                "remove": true
            },
            {
                "type": "changeFloor",
                "floorId": "MT221",
                "loc": [
                    6,
                    4
                ],
                "direction": "down"
            }
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [150,150,150,150,150,150,150,150,150,150,150,150,150],
    [150,150,150,150,150,150,150,150,150,150,150,150,150],
    [150,150,150,150,150,150,150,150,150,150,150,150,150],
    [150,150,150,150,150,150,150,150,150,150,150,150,150],
    [150,150,150,150,150,  0, 87,  0,150,150,150,150,150],
    [150,150,150,150,  4, 60,  0, 60,  4,150,150,150,150],
    [150,150,150,150,150,  4,619,  4,150,150,150,150,150],
    [150,150,150,150,150,150, 85,150,150,150,150,150,150],
    [150,150,150,150,150,150, 85,150,150,150,150,150,150],
    [150,173,173,173,  0,  0,513,  0,90026,90027,  0,  0,150],
    [150,173,173,173,724,  0,  0,  0, 86, 86,  0,  0,150],
    [150,173,173,173,  0,  0,513,  0,90026,90027,  0, 88,150],
    [150,150,150,150,150,150,150,150,150,150,150,150,150]
],
    "bgmap": [

],
    "fgmap": [
    [173,173,173,173,173,173,173,173,173,173,173,173,173],
    [173,173,173,173,173,  0,  0,  0,173,173,173,173,173],
    [173,173,173,  0,  0,  0, 90,  0,  0,  0,173,173,173],
    [173,173,  0,  0,  0,  0,  0,  0,  0,  0,  0,173,173],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0, 90,  0,  0,  0,  0,  0,  0,  0,  0,  0, 90,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [
    [ 90,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 90],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
]
}