main.floors.MT229=
{
    "floorId": "MT229",
    "title": "229 层",
    "name": "229 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 50000,
    "defaultGround": 973,
    "bgm": "15.mp3",
    "color": [
        0,
        0,
        0,
        0.2
    ],
    "weather": [
        "fog",
        1
    ],
    "firstArrive": [
        {
            "type": "moveHero",
            "time": 200,
            "steps": [
                "right:2",
                "down:1"
            ]
        },
        "\t[纳可]咦，前面有人？",
        "纳可看向前方。\n那是—— 一名身着黑甲，\n背负刀盾，看起来十分普通的年轻青年。",
        "他此刻正席地而坐，\n手里拿着烤肉，大口地吃着。",
        {
            "type": "setBlock",
            "number": "E525",
            "loc": [
                [
                    5,
                    0
                ]
            ]
        },
        {
            "type": "jump",
            "from": [
                5,
                0
            ],
            "to": [
                5,
                4
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "setBlock",
            "number": "173",
            "loc": [
                [
                    5,
                    0
                ]
            ]
        },
        "窸窸窣窣的声音响起，\n在青年的身后，一抹灰色的影子出现，\n向他飙射过去！",
        "\t[纳可]喂……小心！",
        "\t[纳可]（天空级蛮咕兽？\n实力明显比之前的魅影幻姬还强！）",
        "\t[纳可]（怎么搞的，\n现在冒失的家伙也太多了吧，\n这样下去人家也救不过来呀！）",
        {
            "type": "moveHero",
            "time": 100,
            "steps": [
                "down:2",
                "right:1"
            ]
        },
        {
            "type": "battle",
            "loc": [
                5,
                4
            ]
        },
        {
            "type": "changePos",
            "direction": "down"
        },
        {
            "type": "setBlock",
            "number": "E1191",
            "loc": [
                [
                    5,
                    6
                ]
            ]
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 1000,
            "keep": true
        },
        {
            "type": "setCurtain",
            "time": 1000
        },
        "\t[纳可]呼……呼……\n还好反应快，解决掉了。",
        "从头到尾，青年纹丝未动，依旧坐在地上吃烤肉。\n只是在最后，他看向纳可，\n有些微不可察觉的讶异，旋即回归平静。",
        "\t[？？？]（……领域？）",
        "\t[纳可]你，你……",
        "\t[？？？]谢谢。",
        "\t[纳可]你是谁，为什么会出现在这种地方？\n也太可疑了吧。",
        "\t[？？？]呃……我看上去很可疑吗。",
        "\t[纳可]还有，你知道刚才有多危险吗，\n那个大家伙可是天空级四阶！",
        "\t[？？？]是吗，天空级四阶……\n（根据情报，也就是对应恒星级四阶。）",
        "看着黑甲青年若有所思的样子，\n纳可有些咬牙切齿。\n可对方却先开口了。",
        "\t[？？？]以你的实力，对付刚才那头荒兽，\n也是有不小风险的吧？\n即使这样，也不惜冒险出手帮助别人？",
        "\t[纳可]……举手之劳而已，才不要你管呀，\n是在小瞧我吗？",
        "\t[？？？]你的精神念力不错，\n又拥有一重领域，你手里的那把剑，不适合你用。\n如果换成念力兵器，会更强。",
        "\t[纳可]诶诶？你刚才说什么？",
        "\t[？？？]没什么。\n这里有几颗能增强精神念力的果实，\n就当作谢礼吧，告辞了。",
        {
            "type": "animate",
            "name": "jingya",
            "loc": "hero"
        },
        "\t[纳可]……等等！不许走！",
        "\t[？？？]还有什么事吗？",
        "\t[纳可]我不要你的东西。\n你……既然你这么厉害，\n那就带我走出森林吧。我找不到回去的路了。",
        "\t[纳可]（说起来，在他的身上没有感觉到任何气息。\n可如果是普通人，也不可能出现在这里。\n怎么回事呢。）",
        "\t[？？？]呵呵，好。\n\n小丫头，你叫什么名字。",
        "\t[纳可]…………\n\n纳可，我的名字。你呢？",
        "\t[峰]我叫，\r[aqua]【峰】\r。",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 1000,
            "keep": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    5,
                    6
                ]
            ],
            "remove": true
        },
        "………………\n路上，两人逐渐畅谈起来。",
        "\t[纳可]（怎么说呢……\n这个家伙，虽然刚才看见的时候，\n感觉表现得很奇怪。）",
        "\t[纳可]（但一路走下来，\n意外地感觉很好相处的样子。）",
        "\t[纳可]峰……你的年龄应该比我大，\n那我就称呼你一声峰大哥好了。\n不介意的话，叫我可可吧。",
        "\t[峰]好啊。\n可可，你刚才说，\n这里是燕岗领的势力范围中心？",
        "\t[峰]而我们要去的，\n是燕岗领的【领地主城】燕岗城？",
        "\t[纳可]是的，只不过兽潮来袭，\n燕岗领的强者都在抵御兽潮，\n所以城里暂时没什么人呢。",
        "\t[峰]那么……\n出了森林之后，就麻烦你带路了。",
        "峰加入了队伍！",
        {
            "type": "follow",
            "name": "feng.png"
        },
        {
            "type": "setCurtain",
            "time": 1000
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "5,6": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        }
    },
    "changeFloor": {
        "1,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [173,173,173,173,173,173,173,173,173,173,173,173,173],
    [173, 88,  0,  0,173,173,173,173,173,173,173,173,173],
    [173,173,  0,  0,  0,  0,173,173,173,173,173,173,173],
    [173,173,  0,  0,  0,  0,  0,  0,173,173,173,173,173],
    [173,173,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,173],
    [173,173,  0,  0,  0,  0,  0,90096,90097,90098,90099,90100,90101],
    [173,173,  0,  0,  0,1188,  0,90104,90105,90106,90107,90108,90109],
    [173,173,173,  0,  0,  0,  0,  0,  0,  0,173,173,173],
    [173,173,173,  0,  0,  0,  0,  0,  0,  0,173,173,173],
    [173,173,173,173,  0,  0,  0,  0,  0,173,173,173,173],
    [173,173,173,173,  0,  0,  0,  0,173,173,173,173,173],
    [173,173,173,173,173,  0, 87,  0,173,173,173,173,173],
    [173,173,173,173,173,173,173,173,173,173,173,173,173]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,90072,  0,  0,  0,  0,90077],
    [  0,  0,  0,  0,  0,  0,  0,90072,90073,90074,90075,90076,90077],
    [  0,  0,  0,  0,  0,  0,  0,90080,90081,90082,90083,90084,90085],
    [  0,  0,  0,  0,  0,  0,  0,90088,90089,90090,90091,90092,90093],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}