main.floors.MT238=
{
    "floorId": "MT238",
    "title": "238 层",
    "name": "238 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 50000,
    "defaultGround": 973,
    "bgm": "15.mp3",
    "color": [
        0,
        0,
        0,
        0.2
    ],
    "weather": [
        "fog",
        1
    ],
    "firstArrive": [
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 1000,
            "keep": true
        },
        {
            "type": "unfollow",
            "name": "feng.png"
        },
        {
            "type": "changeFloor",
            "floorId": "MT238",
            "loc": [
                4,
                3
            ],
            "direction": "right"
        },
        {
            "type": "setBlock",
            "number": "E1190",
            "loc": [
                [
                    4,
                    5
                ]
            ]
        },
        {
            "type": "setCurtain",
            "time": 1000
        },
        "\t[雷冬]前面是一头变异的荒兽，\n恐怕达到了四阶巅峰层次。",
        "\t[纳可]交给我吧，我没问题的。",
        "\t[峰]可可，这里就不需要出手了。\n我观察了你一路上的战斗，\n大致知道了适合你用的念力兵器类型。",
        "\t[纳可]……峰大哥？\n要做什么？",
        "峰一招手，\n一把呈弯月状，色泽晶莹，外观美丽的月轮，\n便是被他握在手上。",
        "\t[峰]银霜月轮，是三阶顶尖念力兵器。\n第一重非常简单，我演示一遍，\n你应该很快就能完全掌握。",
        "只见他双手飞速变换，\n月轮瞬间分解为大量的白水晶，\n在空中飞舞，让人眼花缭乱。",
        {
            "type": "animate",
            "name": "bingbao",
            "loc": [
                7,
                4
            ]
        },
        "216颗白水晶，\n就像是216只蝴蝶在起舞一般，\n带起一连串幻影。",
        "峰将力量压制在天空级一阶，\n可尽管如此，那只变异荒兽依旧无法承受。\n在那白水晶的攻势下，毫无还手之力，便应声栽倒。",
        {
            "type": "hide",
            "loc": [
                [
                    7,
                    4
                ]
            ],
            "remove": true
        },
        "\t[纳可]好微妙的攻击方式……\n如果不是对精神力的掌控极为娴熟，\n恐怕操纵几十颗水晶已经是极限了呢。",
        {
            "type": "setValue",
            "name": "item:I1124",
            "value": "1"
        },
        {
            "type": "loadEquip",
            "id": "I1124"
        },
        "获得并领悟了【银霜月轮（一重）】！\n已为你自动装备，可在装备栏内查看。",
        "\t[雷冬]（小姐，这是峰大人给你的，\n快给人家道谢。）",
        "\t[纳可]峰大哥……谢谢。",
        "纳可轻咬着嘴唇，\n虽然之前那样想，可不管怎样，\n今天是有这位神秘强者在，才幸免于难。",
        "\t[峰]没什么，小事罢了。\n走吧，前面应该就是森林边缘了。",
        "\t[峰]（能在这般年龄，无人指导的情况下，\n领悟领域，以及自创一式秘法，\n这个女孩的悟性确实不错。）",
        "\t[峰]（稍加培养的话，或许……）",
        {
            "type": "openDoor",
            "loc": [
                11,
                5
            ]
        },
        {
            "type": "openDoor",
            "loc": [
                10,
                6
            ]
        },
        {
            "type": "openDoor",
            "loc": [
                11,
                7
            ]
        },
        {
            "type": "hide",
            "loc": [
                [
                    4,
                    5
                ]
            ],
            "remove": true
        },
        {
            "type": "follow",
            "name": "feng.png"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "4,5": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        }
    },
    "changeFloor": {
        "1,4": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,6": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [173,173,173,173,90065,90066,90067,90068,173,173,173,173,173],
    [173,173,173,173,173,173,173,173,173,173,173,173,173],
    [173,173,173,173,173,173,173,173,173,173,173,173,173],
    [173,173,  0,  0,  0,  0,  0,  0,  0,173,173,173,173],
    [173, 88,  0,  0,  0,  0,  0,532,  0,  0,173,173,173],
    [173,173,  0,  0,  0,  0,  0,  0,  0,  0,  0, 85,90020],
    [173,173,173,173,173,173,173,173,  0,  0, 85, 87,90028],
    [173,173,173,173,173,173,173,173,173,  0,  0, 85,90010],
    [173,173,173,173,90126,173,173,173,173,173,173,173,173],
    [173,173,173,173,173,173,173,173,173,173,173,173,173],
    [173,173,173,173,173,173,173,90126,173,173,173,173,173],
    [173,173,173,173,173,173,173,173,173,173,173,173,173],
    [173,173,173,173,173,173,173,173,173,173,173,173,173]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,150,150],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,150,150],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,150,150],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,150],
    [  0,  0,  0,  0,90110,  0,  0,  0,  0,  0,  0,  0,150],
    [  0,  0,  0,  0,90118,  0,  0,  0,  0,  0,  0,  0,150],
    [  0,  0,  0,  0,  0,  0,  0,90110,  0,  0,  0,150,150],
    [90072,90073,90074,90075,90076,90077,  0,90118,  0,  0,  0,150,150],
    [90080,90081,90082,90083,90084,90085,90072,  0,  0,  0,  0,90077,150],
    [90088,90089,90090,90091,90092,90093,90072,90072,90073,90074,90075,90076,90077],
    [90096,90097,90098,90099,90100,90101,  0,90080,90081,90082,90083,90084,90085]
],
    "bg2map": [

],
    "fg2map": [

]
}