main.floors.MT245=
{
    "floorId": "MT245",
    "title": "245 层",
    "name": "245 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "03.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 100000,
    "defaultGround": 919,
    "bgm": "16.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "1,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "10,3": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20, 88,180205, 20,576,538,587, 20, 21, 81,  0,576, 20],
    [ 20,  0, 20, 20, 22, 20,  0, 20,533, 20, 20,532, 20],
    [ 20,535,579, 21,529, 20,535,637, 50, 20, 87, 60, 20],
    [ 20, 20, 20, 20,  0, 20, 20,  0, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20,577, 82, 20,572, 20,180205, 20,584, 20],
    [ 20, 20, 20, 20, 20,579, 20,537, 20, 50, 20,543, 20],
    [ 20, 20, 82,619, 82, 59, 20,577, 20,  0,587,  0, 20],
    [ 20, 20,619, 20, 20,579, 20,534, 20, 20, 20, 82, 20],
    [ 20, 60, 82, 60, 20,533, 82, 21,  0, 20,  0,541, 20],
    [ 20, 20, 20, 82, 20,637, 20, 20, 22,536, 21,  0, 20],
    [ 20,619, 82,619, 20,  0,584, 20, 60, 20,577,180118, 20],
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "weather": [
        "snow",
        2
    ]
}