main.floors.MT243=
{
    "floorId": "MT243",
    "title": "243 层",
    "name": "243 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "03.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 100000,
    "defaultGround": 919,
    "bgm": "16.mp3",
    "firstArrive": [
        "前方，冰雪构建而成的世界一览无余，\n各种珍稀奇兽在冰层中游荡嬉戏。",
        "\t[纳可]这里游荡的荒兽好强……\n也对呢，能够耐受如此严寒，\n它们的实力绝不会太差。",
        "\t[纳娜米]不如说——\n是这里的环境，滋养了这里的荒兽。",
        "\t[纳娜米]空气中弥漫着浓烈的冰元素，\n仅仅是呼吸之间，能量就汇聚到身体内部，\n化作精纯的元素力量。",
        "\t[纳娜米]看来我们来对地方了。\n在这片冰原上，修炼起来恐怕事半功倍，\n与之相比恶劣的环境反倒不算什么了。",
        "\t[纳可]唔，可惜这和我的火元素领域是互斥的诶。\n恐怕对我的帮助不算很大。",
        "\t[纳娜米]可可，峰他把你引导到这里，\n到底是什么目的？\n按理来说，即使绝顶高手，也能在这种环境下受益。",
        "\t[纳可]其实我也这样想过……\n不过放心吧，我相信峰大哥没有恶意。",
        "\t[纳娜米]（但愿如此……）"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,10": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20,576,  0, 20, 21, 20, 88, 20,180205, 22, 20,180127, 20],
    [ 20,  0,528, 82,  0, 20,531, 20,587, 22, 81,576, 20],
    [ 20, 81, 20, 20,533, 20, 81, 20,538, 20, 20,536, 20],
    [ 20,586, 20, 20, 60, 20,579, 20, 59,  0, 20,572, 20],
    [ 20, 21, 20, 20,586,  0,529, 81,  0,534, 81,  0, 20],
    [ 20,  0,584, 20,  0,572,  0, 20, 59,  0, 20, 21, 20],
    [ 20,535, 20, 20,534, 20, 81, 20, 20, 20, 20, 81, 20],
    [ 20,585,  0,537,579, 20,572,  0, 20, 60, 20,585, 20],
    [ 20, 20, 20, 20, 82, 20,  0, 59, 20, 81, 20,532, 20],
    [ 20, 87,  0,535,  0, 20, 20, 20, 20, 81, 20, 21, 20],
    [ 20,180205, 21, 20,577,  0, 21,528,  0,577,  0,637, 20],
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "weather": [
        "snow",
        2
    ]
}