main.floors.MT242=
{
    "floorId": "MT242",
    "title": "242 层",
    "name": "242 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "03.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 100000,
    "defaultGround": 919,
    "bgm": "16.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,2": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[溪月]你想干什么呀？\n一百多万经验并不重要，\n为了这个，多用这么多道具是很亏的！"
            ]
        }
    },
    "changeFloor": {
        "6,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {
        "6,4": [
            "\t[纳娜米]可可，快看前面，好像有一个女孩子。",
            "\t[纳可]这么冷的地方，我都快坚持不住了，\n为什么她看起来一点事都没有呀……",
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        2
                    ]
                ],
                "remove": true
            },
            "\t[纳娜米]或许那个女孩子本身实力就很强呢。\n诶，她好像往冰原的更深处去了。",
            "\t[纳可]姐姐，我们现在该怎么办…\n要不要跟上去？",
            "\t[纳娜米]这样的线索当然要抓住。\n我们跟着她看看，如果情况不对，\n至少还可以求助那位强者。"
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20,  0,  0, 87,  0,  0, 20, 20, 20, 20],
    [ 20,620, 50, 84,  0,  0,1238,  0,  0, 84, 47,620, 20],
    [ 20, 20,180151, 20,  0,  0,  0,  0,  0, 20,180151, 20, 20],
    [ 20, 20, 20, 20, 20, 20, 86, 20, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20, 20,902, 20, 20, 20, 20, 20, 20],
    [ 20, 20,635, 60, 84, 24,  0, 24, 84,572,636, 20, 20],
    [ 20, 20,180151,180151,180151,  0,902,  0,180151,180151,180151, 20, 20],
    [ 20, 20,641,620, 84, 24,  0, 24, 84,619,587, 20, 20],
    [ 20, 20, 20, 20, 20, 20, 86, 20, 20, 20, 20, 20, 20],
    [ 20, 20, 20,180151, 20, 20,  0, 20, 20,180151, 20, 20, 20],
    [ 20, 20,180151,920,965,965, 88, 15, 16, 23,180151, 20, 20],
    [ 20, 20, 20,180151, 20, 20, 20, 20, 20,180151, 20, 20, 20]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "weather": [
        "snow",
        2
    ]
}