main.floors.MT240=
{
    "floorId": "MT240",
    "title": "240 层",
    "name": "240 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 50000,
    "defaultGround": "ground",
    "bgm": "15.mp3",
    "color": null,
    "weather": null,
    "firstArrive": [
        "一天之后，飞云阁。",
        {
            "type": "setCurtain",
            "time": 1000
        },
        "\t[纳布]纳布拜见峰大人。\n谢峰大人救了可可的性命。",
        "\t[纳布]就在昨夜，百家整个家族都被人连根拔起……\n百家，也是根深蒂固的家族，\n却因为仅仅一步走错，就搞得家族基业一夜被毁。",
        "\t[纳布]昨天可可竟然都掺合进去，\n想想我都后怕。",
        "\t[峰]连根拔起？",
        "\t[纳布]他们因为我纳家的崛起而担惊受怕，\n竟然借了巨额外债，\n通过秘密渠道弄到了一套出自‘古神废墟’的甲衣。",
        "\t[纳布]可惜昨天他们队伍被毁掉，\n据说甲衣也被掠夺……百家根本没有办法偿还外债，\n那些放债的一怒之下杀了他们，抢走了家产。",
        "\t[峰]古神废墟……\n是说那片庞大的古战场么，\n其中陨落过大量的不朽神灵。",
        "\t[纳布]是的，不朽的战争……\n我纳家，也曾偶然得到古神废墟里的东西。",
        "\t[纳布]只不过，那仅仅是其中最低层次的，\n一把能够杀死天空级中期的武器罢了。\n峰大人，你看。",
        "\t[峰]？！\n（这是……镭射枪？B6等级？\n没想到这种东西居然会流传到这里。）",
        "两人的交谈，持续了片刻。\n纳可并没有打扰他们的交流，\n只是用好奇的眼神打量着峰。",
        "\t[纳布]峰大人，您跟可可有话要说？\n那……纳布就先在隔壁的静室等待了。",
        {
            "type": "hide",
            "loc": [
                [
                    3,
                    7
                ]
            ],
            "remove": true
        },
        {
            "type": "moveHero",
            "time": 250,
            "steps": [
                "down:1"
            ]
        },
        {
            "type": "changePos",
            "direction": "right"
        },
        "\t[纳可]峰大哥你……有什么想问的吗？",
        "\t[峰]小家伙，你现在使用的秘法，\n是从哪里得来的？",
        "\t[峰]（这秘法蕴含宇宙星辰运转的些微奥妙，\n按理来说，应该不会在这里出现。）",
        "\t[纳可]……这是两年以前，\n我在一艘“天外来客”的飞船上找到的。\n峰大哥认识这种秘法吗？",
        "\t[峰]嗯……（“天外来客”吗。\n看来末世秘境的那人，\n确实是两年前陨落在这片区域。）",
        "\t[峰]（这个世界的人，对“天外来客”抱有敌意，\n而那位天才两年前陨落的地方，\n反而对“天外来客”更安全。）",
        "\t[峰]（他们料定，天外来客短时间不敢再来，\n因此……不会过多警惕。）",
        "\t[峰]这套秘法仅仅包含基础内容，\n尚有不很多不完善之处。\n我且给你一套更深层次的秘法来研习。",
        "峰手指轻弹，两条光线飞射出去，钻进了纳可眉心。\n纳可只感觉到脑袋一阵胀痛，\n随后突然涌现出了许多知识。",
        "这些知识都是这门秘术所包含的内容，\n只不过以她目前的领悟深度，\n暂时只能读懂其中的一部分。",
        {
            "type": "setValue",
            "name": "item:I901",
            "value": "1"
        },
        "领悟了新的秘法\r[aqua]【映星花】\r！\n请在装备栏中进行装备。",
        "\t[纳可]（好厉害……不，好漂亮的术式！\n稍加体悟，就感觉像要沉醉其中一般。）",
        "\t[纳可]（峰大哥的实力那么强，\n他肯定懂得很多关于秘法和领悟的事。\n可是……为什么要帮我呢。）",
        "似乎看出少女的疑惑，\n峰嘴角勾起笑意，摇了摇头，\n没有多说什么。",
        "\t[纳可]……这次抵御兽潮，\n城主府给予前几名的奖励，\n恐怕都比不上峰大哥给的这些呢。",
        "\t[峰]兽潮吗？\n说起来，这其中也有蹊跷。",
        "\t[峰]看似是由于大量荒兽的变异所导致。\n可据我了解，那【不朽神殿】之中的神灵，\n不止是人类，也有很多荒兽存在。",
        "\t[纳可]是这样吗……\n不朽神殿，不朽神灵们高高在上，\n几乎不插手世俗的事务。",
        "\t[纳可]可能，在燕岗领看来很严重的兽潮，\n在他们的眼中却微不足道吧，\n【神灵】，既不属于人类，也不属于荒兽呢。",
        "\t[峰]想法不错，可惜……\n不朽神灵，也依旧有种群之分。",
        "\t[峰]所谓兽潮，或许只是人类与荒兽，\n双方高层合谋练兵的手段罢了。",
        "\t[纳可]诶——\n可是死了这么多人啊，为什么……",
        "\t[峰]只要万千弱者中诞生一个强者，\n对族群的价值便远大于万千弱者。\n（就如……那域外战场一般。）",
        "\t[峰]无法接受吗？没关系。\n说到底，我并未接触过【不朽神殿】，\n这终归只是我的推断罢了。",
        "纳可感到有些恍惚，\n在这位神秘高手的眼界引领之下，\n她似乎觉得，曾经看到的整个世界都不再真实了。",
        "\t[纳可]那么多人类强者的牺牲，\n如果真的只是一种筛选强者的方式，\n突然……对于抵御兽潮没有什么兴趣了。",
        "\t[峰]这些都是【强者】所必须认识到的东西。\n比起抵御兽潮，\n或许有一个地方更适合你磨炼自己。",
        "\t[峰]在燕岗城以东约万里的地带，\n有一处隐秘之地，\n似乎时间的流速在那里被加快了。",
        "\t[纳可]诶，那里有一处机缘之地吗？\n可是峰大哥，为什么你自己不去呢……",
        "\t[峰]没有必要，那些东西是一位域主……\n领域级强者留下的，对我而言没有意义。",
        "\t[峰]记住，一定要小心，\n我且在你的身上留下一道精神印记，\n遇到危险时，用它来与我沟通。",
        "\t[纳可]……明白。",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 1000,
            "keep": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    5,
                    6
                ]
            ],
            "remove": true
        },
        {
            "type": "openDoor",
            "loc": [
                6,
                3
            ]
        },
        {
            "type": "setCurtain",
            "time": 1000
        },
        "\t[纳可]峰大哥他，究竟想做什么呢。",
        "\t[纳可]他似乎是那种低调潜修的苦修者，\n想要培养我成为【强者】。\n可是，我还没有做好准备……"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "3,7": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        },
        "5,6": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        },
        "6,1": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                {
                    "type": "if",
                    "condition": "(flag:240f==0)",
                    "true": [
                        {
                            "type": "setCurtain",
                            "color": [
                                0,
                                0,
                                0,
                                1
                            ],
                            "time": 1000,
                            "keep": true
                        },
                        "两天之内，经历了许多变故。\n百家覆灭，遇到神秘强者峰，\n揭开兽潮背后的真相。",
                        "纳可迫切地想找一个人倾诉，\n她觉得世界都不再像她熟悉的世界一般，\n除非是……和熟悉的人在一起时。",
                        "纳娜米微笑着听完纳可的叙述，\n沉默了半响才开口。",
                        "\t[纳娜米]可可，这是你的一次机会，\n无论有没有做好准备，\n都应该尝试伸手抓住它。",
                        "\t[纳娜米]再说了……\n无论你成为什么样的强者，\n你永远是我的妹妹。",
                        "纳可觉得眼眶有些湿润。\n她抱住眼前的少女，\n在心中暗暗下了某个决定。",
                        "………………",
                        "数天之后，经过休整，\n纳可和纳娜米与家族的人道别后，\n踏上了去往机缘之处的征程。",
                        "领域级强者留下的宝物！\n虽然对峰来讲不算什么，\n但对于现在的纳可与纳娜米，无异于天降至宝。",
                        "几天之后，\n她们竟在燕岗城东方尽头，\n发现了一处冰雪覆盖的雪原。",
                        {
                            "type": "setValue",
                            "name": "flag:240f",
                            "value": "1"
                        },
                        {
                            "type": "changeFloor",
                            "floorId": "MT241",
                            "loc": [
                                6,
                                2
                            ],
                            "direction": "down"
                        }
                    ],
                    "false": [
                        {
                            "type": "changeFloor",
                            "floorId": "MT241",
                            "loc": [
                                6,
                                1
                            ],
                            "direction": "down"
                        }
                    ]
                }
            ]
        }
    },
    "changeFloor": {
        "1,6": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  1,  1, 87,  1,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  1,  1,  0,  1,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  1,  1, 85,  1,  1,  1,  1,  1,  1],
    [  1,  1,  0,  0,  0,  0,  0,  1,  1,  1,  1,  1,  1],
    [  1,  1,  0,  0,  0,  0,  0,  1,  1,  1,  1,  1,  1],
    [  1, 88,  0,  0,  0,1189,  0,  1,  1,  1,  1,  1,  1],
    [  1,  1,  0,1242,  0,  0,  0,  1,  1,  1,  1,  1,  1],
    [  1,  1,  0,  0,  0,  0,  0,  1,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}