main.floors.MT256=
{
    "floorId": "MT256",
    "title": "256 层",
    "name": "256 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 200000,
    "defaultGround": 974,
    "bgm": "17.mp3",
    "firstArrive": [
        "\t[女巫]外来的小东西，\n本以为你们会知难而退，\n想不到竟然闯入这冰城里来。",
        "\t[女巫]不过，不管你们是想跑还是想留，\n今天都注定难逃一劫。",
        "\t[纳可]可恶的家伙……少看不起人！",
        "\t[女巫]拼速度，你们只有天空级初期，\n没有珍宝在身又能飞行多快？",
        "\t[女巫]而比实力，虽然你们实力很强，\n但在这冰城中，\n比你们强的人，大有人在。",
        "\t[纳娜米]连无理取闹都说得这么理直气壮，\n真的很佩服你们呢。",
        "眼前的局势已经非常明朗，\n两个少女互相之间迅速传音交流着。",
        "\t[纳可]（姐姐……怎么这么不对劲，\n这里的居民似乎很不欢迎我们。）",
        "\t[纳娜米]（从这些人的身上，感觉到了浓烈的敌意。\n如今看来，只有一战了。\n可可，我们直接攻进去，会会他们！）",
        "\t[纳娜米]（这些家伙，最强的大约在天空级中期左右。\n以我们目前的实力，勉强还可以应付。）",
        "\t[纳可]（姐姐，有件事没有告诉你，\n其实，我现在有领域二重……）",
        "\t[纳娜米]（诶诶？什么时候——\n原来如此，刚才的冰霜门户吗。\n不愧是你可可，总能给姐姐带来惊吓。）",
        "\t[纳可]（哼，刚才那几个让人火大的家伙……\n不能就这样算了，\n一定要狠狠蹂躏他们！）",
        "\t[纳娜米]（现在的话，恐怕对方要倒霉了呢。）"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "10,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [975,975,579,637,585,584,975,975,975,975,975,975,975],
    [975,975,251160,251161,251162, 84,975,975,975,  0, 87,975,975],
    [975,975,251168,251169,251170, 60,975,572,549,579,  0,975,975],
    [975,975,251176,251177,251178,  0,975,552,251160,251161,251162,975,975],
    [975,975,251184,251185,251186, 60,  0, 60,251168,251169,251170,975,975],
    [ 47, 47,251200,251201,251202,  0,554,  0,251176,251177,251178,975,975],
    [ 47, 47, 84, 84,  0, 60,  0, 60,251184,251185,251186,975,975],
    [975,251160,251161,251162, 60,  0, 24,  0,251200,251201,251202, 50, 50],
    [975,251168,251169,251170,  0, 24,  0, 24,  0, 84, 84, 50, 50],
    [975,251176,251177,251178, 24,  0, 24,  0, 24,251160,251161,251162,975],
    [975,251184,251185,251186,  0,975, 86,975,975,251168,251169,251170,975],
    [975,251200,251201,251202, 84,975, 88,975,975,251176,251177,251178,975],
    [975,1006,1006,1007, 23,975,975,975,975,251184,251185,251186,975]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}