main.floors.MT254=
{
    "floorId": "MT254",
    "title": "254 层",
    "name": "254 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "03.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 100000,
    "defaultGround": 919,
    "bgm": "16.mp3",
    "firstArrive": [
        "系统提示：触碰上方的冰霜门户，\n或许会有意外收获。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,1": [
            {
                "type": "if",
                "condition": "(flag:2yu==0)",
                "true": [
                    "\t[纳可]咦，这是什么。",
                    "\t[纳娜米]好像一道被冰雪覆盖的门户，\n上面还刻画着各种奇怪的纹路。",
                    "\t[纳可]确实……可惜纹路太模糊了，\n不仔细看的话，根本无法看清楚呢。",
                    "纳可的手触碰上了这冰雪门户。\n霎时间，刺骨的寒冷触感，\n从手掌传来，让少女不禁打了个哆嗦。",
                    "\t[纳可]这是——",
                    {
                        "type": "setCurtain",
                        "color": [
                            0,
                            0,
                            0,
                            1
                        ],
                        "time": 1000,
                        "keep": true
                    },
                    "在纳可的眼前，出现了一条长长的甬道，\n一直通向前方。\n甬道两侧都是高耸透明的冰壁。",
                    "她本能地迈步向甬道的尽头走去，\n很快看到了一扇冰门，\n这扇冰门看上去朴实无华，散发着淡蓝色的光芒。",
                    "冰寒的力量犹如实质，弥漫在空气中，\n逐渐汇聚成一种陌生而又熟悉的景象，\n那是——水蓝色的庞大六芒星阵！",
                    "\t[纳可]领域…\n冰元素的领域！",
                    "纳可不受控制地抬起手，火焰的能量席卷，\n在她的身周蔓延，\n转瞬与硕大的冰蓝六芒星碰撞！",
                    "剧烈的爆炸声响彻四周，\n整个甬道都剧烈地晃动起来。",
                    "冲击波席卷四周，\n冰墙出现一道道裂痕，旋即迅速愈合。",
                    "那水蓝色的六芒星，同样出现一道道缺口，\n炽热的火焰能量，便趁虚而入，\n融合进了六芒星的缝隙当中，最终消失不见。",
                    "\t[纳可]水，滋润万物，温和优雅……\n火，残酷暴戾，却照耀一切，点燃希望。",
                    "\t[纳可]在看到这冰蓝色六芒星阵时，我印证了很多东西…\n曾经领悟的水元素秘法，\n与火元素领域，彻底融合在了一起。",
                    "\t[纳可]竟然，会有这么神异的现象产生。\n互斥的两种元素，本该是极难相融。",
                    "\t[纳可]可一旦达到完美的临界点，\n便能迈入【冰火两重天】的玄妙之境，\n迸发出不可思议的力量！",
                    "领悟了第二重领域【焰海霜天】！\n将为你自动装备，可在装备栏查看详情。",
                    {
                        "type": "setValue",
                        "name": "item:I930",
                        "operator": "+=",
                        "value": "1"
                    },
                    {
                        "type": "loadEquip",
                        "id": "I930"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:2yu",
                        "value": "1"
                    },
                    {
                        "type": "setCurtain",
                        "time": 1000
                    },
                    "\t[纳娜米]可可，你快醒醒啊……\n别吓姐姐。",
                    "纳可睁开迷离的双眼，\n身边姐姐焦急的声音传来。",
                    "\t[纳娜米]可可！\n你刚才突然晕倒了，我还以为你……\n你还记得发生了什么吗？",
                    "\t[纳可]我刚才……晕倒了吗？\n好像看到了那门户之后，有一条通道，\n不对，是一个宫殿，也不对……",
                    "\t[纳可]我……我怎么了？",
                    "纳可想要努力回忆，\n可脑海里面就像是断了片一般，\n什么也记不起来。",
                    "\t[纳娜米]可可，你没事就好。\n姐姐真怕你出事了，那样我该怎么办……",
                    "紫裙少女再也忍不住，\n泪水夺眶而出。",
                    "\t[纳可]姐姐，你别哭了，我真的没事……\n我似乎在那座冰雪门户后，\n看到了某种东西而已，并没有其他。",
                    "纳可伸出双手抱住了纳娜米，\n帮她擦干眼角的泪水。",
                    "\t[纳娜米]没事就好，没事就好。\n不过可可，你要答应我，\n以后不管遇到什么，都不能再这么鲁莽行动了。",
                    "\t[纳可]嗯，我答应你，姐姐。",
                    "纳可看向眼前的冰霜门户，\n它似乎已变得平平无奇，\n也再无声息。",
                    "她伸出指尖，屏息凝神。\n由红蓝两种光泽交汇，小小的六芒星阵，\n在她的手中顽皮地跳动着……",
                    "刚才的一切，不是梦。"
                ],
                "false": []
            }
        ]
    },
    "changeFloor": {
        "2,9": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "2,5": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 20, 20, 20, 20, 20, 20,  0, 20, 20, 20, 20, 20, 20],
    [ 20,180088,621, 20,  0,180108,180109,180110,  0, 20,621,180088, 20],
    [ 20, 20, 20, 20, 20, 20,587, 20, 20, 20, 20, 20, 20],
    [ 20, 20,180092, 20, 20, 20,  0, 20, 20, 20,180091, 20, 20],
    [ 20, 20, 20, 20, 20, 20,620, 20, 20, 20, 20, 20, 20],
    [ 20,546, 87, 20, 20,585,550, 20,619, 82,619, 82, 20],
    [ 20, 82, 20, 20, 20, 83, 20, 20, 20, 20, 20,587, 20],
    [ 20,585, 81,587,  0, 22,576, 15, 21,542, 20,543, 20],
    [ 20, 20, 82, 20,547, 20, 15, 20, 20, 60, 20,635, 20],
    [ 20,  0, 88, 20, 47, 20, 60, 20, 60,579, 20,543, 20],
    [ 20,549, 20, 20,541, 20, 20, 20,  0,539, 81,619, 20],
    [ 20,576,  0, 21,586, 81, 60, 20,180143,586, 20,645, 20],
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]
],
    "bgmap": [

],
    "fgmap": [
    [  0,180080,  0,  0,  0,180100,180101,180102,  0,  0,  0,180080,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,180084,  0,  0,  0,  0,  0,  0,  0,180083,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,180135,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

],
    "weather": [
        "snow",
        2
    ]
}