main.floors.MT262=
{
    "floorId": "MT262",
    "title": "262 层",
    "name": "262 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 200000,
    "defaultGround": 974,
    "bgm": "17.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "5,5": [
            "这只是一个普通的冰窟窿。\n难道你觉得这个是可以进去的！\n又不是所有的人都和你一样有这么多破墙镐的！"
        ],
        "5,4": [
            "这只是一个普通的冰窟窿。\n难道你觉得这个是可以进去的！\n又不是所有的人都和你一样有这么多破墙镐的！"
        ]
    },
    "changeFloor": {
        "2,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [975,975,975,975,975,975,975,975,975,975,975,975,975],
    [975,251129, 88,975,619,  0,619,975,576,975, 60, 87,975],
    [975,576,  0,975,975,975,975,975,587,554,579, 60,975],
    [975,557,975,975,975,975,975,975,975, 81,975,975,975],
    [975,  0,586,975,251261,251262,251263,975, 22,550,584,572,975],
    [975, 21,  0,975,251269,251270,251271,975,559,975,  0,577,975],
    [975,975,552,975,975,975,975,975,587,975,975, 83,975],
    [975,  0, 21,975,975,975,975,975, 58,577,975,  0,975],
    [975,577,559, 59,975,975,975,975,251139,  0, 81, 21,975],
    [975,975, 81,975,975,251137,975,975,975,556,975,557,975],
    [975,  0,579,975,585,  0, 47, 60,975,  0, 82, 21,975],
    [975,637,  0,555,  0,579,  0, 21,555, 22,975,619,975],
    [975,975,975,975,975,975,975,975,975,975,975,975,975]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}