main.floors.MT278=
{
    "floorId": "MT278",
    "title": "278 层",
    "name": "278 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 500000,
    "defaultGround": 210137,
    "bgm": "18.mp3",
    "firstArrive": [
        "\t[纳娜米]可可，小心。前面好像有动静。",
        "\t[纳可]姐姐，我们遇到水牢内的强者了吗？",
        "\t[纳娜米]不知道。这水牢内遍布着众多荒兽，\n前方那气息比较特殊，\n但也无法辨别出对方是人类还是荒兽。",
        "\t[纳娜米]总之……小心行事。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "12,12": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "6,0": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {
        "9,2": [
            "\t[竺虎]哦哟，生面孔？\n呵呵，这水牢有段时间没有新人了。",
            "\t[纳娜米]你好。\n你也是被关押进来的强者？",
            "\t[竺虎]是啊，早先几百年就被关押在这里了。\n哦，那边那个小姑娘，\n你手里拿的那把武器，不错嘛。",
            "\t[纳可]在叫我吗……？",
            "\t[竺虎]没错，啧啧，\n看起来是品质很高的念力兵器。\n那么，我就不客气地收下了。",
            "\t[纳可]？！\n你什么意思，\n这，这可不能随便给你！",
            "\t[竺虎]哈哈哈，真是太幼稚了。\n新人，你们还不懂这里的规则吧。",
            "\t[竺虎]在这里强者为尊，杀人更是家常便饭。\n难不成看你们是两个小姑娘，\n就会对你们手下留情？",
            "\t[纳娜米]呸，这些道理不需要你这种人来教。",
            "\t[竺虎]哼，不识抬举。\n两个天空级初期，如此羸弱的实力，\n应该连外面那座冰城都没闯过来吧。",
            "\t[竺虎]既然如此，不再废话——\n你们就都死在这里好了。",
            "\t[纳可]想打架就直说嘛……\n一定要绕这么大一圈回来，真是的。",
            "\t[纳娜米]（可可，这家伙果然不是什么好人。）",
            "\t[纳娜米]（不过，他不知道银霜月轮的可怕，\n也不知道你的真实实力，\n这里拿下他，应该不难！）",
            {
                "type": "battle",
                "loc": [
                    9,
                    4
                ]
            },
            "\t[竺虎]怎么可能，我竟然被压制了！",
            "\t[竺虎]算你们狠，新人，\n没想到两个小丫头，实力竟然这么强！",
            "\t[纳可]现在呢，到底是谁要死在这里呀。",
            "\t[竺虎]天真！就算你们再能打，\n在境界所限下，你们的速度是留不住我的！",
            "\t[竺虎]哈哈哈哈——等着吧。\n很快关于你们的讯息，包括实力和战斗手段，\n就会在水牢之中扩散开。",
            "\t[竺虎]你们能击败我，\n可不一定能击败其他强者，\n这里的天空级后期，可是一抓一大把啊。",
            "\t[竺虎]那就告辞了，天真的小鬼们——",
            {
                "type": "setBlock",
                "number": "I635",
                "loc": [
                    [
                        10,
                        3
                    ]
                ]
            },
            {
                "type": "setBlock",
                "number": "I636",
                "loc": [
                    [
                        10,
                        5
                    ]
                ]
            },
            {
                "type": "setBlock",
                "number": "I637",
                "loc": [
                    [
                        8,
                        5
                    ]
                ]
            },
            "\t[纳可]真是的，明明慌不择路地逃掉了，\n连宝石都掉了一地，\n还要放这种狠话。",
            "\t[纳娜米]可可，你怎么样，没有受伤吧。",
            "\t[纳可]我没事，只是姐姐……我有些担心。\n刚才那个家伙，比想象的要强。\n他并没有拿出全部实力拼命。",
            "\t[纳可]五阶的境界，本来我应该能轻松应对的。\n可这个家伙，他竟然……\n也拥有一重领域！",
            "\t[纳娜米]领域？！\n……理论上，天空级拥有领域的人，\n不应该这么普遍才对。",
            "\t[纳娜米]很有可能是，他在外面的冰原上，\n也得到了与那扇冰霜门户类似的机缘？",
            "\t[纳可]有道理呢。\n最重要的是，听他刚才的话，\n似乎连他在水牢中，都算不上强者……",
            "\t[纳娜米]没错，这里比预料中更加凶险。\n在这种压抑的环境下，\n每天都必须要提防着各种危机的发生。",
            "\t[纳可]诶，诶？\n既然姐姐这样说，\n那……我们现在该怎么办。",
            "\t[纳娜米]没事的，可可，还有我在呢。\n还记得你之前，\n在那天外来客的飞船中说过的话吗？",
            "\t[纳可]……是指什么话呢。",
            "\t[纳娜米]你说，只要在飞船里成为天空级九阶强者，\n麻烦便会迎刃而解！",
            "仿佛醍醐灌顶一般，\n纳可似乎意识到了什么，\n顿时眼前一亮。",
            "\t[纳可]姐姐，你的意思是！",
            "\t[纳娜米]如今我们得到了神秘强者峰的馈赠，\n那秘法之中蕴含的修炼要义，\n与之前可不能同日而语。",
            "\t[纳娜米]这水牢之中的元素力量，\n比起冰原上，甚至更加丰沛，\n而且已经不会与你的领域相斥。",
            "\t[纳娜米]我们的时间很多，\n完全能在这里达到天空级中期，\n甚至是天空级后期的高度！",
            "\t[纳可]………………\n有道理呀！",
            "\t[纳可]只要变得比所有人都强，\n自然就能化解危机，\n好像不失为一个好办法呢。",
            "\t[纳可]也许，峰大哥说的那份机缘，\n就是这个……？",
            "\t[纳娜米]那就抓紧时间行动吧。\n那个人很快会把我们的讯息传播出去。",
            "\t[纳娜米]在更多强者赶到之前，\n要快些找到一个隐蔽的，\n可供修炼的角落才行。"
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [210046,210046,210046,210046,210068,210055, 88,  0, 60,154,154,154,154],
    [210046,210046,210068,210054,210055,210154,  0,572,  0,852,154,154,154],
    [210046,210046,210047,210153,210154,210162,154,154,210166, 86,210166,154,154],
    [210046,210046,210047,210161,210162,210162,154,154,210165,  0,  0,154,154],
    [210046,210046,210047,210161,210162,210170,154,154,  0,871,  0,154,154],
    [210046,210046,210047,210169,210170,154,154,154,  0,  0,  0,569,620],
    [210046,210046,210047,154,154,154,154,619,854,154,154, 86,154],
    [210046,210046,210047,154,154,154,855,  0,210037,210039,154,853,154],
    [210046,210046,210047, 86,856,584,  0,210037,210059,210047,154, 86,154],
    [210046,210046,210047,587,210037,210038,210038,210059,210046,210060,210039, 22,568],
    [210046,210046,210060,210038,210059,210046,210046,210046,210046,210046,210060,210039, 86],
    [210046,210046,210046,210046,210046,210046,210046,210046,210046,210046,210046,210047, 60],
    [210046,210046,210046,210046,210046,210046,210046,210046,210046,210046,210046,210047, 87]
],
    "bgmap": [

],
    "fgmap": [
    [210006,210007,  0,210029,  0,  0,  0,  0,  0,  0,  0,154,154],
    [210014,210015,  0,  0,  0,  0,  0,  0,  0,  0,  0,154,154],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,154],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [210001,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,210021,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,210029,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,210021,  0,  0,  0,  0],
    [210022,210023,  0,  0,  0,  0,  0,  0,210029,  0,  0,  0,  0],
    [210030,210031,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,210018,  0,  0,  0,  0,210021,  0],
    [  0,  0,  0,  0,210001,  0,  0,  0,  0,210001,  0,210029,  0],
    [  0,210010,  0,  0,  0,  0,  0,210020,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176]
]
}