main.floors.MT275=
{
    "floorId": "MT275",
    "title": "275 层",
    "name": "275 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 200000,
    "defaultGround": 974,
    "bgm": "17.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,6": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        }
    },
    "changeFloor": {
        "1,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {
        "6,9": [
            "\t[老人]狂妄自大的外来者，\n杀我族人，罪该当诛！",
            "\t[纳娜米]只准你们对我们下杀手，\n不准我们杀你的族人？\n开什么玩笑。",
            "\t[老人]不管你们说什么，今天都要死！\n外来者，不管你们用了什么妖术闯到这里。",
            "\t[老人]在光环的庇护之下，我等将誓死冲锋！\n谔谔啊啊啊啊啊啊！",
            "\t[纳可]是你们先挑衅的吧，\n怎么好像我们是坏人一样……！",
            {
                "type": "battle",
                "loc": [
                    6,
                    7
                ]
            },
            {
                "type": "battle",
                "loc": [
                    4,
                    6
                ]
            },
            {
                "type": "battle",
                "loc": [
                    6,
                    5
                ]
            },
            {
                "type": "battle",
                "loc": [
                    8,
                    6
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    6,
                    2
                ]
            },
            "\t[老人]你们……完了……\n主人会……替我们……报仇……",
            "\t[纳娜米]………………",
            "\t[纳可]有点奇怪，姐姐。",
            "\t[纳可]之前的战斗中，那些家伙在死亡后，\n他们的“族人”非但没有害怕，\n反倒更疯狂地扑上来。",
            "\t[纳可]简直不像是正常人嘛……\n打个比方的话，更像是我们曾经遇到的，\n那些没有感情的【科技造物】。",
            "\t[纳娜米]诶，不可能吧？\n你的意思是说，\n这些家伙都不是真正的人类？",
            "\t[？？？]恭喜恭喜。\n外来者，\n你们破译了这里的秘密！",
            {
                "type": "setBlock",
                "number": "E1237",
                "loc": [
                    [
                        6,
                        6
                    ]
                ],
                "time": 1000
            },
            "\t[？？？]作为奖励——\n送你们去一个好玩的地方，\n【水牢】。",
            {
                "type": "animate",
                "name": "wuyu",
                "loc": "hero"
            },
            "\t[纳娜米]你是……之前看到的那个女孩子！\n果然，是你刻意把我们引导到这里的。",
            "\t[纳可]姐姐，小心！",
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 1000,
                "keep": true
            },
            "几乎没有任何反应时间，\n眼前便是一片漆黑。",
            {
                "type": "changeFloor",
                "floorId": "MT276",
                "loc": [
                    6,
                    1
                ],
                "direction": "down"
            }
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [975,975,975,975,975,975,251135,975,975,975,975,975,975],
    [975,  0,620,975,975,251135, 87,251135,975,975,620,  0,975],
    [975,620,975,975,975,975, 85,975,975,975,975,620,975],
    [975,975,975,251135,251135,251135,  0,251135,251135,251135,975,975,975],
    [975,1057,975,251135,  0,  0,  0,  0,  0,251135,975,1057,975],
    [975,975,975,251135,  0,  0,569,  0,  0,251135,975,975,975],
    [975,975,975,251135,569,  0,  0,  0,569,251135,975,975,975],
    [975,621,975,251135,  0,  0,569,  0,  0,251135,975,621,975],
    [975,975,975,251135,  0,  0,  0,  0,  0,251135,975,975,975],
    [975,621,975,251135,251135,251135, 86,251135,251135,251135,975,621,975],
    [975,975,975,975,975,  0,584,  0,975,975,975,975,975],
    [975, 88,567, 59,567,585,  0,587, 83,621, 83,621,975],
    [975,975,975,975,975,975,975,975,975,975,975,975,975]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}