main.floors.MT284=
{
    "floorId": "MT284",
    "title": "284 层",
    "name": "284 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 500000,
    "defaultGround": 210137,
    "bgm": "18.mp3",
    "firstArrive": [
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 1000,
            "keep": true
        },
        "度日如年的无聊岁月，\n纳可与纳娜米偶尔互相切磋，\n偶尔随意探索，竟然有了一些意外收获。",
        "在水牢的某个角落，\n意识的探查被隔离开来，\n似乎撞到了一层无形的壁障一般。",
        "她们不明白那是什么，\n只能打定主意以后再来探索。",
        "………………",
        "水牢的强者之间并非没有来往，\n而是聚集成一个个小团体，\n互相之间交流情报，时不时爆发小规模的冲突。",
        "在这些情报网之中，\n有一个流传甚广的【强榜】，\n之上记载了二十名最强的强者。",
        "这些强者，便代表了这里的最高层战力。\n他们每一人实力都在天空级后期，\n且几乎人人拥有领域！",
        "水牢实在太寂寞太枯燥，\n漫长的时光中，\n【强榜】算是这些强者为数不多所感兴趣的消遣。",
        "强榜的第一名，是空位。",
        "而位列第二名的【蓝柒】——\n也是强榜的发布者，\n在水牢之中堪称无人能敌。",
        "这之中似乎有某种原因，\n纳可与纳娜米也无暇顾及，\n只是一心修炼，为将来的未知数做足准备。",
        "没想到，与强榜强者的初次接触，\n来得是这么快。",
        "就在这一天，\n当两人再度出去打探情报时，\n忽然，纳可脸色猛地一变。",
        "纳娜米也是一惊，\n只见在前方，\n有着一道身影迅速靠近，已然避之不及。",
        "\t[纳娜米]糟糕，是强榜上的人。\n排名十九，被称为【冰人】的莫尔。",
        "\t[纳可]诶诶？这家伙是什么时候出现的……",
        {
            "type": "setCurtain",
            "time": 1000
        },
        "系统提示：请与莫尔战斗，\n获得实力的提升，并继续推动剧情。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "3,6": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[莫尔]在下莫尔。\n久仰，听说最近出现了很厉害的新人。",
                "\t[莫尔]如今一见，能够在这般年龄，\n便到达如此进境，果然不凡。",
                "\t[纳可]这些话就不必讲了……\n你找上我们，有什么事吗？",
                "\t[莫尔]放心吧，我无意对付你们。\n我只是想讨教一下，能压制竺虎的【二重领域】，\n到底有多神奇。",
                "\t[纳可]没兴趣呢，而且很奇怪啊。\n明明身处牢笼之中，朝不保夕的处境下，\n还在想着与人切磋较量吗……",
                "\t[莫尔]这里的凶险，我当然知道得比你们多。\n可比起变强，这又算得了什么呢。",
                "\t[莫尔]我可以告诉你们，\n这水牢中的几个最强者，\n脾气可都很古怪。",
                "\t[莫尔]像强榜发布者【蓝柒】、\n落叶刀【秋兴】等，\n每一个实力都数十倍于我。",
                "\t[莫尔]在他们的压力之下，\n我们这些人虽为强榜强者，\n可也被迫无奈，只得东躲西藏。",
                "\t[纳娜米]所以，你觉得我们会答应吗？\n在这里战斗，对我们也没有任何好处吧，\n还可能会吸引来其他强者。",
                "\t[莫尔]嗯，这也确实，\n在下料定两位不会轻易答应，不过——\n这不是轻率的冒犯，而是一次交易。",
                "\t[纳可]诶诶？\n什么交易，你在说什么啊。",
                "\t[莫尔]可爱的小家伙，你手里的武器，很强。\n我曾经长时间研究过念力兵器，\n你这月轮，起码是巅峰灵宝级。",
                "\t[莫尔]即使云霄级强者，也会趋之若鹜。\n可是你暂时无法发挥它的威力。\n而我，或许可以帮到你。",
                "\t[纳可]……你的意思是！",
                "\t[莫尔]如果你们赢了，\n我会把念力兵器的使用技巧倾囊相授。",
                "\t[莫尔]如果我赢了，我什么都不会做，\n只求能够学习你的领悟，\n或是听听你对领域一道的见解。",
                "纳可沉默了，\n这个条件听起来一点都不苛刻。\n不如说，让人难以拒绝。",
                "\t[纳娜米]（可可，这样未必没有好处，\n但他真的值得信任吗……）",
                "\t[莫尔]我知道你在担心什么，\n以强榜强者的声誉起誓，\n我绝不会随意做什么手脚。",
                "\t[莫尔]况且，做出见不得人的勾当，\n一旦消息从这传出去，\n恐怕便是身败名裂，招致灾祸吧。",
                "\t[纳可]好……我答应你。\n既然如此，请吧。",
                "\t[莫尔]哈哈——好！\n得罪了，小家伙。",
                {
                    "type": "battle",
                    "loc": [
                        3,
                        6
                    ]
                }
            ]
        }
    },
    "changeFloor": {
        "12,6": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "0,12": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "3,6": [
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 1000,
                "keep": true
            },
            "纳可击败了位在强榜的强者莫尔，\n一度在水牢强者中引起轰动。",
            "不少人暗暗震惊她的进步速度之快，\n在提高了对纳可两人的实力评估之余，\n行事也变得更为谨慎。",
            "——虽然只是两个小丫头，\n但绝对不能轻易招惹。",
            "尤其是先前曾挑衅她们的竺虎，\n更是吓得提心吊胆，\n生怕对方哪天心情不好，来找自己的麻烦。",
            {
                "type": "sleep",
                "time": 500
            },
            "依照约定，莫尔将自己关于念力兵器的领悟，\n毫无保留地教给了纳可。",
            "到得此时，她才发现，\n在这水牢之中，也并非只有你死我活，\n如莫尔这般一心为修炼的强者也有不少。",
            "交谈之中，\n她感受得到莫尔对于变强的渴望，\n这份渴望的价值甚至是超越了生存。",
            "很快，由216颗白水晶构造成的月轮，\n在少女的手上，绽放出更华丽的光彩……",
            "领悟深度提升，\n武器蜕变为【银霜月轮（二重）】！\n已为你自动装备，可在装备栏内查看。",
            {
                "type": "unloadEquip",
                "pos": 1
            },
            {
                "type": "setValue",
                "name": "item:I1124",
                "value": "0"
            },
            {
                "type": "setValue",
                "name": "item:I1125",
                "value": "1"
            },
            {
                "type": "loadEquip",
                "id": "I1125"
            },
            {
                "type": "setCurtain",
                "time": 1000
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [210054,210054,210054,210054,210054,210054,210054,210054,210055,154,154,154,154],
    [210153,210153,210153,210153,210153,210153,210153,210153,210154,635,860,  0,587],
    [210161,210161,210161,210161,210161,210161,210161,210161,210162,154,154,1058,  0],
    [210161,210161,210161,210150,210161,210161,210161,210161,210162,154,154, 82,210174],
    [210161,210161,210161,210158,210161,210161,210161,210161,210162,572, 81,  0, 60],
    [210169,210169,210169,210169,210169,210169,210169,210169,210170, 59,154, 50,  0],
    [572,154,154,1216,154,154,154,154,852,154,154,  0, 88],
    [ 59,154,154,576,154,637,154,579, 22, 21, 82, 60,  0],
    [ 81,154,154,  0,1057,  0,154,154,853,154,154,154,154],
    [ 21,856,572, 21,154,854, 60,858,  0,572,1057,  0,577],
    [154, 82,154,154,154, 21,154,154,154, 81,154,154,154],
    [154, 59,154,154,154, 21,154,154,  0,857,154,154,154],
    [ 87, 59,858,586,  0,857,619, 81,585,  0, 81, 81, 60]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176]
]
}