main.floors.MT287=
{
    "floorId": "MT287",
    "title": "287 层",
    "name": "287 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 500000,
    "defaultGround": 210137,
    "bgm": "18.mp3",
    "firstArrive": [
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 1000,
            "keep": true
        },
        "寂静的水牢之中，\n仿佛时间都静止了一般，\n世界枯燥而乏味。",
        "浑然不觉之中，\n纳可与纳娜米已经在水牢内度过了很长时间——\n从踏入这里开始，已然整整一年半。",
        "水牢中的五天，相当于外界的一天。\n一年半的时光，外界也已是三个月过去，\n日子在重复的修行中度过。",
        "两位少女有彼此陪伴，\n这般漫长枯燥的修行时光，\n却也不算多么难熬。",
        "她们以为事情将在这种修行下，\n逐渐迎来不一样的转机，\n可意外总会先一步到达。",
        "比如，此时此刻——\n出现在眼前的强者，\n打破了平静的日子。",
        {
            "type": "setCurtain",
            "time": 1000
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,2": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[秋兴]两位小姐好，容我自我介绍一下。\n强榜第三位，【落叶刀】秋兴。",
                "\t[纳娜米]（落叶刀……！\n水牢强榜排名第三的落叶刀。）",
                "\t[纳可]（怎么回事，他怎么会在这里，\n明明我们一直隐蔽自己的行踪……）",
                "\t[纳娜米]（可可，不要大意，先听听他想说什么。）",
                "\t[秋兴]啊哈，我知道你们想说什么。\n其实我早就发现你们的藏身之处了。",
                "\t[秋兴]只不过，我在等你们成长，\n直到足以与我对抗。",
                "\t[纳可]真难以理解……\n想要更强的对手，\n为什么盯着我们不放啊。",
                "\t[秋兴]哈哈哈，\n小姑娘，你看到一个好玩的玩具，\n会忍心放着不管吗？",
                "\t[纳可]……所谓好玩的玩具，是指我们？",
                "\t[秋兴]聪明！没错，我只是单纯觉得好玩，\n所以想和你们玩而已。",
                "\t[秋兴]自然，如果你们能让我满意，\n我会放你们离开。",
                "\t[秋兴]哎呀，真是漂亮的小东西呢……\n让我看看。",
                "秋兴伸出手来，\n作势想要触碰纳可的脸颊。",
                "“啪——”\n纳娜米果断挥掌，\n拍落秋兴的手。",
                "\t[纳娜米]呸，无耻败类，别碰可可，\n否则你最好祈祷你不会出事。",
                "\t[秋兴]哦呀，小姐脾气倒挺大。\n只不过，你的实力能不能配得上你的脾气呢？",
                {
                    "type": "battle",
                    "loc": [
                        6,
                        2
                    ]
                }
            ]
        }
    },
    "changeFloor": {
        "12,0": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,0": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "6,2": [
            {
                "type": "openDoor",
                "loc": [
                    6,
                    1
                ]
            },
            {
                "type": "animate",
                "name": "wuyu",
                "loc": [
                    6,
                    2
                ]
            },
            "\t[秋兴]哎呀，输了输了。真可惜。",
            "\t[纳可]你这家伙……为什么要留手？",
            "\t[秋兴]怎么？这么可爱的小妹妹，\n难道一定要打生打死不成？哈哈哈……",
            "\t[秋兴]想必刚才的战斗，\n你也看出了你那“领域”的弱点。\n要怎么弥补，就靠你自己了。",
            "\t[纳娜米]难以理解，你到底想干什么……\n是在帮助我们吗？\n可没有理由帮助素不相识的人吧。",
            "\t[秋兴]哎，谁叫水牢里，\n有个令人讨厌的存在呢，\n这里的强者没有谁奈何得了她。",
            "\t[秋兴]不如把希望押在你们身上，\n等你们再变强一点，她就会对你们出手的。",
            "\t[秋兴]真是完美的计划，不是么？\n呵呵呵……",
            "\t[纳可]…………",
            "\t[秋兴]哎呀，怎么不小心把计划直接讲出来了？\n啊，算了算了。\n反正你们早晚也会知道的。",
            "\t[纳可]……你到底想说什么，\n那个讨厌的存在，指谁？",
            "\t[秋兴]告诉你们也无妨。\n那个人……",
            "\t[秋兴]水牢强榜的发布者，\n也是这里的第二强者——蓝柒。",
            "\t[秋兴]她用暴力胁迫这里的强者，\n阻止他们变强，\n以此巩固她的地位。",
            "\t[纳娜米]你们没有试过，联合起来反抗吗？",
            "\t[秋兴]反抗？啊哈，当然。\n只不过全都失败了。",
            "\t[纳可]【蓝柒】有这么强吗……？",
            "\t[秋兴]哎呀，小丫头还是天真。\n并非实力差距悬殊，\n她没有强到那种能压制所有人的地步。",
            "\t[秋兴]只不过每次联合反抗，\n受伤的人都会被其他人反水，\n最后内讧成一团。",
            "\t[纳娜米]……原来如此。\n因为利益的冲突，\n互相之间完全无法信任呢。",
            "\t[秋兴]就是啊。\n苦等了上千年，\n你们是最有希望击败她的人了。",
            "\t[秋兴]指出你们领域的缺陷，\n又告诉你们这些，\n我已经仁至义尽咯。",
            "\t[秋兴]好了，该做告别了。\n两位小姑娘，再见了。",
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 1000,
                "keep": true
            },
            "\t[纳可]姐姐，我总觉得没有这么简单。",
            "\t[纳娜米]是的，水牢中还有很多我们不知道的隐秘。\n不过，至少这里他帮了我们大忙。",
            "\t[纳娜米]既然他要引导我们变强，\n与我们的目的不谋而合，\n那就顺势而为便是。",
            "\t[纳可]虽然有种被牵着走的感觉……\n但也没办法呢。",
            "\t[纳可]唔，不管他想干什么，\n我们只要提高警惕就好了吧。",
            "此战之后，打败秋兴的纳可姐妹，\n却并没有如何张扬，\n而是很快低调地潜伏起来。",
            "纳可潜心研习着领域之道，\n与神秘强者【峰】赐予的秘法相印证。",
            "既然这是属于她的机缘之地，\n她势必要在最短时间之内，再冲破一层领域！",
            {
                "type": "sleep",
                "time": 1000
            },
            "\t[纳可]没错……就是这样！",
            "领域【焰海霜天】晋升为第三重！\n将为你自动装备，可在装备栏查看详情。",
            {
                "type": "unloadEquip",
                "pos": 3
            },
            {
                "type": "setValue",
                "name": "item:I931",
                "value": "1"
            },
            {
                "type": "loadEquip",
                "id": "I931"
            },
            {
                "type": "sleep",
                "time": 1000
            },
            "转眼又是半年过去。\n当新一张的强榜榜单公布，\n纳可的名字，赫然出现在了第三位。",
            "整座水牢陷入了不一的情绪之中，\n仅仅两年多时间，旧有的秩序被打破，\n震惊甚至于混乱，在强者之间蔓延。",
            "强榜前三位的更迭，\n在这水牢之中绝对算是一件大事。\n但如今的纳可并没有心思去想这些。",
            "她知道，必须尽可能提升实力，\n面对未知的，可能出现的强敌——",
            "也就是这强榜的发布者，【蓝柒】。",
            {
                "type": "setCurtain",
                "time": 1000
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [620,154,620, 15,154,210149, 87,210149,154,154,210138,  0, 88],
    [620,154,154, 15,154,635, 85,636, 83,638,210138,1056,154],
    [154,1057,  0,621,1061,  0,1192,  0,1068, 22,210138,  0,572],
    [210144,210145,210145,210145,210145, 83,641, 16,210145,210145,210146,154, 15],
    [210160,210161,210161,210161,210161, 23,1062,587,210161,210161,210162,154,860],
    [210160,210169,210169,210169,210161,1064,621, 16,210161,210161,210162,154,637],
    [210168,210169,210169,210169,210169,585,1059,1061,210169,210169,210170, 22,858],
    [  0, 81,572, 81,154,  0, 22, 81, 21,  0,860, 22,  0],
    [572,154,154,572, 81,620,  0,579,1065,154,154,154,619],
    [154,154,619,154,154,154,154,1064,154,154,587,154,1065],
    [154,154, 15,154,154,584, 82, 60,579,154,  0,1058, 21],
    [572,154, 21, 60,1068,  0,154,154,1057,154,619,210180,1060],
    [  0, 81,1057,154,154,587,154,154,577,154,154,620,  0]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,210225,210225,210225,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,210225,210225,210225,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,210225,210225,210225,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176]
]
}