main.floors.MT280=
{
    "floorId": "MT280",
    "title": "280 层",
    "name": "280 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 500000,
    "defaultGround": 210137,
    "bgm": "18.mp3",
    "firstArrive": [
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 1000,
            "keep": true
        },
        "很快，纳可和纳娜米便有所收获。\n一面隐蔽的石壁上方，一丈见长的洞窟，\n成为了最好的栖身之所。",
        "此后，两人一边修炼，\n一边偶尔出去收集情报，\n打听外面水牢的动静。",
        "那竺虎，果然将两人的消息散布了出去。\n一时间，水牢强者的反应不一，\n或是惊叹，或是不屑，或是感到威胁而正视。",
        "可那传闻中的新人，\n却已经低调隐匿起来，安心修炼。",
        "本身天赋极高，又有秘法与四周的元素力量辅助，\n她们修为提升的速度极快。\n一晃眼，约半年的时间过去。",
        "纳可仅差一步便能达到天空级后期，\n而纳娜米也晋升为天空级中期。",
        "此时的她们，\n也终于有了在水牢诸多强者之中，\n自保的资本。",
        "情报显示，在这方水牢之中，\n时间流速被加快了五倍之多。\n外界此时，才过了短短一个月。",
        "\t[纳娜米]……如果不是那神秘强者峰所说确凿，\n简直无法相信，\n这世界上存在时间加速这种事情。",
        "\t[纳娜米]就连城主府里的藏书，\n没记错的话，都没有一星半点，\n关于这个的记载呢。",
        "\t[纳娜米]这岂不是说，这种手段还要远超领域级？",
        "\t[纳娜米]如果此次真能活着回去，\n恐怕以我们现在的进境，\n整个燕岗领都要吓一跳吧。",
        "\t[纳可]姐姐在想什么有的没的呢……\n这可不像你。\n当务之急是抓住机会好好修炼才对吧？",
        "\t[纳娜米]哼，小丫头什么时候这么成熟了。\n现在可还轮不到你教育姐姐。",
        {
            "type": "setCurtain",
            "time": 1000
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,5": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "12,10": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,  0,  0,  0,154,154,  0,  0,  0,210166,  0,210174,  0],
    [210145,210145,210145,210145,210145,210145,210145,210145,210145,210145,210145,210145,210145],
    [210161,210161,210161,210161,210161,210161,210161,210161,210155,210161,210161,210161,210161],
    [210161,210161,210161,210161,210161,210161,210151,210161,210163,210161,210161,210161,210161],
    [210169,210169,210169,210169,210169,210169,210159,210169,210169,210169,210169,210169,210169],
    [572,154,154,576,154,154, 88,154, 21,154,154,154,572],
    [ 81,210182,154,852, 81,  0,569, 82,  0,154,587,154, 81],
    [  0,572, 81,619,154,579,  0,154,619,857,  0,857, 60],
    [ 81,154,154, 21,154,154,154,154,154,154,852,154, 83],
    [572,154,586,  0, 23,154,637,  0, 21,860,  0,154,572],
    [154,154,210166,854,154,154,154,154,154,154, 22,858, 87],
    [154,154,154,585,856,620,853,587, 82,  0,569,154,154],
    [154,154,154,154,154,154,154,154,154,577,  0,1056,584]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176],
    [176,176,176,176,176,176,176,176,176,176,176,176,176]
]
}