main.floors.MT297=
{
    "floorId": "MT297",
    "title": "297 层",
    "name": "297 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 500000,
    "defaultGround": 210046,
    "bgm": "18.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "7,7": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,2": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "6,3": [
            "\t[蓝柒]……\n你们很强……\n但是，想要破局，还不够……",
            "\t[纳娜米]可以问一下吗？\n你看到我们来到这里，\n为什么会表现得那么失态。",
            "\t[蓝柒]这个问题，不是很想回答……\n可能……很快，你们就会明白的吧。\n可我已经帮不了你们什么了。",
            "\t[蓝柒]想要前进的话，就过去吧，\n愿伟大的不朽神灵保佑你们。",
            "\t[纳可]蓝柒小姐……走了吗。\n姐姐，这里似乎有一个疑点。",
            "\t[纳可]蓝柒小姐出现在这里，\n说明她……比我们更早发现，并到达了这里。\n可是一直没有继续前进。",
            "\t[纳可]难道什么不可言说的危险，\n在阻碍着她离开吗？\n……但我们，除了这条通道就没有别的选择了呢。",
            "\t[纳娜米]不错嘛，可可。\n遇到问题时，已经学会认真思考了，\n虽然这里怎样考虑，意义都不大的样子。",
            "\t[纳娜米]没办法的——我们不是那种无牵无挂的强者。\n我们在燕岗领，有家人，有朋友，\n不可能在这里待一辈子。",
            "\t[纳娜米]况且，即使前面有危险，\n可还有峰留下的后手。\n你说呢，可可……",
            "\t[纳可]也对……！\n那就听姐姐的好了，\n就让我看看，后面还有什么东西在等着！"
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {
        "6,4": [
            "\t[纳可]就是这里了吧，最后的出口。\n诶诶，蓝柒小姐？",
            "\t[蓝柒]…………\n你们怎么找来了这里……",
            "\t[纳娜米]多亏了你的提示呀，\n不然不可能这么顺利的。",
            "\t[蓝柒]不，不对。我之前的话，\n说的不是这个意思！",
            "蓝柒的神色有些许挣扎，\n身体瑟瑟抖动起来，\n似乎在惧怕着某种事物一般。",
            "\t[蓝柒]你们不能进去，危险——",
            "猛然之间，蓝发少女蓝柒，\n向纳可姐妹发起了袭击。\n霎时之间，便是三色光华亮起！",
            "\t[纳可]突然是要干什么啊，\n你这家伙——！",
            "\t[纳可]（天空级六阶，三重领域，\n她，她竟然……一直只动用其中一重。\n这才是她的真实实力吗，简直可怕！）"
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [210033,210033,210036,210041,210042,210049,210049,210049,210049,210049,210049,210049,210049],
    [210033,210033,210034,210049,210050,210057,210057,210057,210057,210057,210057,210057,210057],
    [210033,210036,210042,210057,210066,  0, 87,210006,210007,  0,210024,210025,210026],
    [210033,210034,210050,  0,210006,210007,1209,210014,210015,  0,210032,210033,210034],
    [210041,210042,210066,210001,210014,210015, 86,  0,210006,210007,210040,210041,210042],
    [210049,210049,642,210006,210007,638,  0,635,210014,210015,210048,210049,210050],
    [210065,210066,1085,210014,210015,  0,636,  0, 23,210001,210056,210057,210058],
    [  0,210001,621,639,1067,637,  0, 88,  0,1072,640,621,640],
    [210054,210054,210054,210054,210054,210067,621,210068,210054,210054,210067,210001,1079],
    [210153,210153,210153,210153,210153,210053,210054,210055,210153,210153,210053,210067,645],
    [210169,210169,210169,210169,210169,210152,210153,210154,210169,210169,210152,210053,210055],
    [210165,  0,  0,  0,  0,210168,210169,210170,  0,  0,210168,210152,210154],
    [  0,  0,210128,210130,  0,  0,  0,  0,210128,210130,  0,210168,210170]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [210137,210137,210137,210137,210137,  0,  0,  0,210137,210137,  0,  0,  0],
    [210137,210137,210137,210137,210137,210137,210137,210137,210137,210137,210137,  0,  0]
],
    "fg2map": [

]
}