main.floors.MT299=
{
    "floorId": "MT299",
    "title": "299 层",
    "name": "299 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 500000,
    "defaultGround": 210046,
    "bgm": "18.mp3",
    "firstArrive": [
        {
            "type": "moveHero",
            "steps": [
                "up:2"
            ]
        },
        "\t[溪月]恭喜恭喜，你们过关了。",
        "\t[纳可]过关？……\n你是，之前冰原上看到的那个女孩子。",
        "\t[纳娜米]这样也算我们过关了吗。\n我们可并没有在水牢中杀人。",
        "\t[溪月]过关的办法——并非只有自相残杀，\n如果你到达领域三重，\n这条通道自然会为你敞开。",
        "\t[溪月]是不是觉得很混乱呀？\n没关系，你们很快会明白的。",
        "\t[纳娜米]能告诉我们这里究竟是什么地方吗。",
        "\t[溪月]唔姆，这个嘛，当然没问题。\n这里是主人构建的结界，\n据说有百万年历史呢，可厉害啦。",
        "\t[纳可]等等，主人？\n（这里的主人，\n也就是那位领域级强者吧。）",
        "\t[溪月]你也知道，被关在这里的这些强者，\n虽然都被困住出不去的……",
        "\t[溪月]可只要他们不破坏这里的规矩，\n就能安全地活上许多年，\n令实力提升到惊人的程度。",
        "\t[纳可]可是……\n在这期间，你知道有多少人死去了吗。\n他们被迫自相残杀，只为争取出去的希望。",
        "\t[溪月]啊呀……真是单纯的孩子。\n虽然不忍心，可还是给你讲讲吧。",
        "\t[溪月]为培养强者，这些都是必然的牺牲。\n在几百名天空级的厮杀之中，\n一旦诞生了一名云霄级——",
        "\t[溪月]这云霄级强者的价值，\n可就要超过，嗯，我算算……\n反正不知道多少万天空级的总和！",
        "\t[纳可]……\n（每个生命的价值，\n真的要用实力来衡量吗？）",
        "\t[纳娜米]这些……先按下不提。\n所以，接下来我们要做什么？\n按照隐藏规则，我们已经获得了胜利。",
        "\t[溪月]是哒，你们已经拥有了接受传承的资格。\n接下来嘛，就让我带你们去见主人。",
        "\t[溪月]进入传承幻境，\n能得到多少领悟经验和修炼心得，\n就看你们自己啦。",
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    5
                ]
            ],
            "remove": true
        },
        "\t[纳可]我……无法接受。",
        "\t[纳娜米]……可可，我们跟上去吧。\n不管怎样，我们已经冲出了水牢。\n而且，有一些疑点也得以破解。",
        "\t[纳娜米]比如，如果这里是一处结界，\n那之前冰原上那些家伙到底是什么，\n也就能解释得通了。",
        "\t[纳可]我知道的，姐姐。\n曾经在家族秘境里，\n早就跟类似的存在打过交道了来着。",
        "\t[纳可]它们的确不是人类，而是……\n“结界”之中自然诞生的“灵”吗？",
        "\t[纳可]虽然比起之前遇到的强了很多，\n但还是不怎么聪明的样子。",
        "\t[纳娜米]是的，结界的主人通过那些“灵”，\n来考验造访者的实力，\n以此大致判断培养的价值。",
        "\t[纳娜米]只不过其他的疑点，\n可能还要收集更多的信息，才能解开。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,5": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        }
    },
    "changeFloor": {
        "6,9": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,2": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [210033,210033,210033,210033,210036,210041,210041,210041,210035,210033,210033,210033,210033],
    [210033,210033,210033,210033,210034,210081,210081,210081,210032,210033,210033,210033,210033],
    [210033,210033,210033,210033,210034,  0, 87,  0,210032,210033,210033,210033,210033],
    [210033,210033,210033,210033,210034,  0,  0,  0,210032,210033,210033,210033,210033],
    [210033,210033,210033,210033,210034,  0,  0,  0,210032,210033,210033,210033,210033],
    [210033,210033,210033,210033,210034,  0,1237,  0,210032,210033,210033,210033,210033],
    [210033,210033,210033,210033,210034,  0,  0,  0,210032,210033,210033,210033,210033],
    [210033,210033,210033,210033,210034,  0,  0,  0,210032,210033,210033,210033,210033],
    [210033,210033,210033,210033,210034,  0,  0,  0,210032,210033,210033,210033,210033],
    [210033,210033,210033,210033,210034,  0, 88,  0,210032,210033,210033,210033,210033],
    [210033,210033,210033,210033,210028,210025,210025,210025,210027,210033,210033,210033,210033],
    [210033,210033,210033,210033,210033,210033,210033,210033,210033,210033,210033,210033,210033],
    [210033,210033,210033,210033,210033,210033,210033,210033,210033,210033,210033,210033,210033]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}