main.floors.MT302=
{
    "floorId": "MT302",
    "title": "302 层",
    "name": "302 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "03.png",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 1000000,
    "defaultGround": 976,
    "bgm": "19.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {
        "8,1": [
            {
                "type": "setValue",
                "name": "item:blueKey",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "setValue",
                "name": "item:I1482",
                "operator": "+=",
                "value": "1"
            },
            "在门里发现了幸运箭头 - ∧和一把蓝钥匙！\n……说起来，开这个门来做什么的嘛。\n完全没什么意义的样子。"
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [160,572,160,160,160,160,160,160,160,160,160,160,160],
    [160, 81,160,584,1067, 21,160,160, 82, 60,160, 60,160],
    [160,572,160,160, 21,  0,160,160, 60, 82, 60, 82,160],
    [160, 81,160,160,160,1071,576,160,160, 60,160, 60,160],
    [160,  0,619,160, 22,  0,160, 21,160, 82,160, 82,160],
    [160, 21,  0,1069,  0,587,1073,  0, 81,579,  0,579,160],
    [160, 82,160,160,1071,160,160,160,160,1067,160, 82,160],
    [160,1073,577,160,572, 81,586,160, 22,  0,160, 47,160],
    [160, 60,  0,160, 81,160,  0,1069,  0, 22,1071,  0,160],
    [160,160,1067,160,572,160, 81,160,160,160, 82,160,160],
    [160,  0,579,160,1072,160,  0,619,1073,  0,572,  0,160],
    [160, 87,  0, 81,586,1087, 21,160,160, 59,  0, 88,160],
    [160,160,160,160,160,160,160,160,160,160,160,160,160]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}