main.floors.MT300=
{
    "floorId": "MT300",
    "title": "300 层",
    "name": "300 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 500000,
    "defaultGround": 210046,
    "bgm": "18.mp3",
    "firstArrive": [
        {
            "type": "moveHero",
            "time": 300,
            "steps": [
                "down:3"
            ]
        },
        "\t[？？？]小姑娘，能来到这里，\n勇气可嘉，胆识可嘉。",
        "\t[左阿]首先，自我介绍一下。\n原燕岗领混元门，少门主左阿。",
        "\t[纳娜米]……左阿？！\n您是……燕岗领史书上记载的那位前辈？",
        "\t[左阿]哈哈，不错。这么多年过去了，\n还有小辈记得我的名字，\n看来我还没被世人忘个干净。",
        "\t[纳可]（姐姐，我没怎么看过史书诶……\n他是谁呀？）",
        "\t[纳娜米]（左阿，距今约十万年历史的前辈高人……\n当年，混元门是燕岗领最大的民间势力，\n一时间雄霸一方。）",
        "\t[纳娜米]（那是拥有领域级强者坐镇的可怕势力！\n可因为这位前辈与其门主的冲突，\n导致混元门覆灭，高层死伤惨重。）",
        "\t[纳娜米]（本以为他已经陨落，\n没想到居然在这里出现……）",
        "\t[左阿]呵呵，在这里传音可瞒不住我的感知。\n当年，我出身于外门弟子之家，\n天资又是平平，不受人重视。",
        "\t[左阿]后来，觉醒了天生元神体，\n才突飞猛进，成为宗门高层。",
        "\t[左阿]但也因我的进步速度惊人，\n门主惧怕自己的地位动摇，\n竟不择手段要夺舍我。",
        "\t[纳娜米]……居然，还有这样一段往事。\n曾经的混元门门主，据说是领域级强者——",
        "\t[左阿]是啊，可那又如何。\n最终，我以云霄级巅峰之身，\n与门主同归于尽。",
        "\t[左阿]可在我死亡的瞬间，我迈入了领域级层次！\n最终便成了如今这样，\n以一个扭曲的姿态活在这结界里。",
        "\t[左阿]我无法离开结界，\n可对这座结界内的事物，\n有着绝对的掌控能力。",
        "\t[左阿]因此，我布下层层关卡，\n吸引过路的强者闯入，\n希望能有更多人获得资格，接受我的传承。",
        "\t[纳可]呼……",
        "\t[左阿]小姑娘，不知你们来自哪个势力？\n这方圆千万里的燕岗领，\n像你们这样的天才可也不多。",
        "\t[纳可]前辈，我们是来自燕岗城纳家的。\n纳家的历史，仅有万余年，\n前辈应该没有听过。",
        "\t[左阿]的确如此。\n恐怕在结界这十万年之中，\n外界也沧海桑田了吧。",
        "\t[左阿]呵呵，既然你们冒着巨大风险来到这里，\n又通过了我设下的重重关卡，\n自然是不能让你们白来一趟。",
        "\t[左阿]现在，开放你们的身心，\n进入传承幻境，接受我的传承吧。",
        "\t[纳娜米]谢过前辈。\n如果有什么需要我们做的，也请……",
        "\t[左阿]倒是没有什么事，\n要麻烦两个天空级的小家伙。\n就当是结个善缘吧。",
        "\t[左阿]我只负责送你们进入幻境，\n能有多少领悟，就看你们的造化了。\n切记，传承只赠有缘人……",
        {
            "type": "setCurtain",
            "color": [
                255,
                255,
                255,
                1
            ],
            "time": 1000,
            "keep": true
        },
        "随着左阿话音落下，\n纳可和纳娜米眼前浮现白光，\n似乎要将身体里的灵魂拉扯出来。",
        "白光持续了片刻，而后，在这片空间中央，\n形成了一个巨大的漩涡，\n隐约之间，旋涡中映出了彩色的光华。",
        "随着漩涡中的光线越来越亮，\n纳可终于能够看清周围的一切，\n她缓缓地睁开了眼睛。",
        {
            "type": "unfollow",
            "name": "nanami.png"
        },
        {
            "type": "changeFloor",
            "floorId": "MT301",
            "loc": [
                6,
                9
            ],
            "direction": "up"
        },
        "进入传承幻境，纳娜米离队。",
        {
            "type": "setValue",
            "name": "item:I821",
            "value": "0"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,8": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        },
        "8,7": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        }
    },
    "changeFloor": {
        "6,9": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "6,2": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [210033,210034,210057,210057,210057,210057,210057,210057,210057,210229,210057,210032,210033],
    [210033,210034,210065,210227,210065,210065,210065,210065,210065,210057,210065,210032,210033],
    [210033,210034,210022,210023,210004,  0, 88,  0,210004,210022,210023,210032,210033],
    [210033,210034,210030,210031,  0,  0,  0,  0,  0,210030,210031,210032,210033],
    [210033,210034,  0,210004,  0,210016,  0,210016,  0,210004,  0,210032,210033],
    [210033,210034,  0,  0,  0,  0,  0,  0,  0,  0,  0,210032,210033],
    [210033,210034,  0,  0,210016,  0,  0,  0,210016,  0,  0,210032,210033],
    [210033,210034,  0,  0,  0,  0,  0,  0,1239,  0,  0,210032,210033],
    [210033,210034,  0,  0,  0,  0,328,  0,  0,  0,  0,210032,210033],
    [210033,210034,  0,  0,  0,210016, 87,210016,  0,  0,  0,210032,210033],
    [210033,210034,210029,  0,210029,210265,210266,210265,210029,  0,210029,210032,210033],
    [210033,210028,210025,210025,210025,210025,210025,210025,210025,210025,210025,210027,210033],
    [210033,210033,210033,210033,210033,210033,210033,210033,210033,210033,210033,210033,210033]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,210008,  0,210008,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,210008,  0,  0,  0,210008,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,210008,  0,210008,  0,  0,  0,  0,  0],
    [  0,  0,210021,  0,210021,  0,  0,  0,210021,  0,210021,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}