main.floors.MT314=
{
    "floorId": "MT314",
    "title": "314 层",
    "name": "314 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "03.png",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 1000000,
    "defaultGround": 976,
    "bgm": "19.mp3",
    "firstArrive": [
        {
            "type": "changePos",
            "direction": "down"
        },
        "\t[纳可]似乎已经来到了幻境的深层，\n周围的荒兽实力明显提升了一个档次。",
        "\t[纳可]咦，前面那些是……？",
        "眼前是几块晶莹剔透的水晶，\n每一块都足足一人多高，颜色各异。",
        "在水晶之中，有特殊的气息在游走着。\n纳可似乎听到，脑海中有个声音在告诉她：\n快，接触它们。",
        "\t[纳可]原来如此，看来这里就是感悟之地了。\n这里的荒兽很强，我已经难以支撑……\n要尽快抵达那里才行。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,4": [
            {
                "type": "if",
                "condition": "(flag:314f==0)",
                "true": [
                    "\t[纳可]果然，这些水晶中，\n蕴含了左阿前辈的感悟！",
                    "\t[纳可]好强大的力量……\n可却夹杂着强烈的暴戾气息。\n左阿前辈，过去到底经历了什么事情？",
                    "\t[纳可]一定要静心凝神，\n把这缕暴戾的气息驱散掉。",
                    "纳可闭上了眼睛，\n开始专注领会水晶中的感悟。\n在去除杂质后，水晶蕴含的力量磅礴而精纯。",
                    "她感觉到自己的领悟越来越完善，\n每时每刻都在产生十分微妙的变化。",
                    "\t[纳可]……只是稍一接触，\n秘法之中，许多尚未融汇贯通的部分，\n一下就豁然开朗。",
                    "\t[纳可]这是峰大哥赠予我的秘法，\n它真正的潜力果然不同凡响。\n有些期待，不知道蜕变成功后会有多强呢。",
                    "领悟了新的秘法\r[aqua]【映星紫华】\r！\n请在装备栏中进行装备。",
                    {
                        "type": "setValue",
                        "name": "item:I922",
                        "operator": "+=",
                        "value": "1"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:314f",
                        "value": "1"
                    }
                ],
                "false": []
            }
        ],
        "9,4": [
            {
                "type": "if",
                "condition": "(flag:314f==0)",
                "true": [
                    "\t[纳可]果然，这些水晶中，\n蕴含了左阿前辈的感悟！",
                    "\t[纳可]好强大的力量……\n可却夹杂着强烈的暴戾气息。\n左阿前辈，过去到底经历了什么事情？",
                    "\t[纳可]一定要静心凝神，\n把这缕暴戾的气息驱散掉。",
                    "纳可闭上了眼睛，\n开始专注领会水晶中的感悟。\n在去除杂质后，水晶蕴含的力量磅礴而精纯。",
                    "她感觉到自己的领悟越来越完善，\n每时每刻都在产生十分微妙的变化。",
                    "\t[纳可]……只是稍一接触，\n秘法之中，许多尚未融汇贯通的部分，\n一下就豁然开朗。",
                    "\t[纳可]这是峰大哥赠予我的秘法，\n它真正的潜力果然不同凡响。\n有些期待，不知道蜕变成功后会有多强呢。",
                    "领悟了新的秘法\r[aqua]【映星紫华】\r！\n请在装备栏中进行装备。",
                    {
                        "type": "setValue",
                        "name": "item:I922",
                        "operator": "+=",
                        "value": "1"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:314f",
                        "value": "1"
                    }
                ],
                "false": []
            }
        ],
        "9,6": [
            {
                "type": "if",
                "condition": "(flag:314f==0)",
                "true": [
                    "\t[纳可]果然，这些水晶中，\n蕴含了左阿前辈的感悟！",
                    "\t[纳可]好强大的力量……\n可却夹杂着强烈的暴戾气息。\n左阿前辈，过去到底经历了什么事情？",
                    "\t[纳可]一定要静心凝神，\n把这缕暴戾的气息驱散掉。",
                    "纳可闭上了眼睛，\n开始专注领会水晶中的感悟。\n在去除杂质后，水晶蕴含的力量磅礴而精纯。",
                    "她感觉到自己的领悟越来越完善，\n每时每刻都在产生十分微妙的变化。",
                    "\t[纳可]……只是稍一接触，\n秘法之中，许多尚未融汇贯通的部分，\n一下就豁然开朗。",
                    "\t[纳可]这是峰大哥赠予我的秘法，\n它真正的潜力果然不同凡响。\n有些期待，不知道蜕变成功后会有多强呢。",
                    "领悟了新的秘法\r[aqua]【映星紫华】\r！\n请在装备栏中进行装备。",
                    {
                        "type": "setValue",
                        "name": "item:I922",
                        "operator": "+=",
                        "value": "1"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:314f",
                        "value": "1"
                    }
                ],
                "false": []
            }
        ]
    },
    "changeFloor": {
        "11,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "8,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [160,160,160,160,160,160,160,160,160,160,160,160,160],
    [160,160,160,160,160,160,635,160, 87,  0,160, 88,160],
    [160,160,160,160,577,1084,  0, 82,  0,619,1089,  0,160],
    [160,160,160,160,1081,160,  4,  4,  4,  4,  4, 81,160],
    [160,584,  0,160,  0,620,  4,240077,572,240078,  4,579,160],
    [160,  0,1079, 81,587,1085,  4,572,584, 60,1092,  0,160],
    [160, 82,160,160,160, 22, 83,585, 60,240079,  4, 21,160],
    [160, 22,1081,  0,160,  0,  4,  4,  4,  4,  4,1086,160],
    [160,1080,160,576, 81,579,1079, 60,  0, 60,1090, 21,160],
    [160,637,  0,160,160,160,160,160,160,160,160,585,160],
    [160,  0,577,160,636,  0,160, 21,1082,619, 81,1077,160],
    [160,621,  0, 81,  0,1081, 81, 22,160,585,160,637,160],
    [160,160,160,160,160,160,160,160,160,160,160,160,160]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,240069,  0,240070,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,240071,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}