main.floors.MT322=
{
    "floorId": "MT322",
    "title": "322 层",
    "name": "322 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 2000000,
    "defaultGround": 150654,
    "bgm": "20.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "10,11": [
            "\t[纳娜米]可可！你终于醒了！",
            "\t[纳娜米]你之前和地宫的怪物厮杀，\n消耗了太多体力，晕过去了。",
            "\t[纳可]诶，姐姐，……你说什么？",
            "\t[纳娜米]不过放心吧，这一片区域的怪物，\n刚才已经被姐姐清理干净了，\n姐姐会保护好你的。",
            "\t[纳可]怎么搞的，不对呀，\n刚刚我不是还在幻境里吗。",
            "\t[纳娜米]什么幻境啊？\n可可你不会脑袋被打坏了吧……",
            "\t[纳可]我很清醒！……\n地宫之行，已经是几年前的事情了！",
            "\t[纳可]姐姐你听我说，你不记得了吗。\n我们来了一处传承之地，\n先后通过了一片冰原和一座水牢。",
            "\t[纳可]之后经受幻境的考验，\n再之后，我就不知道怎么回事，\n出现在了这里。",
            "\t[纳娜米]可可你，你别吓姐姐。\n这里是燕岗城近郊，\n你刚才明明只是晕倒了呀。",
            "\t[纳可]姐姐，方才我晕倒的时候，\n你在……清理这片区域的怪物对吧。",
            "\t[纳娜米]是啊，你就不要担心了。\n有姐姐在，这些都是小问题……",
            "\t[纳可]你……你不是姐姐！\n如果你真的是姐姐，你不会在这种时候，\n把我丢在原地，独自行动。",
            "\t[纳可]难道不担心我会遭遇危险吗。\n姐姐她，一直都在危险的处境下保护着我，\n也从来不会做让我担心的事情。",
            "\t[纳娜米]………………",
            "纳可的话让纳娜米愣住了。\n见纳娜米半晌都没说话，\n她逐渐坚定了内心的判断。",
            "\t[纳可]你在听吗？我终于明白了，\n我现在看到的一切都是幻觉，\n更不是什么时间倒流。",
            "\t[纳可]你到底是谁？\n你是我内心的心魔！对不对！",
            "“啪嗒”一声，纳可睁大双眼，\n眼前的纳娜米，\n霎时间化作一缕黑烟，烟消云散。",
            {
                "type": "hide",
                "remove": true
            },
            "\t[纳可]原来如此，这样说来……",
            "\t[纳可]虽然眼前的事物无比真实，\n但这里仍旧是幻境，以假乱真的幻境！",
            "\t[纳可]刚才的心魔劫，并非幻境的终点么——\n或许直到现在，我才刚刚进入真正的幻境。",
            "\t[纳可]果然没有那么简单呢，\n连记忆中的内容都被模拟了出来，\n还蕴含着强大精神力的影响…稍有不慎，便会真假难辨。",
            "\t[纳可]可恶的幻境考验，冒充姐姐是吗。\n以为这种程度就会让人上当，怎么可能！",
            "\t[纳可]不管前面还有什么，都尽管来吧。"
        ]
    },
    "changeFloor": {
        "1,9": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [144,144,144,144,144,144,144,144,144,144,144,144,144],
    [144, 81,572, 81, 59,144,144,144, 60,  0,144,619,144],
    [144,572,144,144,572,144,144,619, 82, 60, 82,  0,144],
    [144, 81,144,144,144,144,144,144,144,144,144, 82,144],
    [144, 60,1093, 15,637,  0, 81, 21,144,635,144, 22,144],
    [144,579, 60,144,619,579,144,  0,1096,  0,1093,  0,144],
    [144, 82,144,144,144,144,144,144, 81,144,144, 82,144],
    [144,584,1095,  0,587,144,636,144,585, 81,641, 60,144],
    [144,144,144, 47,620,144,1095,144,144,144,144,1094,144],
    [144, 88,1090,  0, 21, 82,  0,1090,579,1094,  0,587,144],
    [144, 82,144,144,144,144,144,144,1095,144,144, 82,144],
    [144, 60, 60, 82,619, 82,619,144, 21,  0,875, 87,144],
    [144,144,144,144,144,144,144,144,144,144,144,144,144]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}