main.floors.MT326=
{
    "floorId": "MT326",
    "title": "326 层",
    "name": "326 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 2000000,
    "defaultGround": 917,
    "bgm": "20.mp3",
    "firstArrive": [
        "\t[纳可]…………\n穿过前面的那条通道后，\n眼前的景象居然突变成了这样。",
        "\t[纳可]所以这一次是——\n家族秘境，结界湖吗。",
        "\t[纳可]也就是在这里，\n纳鹰前辈传授了我很多修炼心得，\n令我一步步成长到现在。",
        "\t[纳可]这里也算是……\n对我影响很深的地方呢。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,10": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [151,151,151,151,151,151,151,151,151,151,151,151,621],
    [151, 87,151,584,619,151,151, 59, 81,572, 81, 59,151],
    [151,  0,1095,  0,587,151,151,151, 59,151, 59,  0,151],
    [151,151,151,151,1098,151,151,151,151,151,151, 81,151],
    [621,151,151,151,620,151,  0,636,151, 21, 22, 21,151],
    [151, 22,  0, 21,1096, 82,1097,  0,1097,619,584,151,151],
    [151,1099,151,151,151,151, 81,151,151,151,151,151,151],
    [151,619,585,151,637,1091,641,  0,151,151,1102, 23,151],
    [151, 21,  0,1098,  0,151,151,621,1099,620,  0,151,151],
    [151,151,151,151,1096,151,151,151,151, 81,151,151,151],
    [251374,251375,151,151,  0,1099,  0, 21,151, 50,151, 88,151],
    [251382,251383,151,151,587,151, 21,619,1098,  0,1095,621,151],
    [151,151,151,151,151,151,151,151,151,151,151,151,151]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}