main.floors.MT329=
{
    "floorId": "MT329",
    "title": "329 层",
    "name": "329 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 2000000,
    "defaultGround": 917,
    "bgm": "20.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "11,2": [
            "\t[纳鹰]做得不错，小丫头，多亏了你，\n这里的“灵”都变得安静了很多。",
            "\t[纳鹰]怎么样，我传授给你的东西，\n你都领悟透彻了吗？",
            "\t[纳可]纳鹰前辈……\n不，你不是前辈，\n我不需要向你说任何话！",
            "\t[纳鹰]哦呵呵，看来出了一点意外。\n小丫头，先不要着急。",
            "\t[纳鹰]你一次性接受了很多知识，\n必然会导致你的神识出现短暂的活跃期，\n甚至勾勒出许多不存在的幻象。",
            "\t[纳可]幻象？你，你在说什么啊……",
            "\t[纳鹰]听着，小丫头，\n抛却你脑海中那些杂乱的念头。\n我将自己关于领域的领悟传授给你，",
            "\t[纳鹰]这或许会影响到你之后的路。\n在未来，你甚至可能拥有领域——",
            "\t[纳可]我……我的领域？\n诶？怎么回事……",
            "纳可惊讶地张开手掌，\n自己的领域似乎不存在了一般，\n怎样都无法唤醒它。",
            "\t[纳可]你到底做了什么，\n为什么我的领域无法使用了！",
            "\t[纳鹰]小丫头，你不能再继续沉迷了。\n你或许中了强者魔咒，\n越是抵抗它，就只会陷得越深。",
            "\t[纳鹰]现在，放松你的身心，\n好好享受这一刻的感觉。\n放弃你的执念，好好感受这结界湖的宁静……",
            "\t[纳可]…………前辈，\n我……呜……",
            "\t[纳可]不，你……你骗不了我——\n前辈他，不会做出劝人放弃这样的事情！",
            "\t[纳可]纳鹰前辈他，为自己的自由毋宁死，\n什么时候放弃抵抗过！\n醒来……我一定要……醒来！",
            "\t[纳鹰]什么，不可能。\n一个小家伙，竟然有这么强的心性——",
            "\t[纳可]结束了，“前辈”，不需要伪装下去了。\n另外，我后来的确拥有了领域，而且是——\n领域三重！",
            {
                "type": "animate",
                "name": "chaoju",
                "loc": [
                    11,
                    2
                ]
            },
            {
                "type": "hide",
                "remove": true
            },
            "\t[纳可]呼……令内心迷失的力量，\n凝聚而生的心魔，\n唯有直指本心的信念才可破解！",
            "\t[纳可]重新唤起领域后，\n感觉对它的理解又深了一层。\n这样下去的话，不知道能否更进一步呢……",
            "\t[纳可]继续前进吧。"
        ]
    },
    "changeFloor": {
        "11,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [151,151,151,151,151,151,151,151,151,151,151,151,151],
    [151,151,151,572,151,151,151,251381,151, 21,151, 87,151],
    [151,251381, 59, 81,151,151,151,572, 81,635,  0,881,151],
    [151,572, 81, 59, 81,572, 81,  0,151,  0, 21,619,151],
    [151, 81,151,151,151,151,151,151,151,1101,151,151,151],
    [151,587, 60,151,151,151,636, 81,587,  0,151,585,151],
    [151,151, 21,151,151,151,1100,151,151,1098, 82,635,151],
    [151,151,1101, 82,636,635, 22,151,151,637,151,579,151],
    [151,151, 81,151,151,151, 81,151,151,151,151,1103,151],
    [151,251381,584,151,151,641,1100,  0,151, 22, 81, 60,151],
    [151,151,  0, 82,620,  0,151,1098,151,1091,151,1099,151],
    [151,151,151,587,  0,151,151,584,619, 47,1102, 88,151],
    [151,151,151,151,151,151,151,151,151,151,151,151,151]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,251364,  0,251373,  0,  0,  0,  0,  0],
    [  0,251373,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [251356,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,251373,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}