main.floors.MT321=
{
    "floorId": "MT321",
    "title": "321 层",
    "name": "321 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 2000000,
    "defaultGround": 150654,
    "bgm": "20.mp3",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 1000
        },
        {
            "type": "animate",
            "name": "wuyu",
            "loc": "hero"
        },
        "\t[纳可]结束了。\n幻境之行，应该就到此为止……",
        "\t[纳可]等等，骗人的吧，这，这里是——",
        "熟悉的景象尤在眼前，\n纳可的思绪仿佛回到了曾经那座地宫之中。",
        "她仔细打量着周围的环境，\n这里的每一寸土壤、\n每一根石柱都和那里完全相同。",
        "\t[纳可]在我十岁那年，曾经闯入的地宫？\n为什么离开幻境之后，却是到了这种地方，\n到底怎么回事——",
        "这座地宫里，有着纳可的记忆和梦魇，\n这些年来，她都未曾再踏足那片城郊半步。\n而现在，她居然又再次出现在了地宫里。",
        "\t[纳可]分明曾经……那地宫之中的所有东西，\n都已经被毁坏殆尽，只留下了一片废墟。",
        "\t[纳可]时间倒流了吗？\n可没有道理发生这样的事情。",
        "突然之间，\n纳可听到地底似乎有打斗声响传来，\n夹杂着令她十分熟悉的声音。",
        "\t[纳可]诶，……开玩笑的吧。\n\n是姐姐的声音？！",
        "\t[纳可]不行，必须马上赶过去，\n没错，声音来源于那个方向——",
        "系统提示：本区域为【第三幕】最终区，\nBoss损失极高，请尽可能保留更多生命值与之交战！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "1,9": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "6,6": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [1500,210019,144,144,150483,150484,150485,150486,150487,144,144,210019,1500],
    [210019,144,144,144,150491,150492,150493,150494,150495,144,144,144,210019],
    [144,144,639,144,144,144, 61,144,144,144,1008,144,144],
    [144,144,621,144,144,151342, 61,151342,144,144,1007,144,144],
    [144,144,640,144,150372,144, 84,144,150372,144, 23,144,144],
    [144,144, 84,210019,144,144, 84,144,144,210019, 84,144,144],
    [151341,151341, 24, 24, 24, 24, 88, 24, 24, 24, 24,151341,151341],
    [144,144,144, 86,144,144, 84,144,144, 86,144,144,144],
    [144,144,144, 86,144,144, 84,144,144, 86,144,144,144],
    [144, 87, 86, 86,144,144, 84,144,144, 86, 86,622,144],
    [144,144,144,144,144,144, 84,144,144,144,144,144,144],
    [150368,150369,150370,144,150387,150336,646,150339,150387,144,150368,150369,150370],
    [150376,150377,150378,144,144,144,642,144,144,144,150376,150377,150378]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,151325,  0,151325,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,150371,151333,  0,151333,150371,  0,  0,  0,  0],
    [  0,  0,  0,  0,150379,  0,  0,  0,150379,  0,  0,  0,  0],
    [151303,151303,  0,  0,  0,  0,  0,  0,  0,  0,  0,151303,151303],
    [151311,151311,  0,  0,  0,  0,  0,  0,  0,  0,  0,151311,151311],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,150356,150320,150321,150323,150356,  0,  0,  0,  0],
    [  0,  0,  0,  0,150364,150328,150329,150331,150364,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}