main.floors.MT332=
{
    "floorId": "MT332",
    "title": "332 层",
    "name": "332 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "02.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 2000000,
    "defaultGround": 906,
    "bgm": "20.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "10,5": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[纳可]这一次竟然……是父亲大人。",
                "\t[纳布]可可，你终于来了。\n看看这声律城外的生灵涂炭吧。",
                "\t[纳布]他们都是无辜的，\n只是想活着而已，就遭遇了灭顶之灾。\n为父……实在是有些于心不忍。",
                "\t[纳可]………………\n父亲大人的意思是？",
                "\t[纳布]我决定在这里赈灾，\n纳家将把所有难民收拢起来，\n给他们提供食物和庇护，",
                "\t[纳布]可可，这也是你一直以来想做的事情吧。\n让这些可怜人免受苦难。",
                "\t[纳可]是的……\n但是，对不起。\n在这里，我不会这样做的。",
                "\t[纳布]哦？为什么？\n这不是你一直坚持的事情吗？",
                "\t[纳可]我知道你不是父亲大人，\n但如果你想要听听我的理由……\n那么请便。",
                "\t[纳可]曾经的我，总是想要成为一个善良的人。\n……可很多时候，这样的品质有什么用呢？\n父亲大人他，一直担心我这一点。",
                "\t[纳可]他担心我的心性，\n在这个力量为尊的世界，\n一不小心就会因小失大，吃了大亏。",
                "\t[纳可]所以，他从不会鼓励我去“发善心”，\n而是一直劝导和教育我。",
                "\t[纳可]纵然如此，我也没少让他费心呢……\n我和父亲大人，\n我们都有各自的坚持，你明白了吗？",
                "\t[纳布]……所以，这就是你的答案吗。\n很好，小丫头。你过关了。",
                {
                    "type": "hide",
                    "remove": true
                },
                "\t[纳可]虽然我更加憧憬平静的生活……\n但如果，我的力量能够保护自己想要保护的人，\n做自己乐意做的事情。",
                "\t[纳可]为此，偶尔充当一个冷血的强者角色，\n又如何呢……"
            ]
        }
    },
    "changeFloor": {
        "11,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [918,918,918,918,918,918,918,918,918,918,918,918,918],
    [918,918,619,918,619,918,  0,619,918,918,918, 87,918],
    [918,918, 82,918, 82,918, 82,918,918,638,  0, 22,918],
    [918,584,  0,1106,  0,585,  0,918,918,  0,640,  0,918],
    [918,637,585,918, 60,579, 60, 16, 15,641,  0,635,918],
    [918,1091,918,918,918, 82,918,918,918,918,880,918,918],
    [918,  0, 21,918,918,637,  0,918,918,1103,  0,1107,918],
    [918,587,619,918,918,1106, 60,918,918, 47,918, 22,918],
    [918,  0,1107,636,918,619,918,918, 15, 60, 83,  0,918],
    [918,918,  0,918,918,1102,918,918, 16,918,918,1104,918],
    [918,918, 21,1106, 81,620,584,1105,  0,621,918,619,918],
    [918,918,918,585,918,  0,579,918, 21,1106, 15, 88,918],
    [918,918,918,918,918,918,918,918,918,918,918,918,918]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,50013,50014,50015,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,50021,50022,50023,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,50029,50030,50031,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}