main.floors.MT337=
{
    "floorId": "MT337",
    "title": "337 层",
    "name": "337 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 2000000,
    "defaultGround": 970,
    "bgm": "20.mp3",
    "firstArrive": [
        "系统提示：本层右上的【十连扭蛋机】，\n为可装备的【器械】。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "9,2": [
            "\t[？？？]我不甘心！不甘心！\n本天才英明一世，历尽坎坷闯过天才战，\n却栽在了区区一场试炼任务当中！",
            "\t[纳可]……好强烈的怨念，\n而且是之前没有见过的人。",
            "\t[纳可]难道是……这艘飞船的主人吗？\n也就是，那位陨落在这里的，\n天外来客。",
            "\t[纳可]原来如此，就在我被封锁在飞船内的那段时间，\n他的怨念便已经附着在我内心深处，\n许久以来，我竟然未曾察觉……",
            "\t[？？？]杀，杀了你们！\n敢挡本天才的强者路，\n不过是一群愚昧的土著罢了——",
            "\t[纳可]看来……你真的是很不甘心呢。",
            "\t[纳可]被你称之为土著的，\n那些死在你手上的血洛世界居民，\n他们又何尝不想活着？",
            "\t[纳可]你的降临，对于他们而言，\n无异于灭顶之灾。\n可如今，你为自己的所作所为忏悔过吗？",
            "\t[？？？]一派胡言！你知不知道你在说些什么，\n这不一样，我和他们不一样，\n你竟然把本天才和土著相提并论，简直太可笑了！",
            "\t[？？？]天才便是天才，\n本大爷一路刀山火海闯过来，\n有何道理与他们这些凡夫俗子陪葬——",
            "\t[纳可]你说得不对！\n既然你选择这条路，选择视生命为草芥，\n即使你成为那草芥的一部分，也要自己承担。",
            "\t[纳可]你完全可以放走你遇到的血洛世界居民，\n可你是怎么做的？你还算是天才吗？\n只是一个披着天才皮囊的恶魔而已！",
            "\t[纳可]即便如此，你若是看淡生死，仍然可称为天才。\n你觉得，真正的天才面临陨落，\n会像你一样歇斯底里吗？",
            "\t[？？？]你……我……\n谔谔啊啊啊啊……",
            "天外来客，突然间不再说话，\n似是彻底冷静下来。\n他的眼神变得平静无波。",
            "突然之间，周遭散溢的怨念逐渐散去，\n天外来客嗤笑出声。\n接着，他没有丝毫犹豫，一掌猛击自己的眉心。",
            "\t[纳可]……都结束了。\n睡吧。",
            {
                "type": "hide",
                "remove": true
            },
            "\t[纳可]在峰大哥留下的精神印记影响下，\n我的这番话，也似乎被带上了精神力的加持，\n影响并消弭着，这位天外来客残存的怨恨…",
            "\t[纳可]峰大哥，你又帮了我一次呢。\n谢谢你。",
            "\t[纳可]如果某一天，这道怨念突然爆发，\n也许会是不小的隐患。\n现在，也算是完美地解决了问题。",
            "\t[纳可]唔，他的身后似乎留下来什么东西。\n……这古怪的机器是什么？\n竟然暗藏在他的生命本源之内，恐怕不简单呢。",
            "\t[纳可]比起现实飞船中得到的那个，\n这或许才是真正的……天外神兵吧？"
        ]
    },
    "changeFloor": {
        "6,10": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [156,190360,190361,156,156,190698,190699,190700,156,156,190360,190361,156],
    [156,190368,190369,619,156,190706,190707,190708,978,  0,190368,190369,156],
    [156, 82,619, 82,619,190714,190715,190716,  0,882,1110, 82,156],
    [156,619,156,156,156,156,156,156,156,1111,156, 22,156],
    [156, 82,619,156,635,156, 21,1091,619,  0,156,  0,156],
    [156,156, 82,156,  0,1109,  0,156,156,637,1108,585,156],
    [156,156,619,156, 60,156,1109, 82,619,  0,156,572,156],
    [156,156, 82,156,156,156, 81,156,156, 81,156, 82,156],
    [156, 21,  0,156,636,156,572,156,156, 47,1110,641,156],
    [156,  0,572,156,  0,1108,  0,156,156, 81,156,  0,156],
    [156,156,1108,156, 21,156, 88, 60,156,  0,1091, 60,156],
    [156,584,  0,1091, 21, 81, 60,  0, 82,587,156, 87,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}