main.floors.MT346=
{
    "floorId": "MT346",
    "title": "346 层",
    "name": "346 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "03.png",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 2000000,
    "defaultGround": 906,
    "bgm": "20.mp3",
    "firstArrive": [
        "随着最后一重幻境的破碎，\n纳可感觉坠入了一片黑暗，\n似有无数狰狞的鬼怪朝她扑来，将她淹没。",
        "她咬着牙，闭上眼睛，\n拼尽最后一丝意志力，\n抵抗着这些残存心魔的侵袭。",
        "终于，一束亮光照入，亮丽的彩色浮现，\n她蓦然睁开双眼。\n眼前一切都变得清晰起来。",
        {
            "type": "setCurtain",
            "time": 1000
        },
        "\t[溪月]欢迎来到，幻境的最深层——\n幻境核心。",
        "\t[溪月]不要东张西望啦，你找不到我的。\n我在你的识海深处，通过意念来传递讯息。",
        "\t[纳可]溪月小姐，为什么你会在这里？\n还有，这幻境到底是怎么回事，\n左阿前辈他——",
        "\t[溪月]在这里就不要再叫那个家伙前辈了，呸。\n他此刻正试图抹去你身上的灵魂印记，\n无暇他顾，才让我找到机会溜了进来。",
        "\t[纳可]诶？",
        "\t[溪月]长话短说吧——\n也无所谓，意识传讯是很快的，\n不会耽误你多少时间。",
        "\t[溪月]首先，还记得水牢中的“强榜”吗？\n嗯，我是说，那个空缺着的第一位。",
        "\t[纳可]……为什么突然提起这个。\n情报说，从数百年之前开始，\n第一的位子，就一直被蓝柒留空着。",
        "\t[溪月]咯咯……当然是空着，\n因为第一名已经离开了水牢，\n并投靠了结界的主人。",
        "\t[溪月]说是投靠，可也不过是潜伏在左阿身边，\n正好又对他有点利用价值，\n便被他所接纳了——同时，也得知了大量的情报。",
        "\t[纳可]溪月小姐的意思是……\n\n强榜曾经的第一位……是你？！",
        "\t[溪月]聪明聪明！\n果然，和聪明的孩子说话就是享受啊。",
        "\t[溪月]虽然小蓝也和你一样聪明，\n可惜她不喜欢讲话的。\n以前在水牢里的时候，她……啊，跑题了。",
        "\t[纳可]是说【蓝柒】吗。\n……在我离开水牢时，\n她曾对我说过一些让人半懂不懂的话。",
        "\t[溪月]啊咧，我大概能猜出那话是什么。\n之所以她不把话说明白，\n不是不想，而是不能。",
        "\t[溪月]整座水牢，都在那【左阿】的监视之中。\n在传达一些消息时，一旦稍有不慎，\n被他所怀疑，便可能遭致抹杀！",
        "\t[纳可]这样的吗。\n我真的不喜欢翻史书呢……也不了解真实情况。\n左阿，到底是一个什么样的人？",
        "\t[溪月]他是领域级强者，是这里的主人，\n也是一个不折不扣的……疯子。",
        "\t[纳可]那，那些珍贵的传承……难不成？",
        "\t[溪月]都是假象，看似他是筛选天才接受传承，\n而实际上，他只不过是想借此重塑自己的身体，\n锤炼出能够容纳他灵魂的“容器”。",
        "\t[溪月]据我所知，水牢中的强者，\n无论通过何种途径离开那里，\n最后几乎无一例外，都成为了那容器的一部分。",
        "\t[纳可]什么——！",
        "\t[溪月]成为容器，最低标准便是……\n鲜活的生命，天空级高阶实力。\n如果你拥有三重领域，毫无疑问也达到了这一点。",
        "\t[溪月]水牢的出口，会在你达到标准的时候，\n召唤强者们走出去——\n然后顺理成章，变成容器的一部分。",
        "\t[纳可]那之前介绍规则的时候，\n你说过要杀死其他所有强者，\n是怎么回事。",
        "\t[溪月]那只是个幌子而已……\n生死厮杀，永远是强者的催化剂。\n历史上并没有人击杀过水牢中所有强者。",
        "\t[溪月]因为……误闯这片秘境的外来者，\n会几乎源源不断地补充进来。\n强者们的归宿只有被别人杀死，老死，或是成为容器。",
        "恍惚之际，纳可脑海中，\n回想起峰曾经说过的话。\n他的声音仿佛仍在耳畔隆隆作响。",
        "“生死厮杀，永远是强者的催化剂。”\n“只要万千弱者中诞生一个强者，\n对族群的价值便远大于万千弱者。”",
        "\t[纳可]……怎么这样。\n你让我怎么相信这些，\n这种事情简直是疯狂！",
        "\t[溪月]咯咯……更疯狂的还在后面。\n小姑娘这种反应，\n还是遇过的疯子太少了呢。",
        "\t[溪月]接下来，我就把自己知道的一切情报，\n用真实的意念灌输给你，无需担心弄虚作假。\n希望你看完后，不会被这种人动摇道心呀。",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 1000,
            "keep": true
        },
        "左阿，一个微不足道的小人物。\n强手如云的混元门之中，\n资质平平的他不受重视，被同门排挤，受尽白眼。",
        "在这个充满了竞争、杀伐的世界里，\n弱者，永远只能活在最底层。\n他拼命努力，无奈修炼天赋太差，无法改变什么。",
        "直到有一次，他遇上了自己的天才师兄弟。\n两人相谈甚欢，一时高兴，就多喝了几杯。\n这一醉，就再也醒不过来。",
        "在众人眼中，他放弃了自己的抱负，\n整日呼朋引伴，饮酒作乐。\n久而久之，也结交了几个贵人。",
        "他终于能够在同门面前抬得起头来，\n可任谁都没想到的是，\n这只是他庞大计划的第一步。",
        "那一日，宗门高层在荒兽森林里，\n发现了他同门师兄弟的尸骸。",
        "尸骸旁边是几头天空级的凶兽。\n他显然刚经历了一番激烈的厮杀，\n浑身浴血，脸上也沾染着泥土与灰尘。",
        "在那之后左阿变得郁郁寡欢，\n似乎师兄弟的死，对他影响很大。\n他不再饮酒作乐，而是整日沉浸在练功房中修炼。",
        "他的修为，自那之后，开始节节攀升。\n众人以为他受到刺激突然开窍了，\n纷纷对他刮目相看。",
        "门主更是大喜过望，\n甚至当即封他做少门主，\n也就是未来混元门的接班人！",
        "\t[溪月]嗯。就是这样。\n这本该是一个励志的故事耶……\n但是，小姑娘，你发现疑点了吗？",
        "\t[纳可]站在更高的视角上……\n潜力有限的人，是很难突然开窍的吧。\n那位师兄弟的死因，有些蹊跷——",
        "\t[溪月]正确！后来，\n混元门的门主也发现了事情的不对劲之处，\n于是下令仔细追查这件事情——",
        "在左阿身居高位之后，\n他的性情变得更加肆无忌惮，毫不掩饰。\n由于德不配位，仇视他的人越来越多。",
        "纸是包不住火的——\n那位师兄弟陨落的事情被重新提起，\n许多门人向左阿发难，分析事情的种种蹊跷之处。",
        "门主乃是领域级强者，\n一般人无法堪破的假象，\n在他眼中却是无所遁形，很快线索便被不断收集。",
        "当真相大白，所有人醒悟过来，\n那位同门师兄弟果真是被左阿所杀，\n其天生元神体也为左阿所夺舍时，为时已晚。",
        "众人惊恐地发现，左阿利用少门主的职务之便，\n多年之内，一直待在镇门之宝——\n【时光殿】中修炼。",
        "其修为早已超越表面上不知何几！\n当虚伪的面具被撕开时，\n不过百余年时间，他竟已修成云霄级九阶！",
        "左阿冷眼扫视众人，\n心狠手辣的他，主动出击，\n门主欲要阻拦，却发现眼前的左阿不过是一个幻身。",
        "而他的真身，早已以少门主的身份，\n畅通无阻地前往一个又一个山门，\n展开了一场一边倒的屠杀。",
        "他是云霄级九阶，又夺舍了天生元神体，\n那些大地、天空级的弟子，\n甚至连云霄级的宗门长老都毫无还手之力！",
        "整个混元门，只剩下门主能与之一战。\n而那位门主，没有丝毫犹豫，\n以自身生命为代价，与左阿拼死一搏。",
        "\t[纳可]………………\n但即使如此，混元门的损失依旧极为惨重。\n这一幕落在其他几派眼中，引得轩然大波。",
        "\t[纳可]门主身死。\n左阿肉体被毁，却临阵突破，灵魂得以远遁而去。\n镇门之宝【时光殿】，也被他带走。",
        "\t[纳可]不久，混元门被众多势力瓜分。\n曾经不可一世的最庞大势力，\n就此消失在燕岗领的历史长河之中。",
        "\t[溪月]后面的这一段，你已经知道啦。\n就不需要再重复一遍了。\n事情，就是如此。",
        {
            "type": "sleep",
            "time": 1000
        },
        "\t[溪月]混元门门主的家族，本来是燕岗领的名门望族。\n在那场惊天动地的战争过后，\n混元门消失，家族力量折损无数，家道中落。",
        "\t[溪月]那位门主是一个值得尊敬的人，\n他以一己之力令整个门派免于被灭满门的下场。\n另外，他也是——我，还有蓝柒，我们的先祖。",
        "\t[纳可]诶——……这样吗。\n这样的感觉真的很不好受呢。\n……听着别人轻描淡写地讲述自己沉重的事情。",
        "\t[溪月]啊，没关系的。\n我现在很开心，因为看到了希望——\n能够改写这段命运的希望。",
        "\t[溪月]我们家族世代隐忍，足足十万年之久过去，\n期间不间断地搜集情报，\n打听到了那左阿的下落，以及他这些年的所作所为。",
        "\t[溪月]我与蓝柒二人，便是在这等条件下，\n悄然伪装成寻常的冒险者，\n潜伏在左阿的身侧，并……伺机而动！",
        "\t[溪月]蓝柒她在水牢中的所为，不是维护自己的地位，\n而是在保护水牢内的强者，\n避免他们变得更强，达到成为“容器”的标准。",
        "\t[纳可]呼……真是曲折的故事……\n你们在等待吗，\n等待能够逆转乾坤的力量出现。",
        "\t[溪月]是呀。我知道我们的计划很危险，\n甚至可以说没有任何把握。\n因为现在的左阿，已经快要恢复曾经的状态。",
        "\t[溪月]这是杀死他的唯一机会，我们只能孤注一掷。\n哪怕付出牺牲，也都认了。我和蓝柒——\n我们的家族已等了十万年，不想继续等待下去了。",
        {
            "type": "setCurtain",
            "time": 1000
        },
        "\t[纳可]我相信你。如果是这一回事，\n之前那些恐怖的幻境，也能解释得通了……\n等等，这样说来姐姐岂不是很危险！",
        "\t[溪月]唔唔，不用担心，你的姐姐暂时没事。\n她才刚刚开始破解第一重幻境。",
        "\t[溪月]只要赶在她沉沦在死亡幻境之前，摧毁这里，\n她就不会有什么事。\n我会尽我所能，保护你姐姐完好无缺地离开。",
        "\t[纳可]既然如此——\n我也会全力以赴的。\n那么，溪月小姐，合作愉快。",
        "\t[溪月]……谢谢，拜托了……",
        "系统提示：相同点数的传送阵可以互相传送。\n请\r[gold]登上最后的决战之地，击败左阿\r！"
    ],
    "eachArrive": [],
    "parallelDo": "var lastTime = core.getFlag('lastTime', 0);\n\nif (Date.now() - lastTime > 20) {\n\tvar image = core.material.images.images['03.png'];\n\tvar width = 416,\n\t\theight = 416;\n\n\tcore.canvas.bg.translate(width / 2, height / 2);\n\tcore.canvas.bg.rotate(Math.PI / 180 / 6);\n\tcore.canvas.bg.translate(-width / 2, -height / 2);\n\tcore.canvas.bg.drawImage(image, -288, -96);\n\n\tcore.setFlag('lastTime', Date.now());\n\n\tvar rotateTime = core.getFlag('rotateTime', 0);\n\trotateTime += 1;\n\tif (rotateTime >= 6 * 180) {\n\t\trotateTime -= 6 * 180;\n\t}\n\tcore.setFlag('rotateTime', rotateTime);\n}",
    "events": {},
    "changeFloor": {
        "1,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,1": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "6,9": {
            "floorId": "MT349",
            "loc": [
                3,
                1
            ]
        },
        "9,4": {
            "floorId": "MT347",
            "loc": [
                4,
                1
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [1035,1035,1035,1035,1035,1035,1035,1035,1035,1035,1035,1035,1035],
    [1035, 88,  0,621,1230,638,622, 47,1230,621,  0, 87,1035],
    [1035,1035,1035,1035,1035,1035,1035,1035,1035,1035,1035,1035,1035],
    [1035,1035,1035,1035,1035,1035,1035,1035,1035,1035,1035,1035,1035],
    [1035,640,1035,1035,619, 15, 60,587,1035,991,1035,639,1035],
    [1035,620,1233,619,  0,1035,1236, 60, 15,620, 16,1234,1035],
    [1035, 16,1035, 83,1035,1035, 81,1035,1035, 83,1035,1007,1035],
    [1035,619,1035,587,1006,1234,621,1035,619,1232,587,1233,1035],
    [1035,639,1235,  0,587,1035, 83,1232,  0,1035,  0,640,1035],
    [1035,1035,1035,1035,1035,1035,904,1035,1035,1035,1035,1035,1035],
    [  4,  4,  4,  4,1035,1035,1035,1035,1035,  4,  4,  4,  4],
    [  4,621,  0,  4,  4,  4,  4,  4,  4,  4,  0,621,  4],
    [  4,  4,  4,  4,622,  0,  4,  0,622,  4,  4,  4,  4]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}