main.floors.MT345=
{
    "floorId": "MT345",
    "title": "345 层",
    "name": "345 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 2000000,
    "defaultGround": 973,
    "bgm": "20.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "1,2": [
            "\t[纳可]峰……峰大哥。",
            "\t[峰]可可。\n我很惊讶，你能够连闯四重幻境，\n来到这里。不过，就到此为止了。",
            "\t[纳可]诶……？",
            "\t[峰]事实上，这些年以来，\n我看着你接连闯过冰原、水牢、四重幻境。\n我一直在注视着你的成长。",
            "\t[峰]你的表现让我很满意，\n所以你有资格——\n成为我的灵魂奴仆。",
            "\t[纳可]…………！\n峰大哥你，你在说什么？\n我……我听不明白。",
            "\t[峰]话说到这里，还没有明白吗？\n事实上，我很早就在留意你，\n留意你身上的某种特质。",
            "\t[峰]我知道百家与十三斧的一切计划，\n因此借着他们来接近你，\n并在你心中，悄无声息留下深刻的烙印。",
            "\t[纳可]……唔……这样吗？\n让我来到这一处结界探险，\n也是计划的一部分？",
            "\t[峰]力量会带来盲目的信任。\n你对我的话深信不疑，于是来到了这里。\n之后的一切，都是我一步一步策划。",
            "\t[峰]待得你的实力与天赋，\n被培养达到我想要的程度——\n也就是现在，就到收网的时间了。",
            "\t[纳可]…………\n（什么……）",
            "\t[纳可]……不是这样的，不对。\n以峰大哥你的实力，\n根本没有必要禅精竭虑做这么多功课吧？",
            "\t[峰]的确，我可以直接灵魂控制你，\n可那样，就达不到我想要的效果了。",
            "\t[峰]你的灵魂如今深陷这片幻境，\n乃至于连记忆都在我的掌控之中。\n在这里缔结灵魂契约，我便能无条件掌控你的一切。",
            "\t[峰]来吧，放开你的身心。\n我会庇护你，让你成为强者，\n追随我去遍历广袤的世界。",
            "\t[纳可]（真是可怕——\n但是，或许……有破绽。\n这个时候能做到的，唯有坚定自己的内心。）",
            "\t[纳可]如果我说，不呢？\n你在说谎——各种意义上的。",
            "\t[纳可]以峰大哥的眼界，\n就连不朽神殿中的“神灵”，都不看在眼里，\n培养我成为灵魂奴仆？有什么必要吗？",
            "\t[峰]……怎么可能？！",
            "\t[纳可]很好，这个反应是被我说中了呢。\n谎言被拆穿的感觉……如何？",
            "\t[纳可]你以为这种真实的强者压迫感，\n就能瞒得过别人吗？\n编造的理由未免太幼稚了吧？",
            "\t[峰]………………",
            {
                "type": "animate",
                "name": "an",
                "loc": [
                    1,
                    2
                ]
            },
            {
                "type": "setBlock",
                "number": "E1212",
                "loc": [
                    [
                        1,
                        2
                    ]
                ]
            },
            "\t[心魔之主]简直是一派胡言！\n你遇到的那个小子，不过云霄级九阶！\n怎么会与那等神灵扯上关系！",
            "\t[纳可]诶诶？\n意外得到了之前不知道的消息呢。\n这可要多谢你。",
            "\t[纳可]如今的我依旧看不透，\n那一天峰大哥对十三斧出手时的境界。",
            "\t[纳可]不过，即使见过城主和左阿前辈，\n这两位领域级高手，站在他们面前，\n给人的感觉也没有峰那样的高深莫测……",
            "\t[纳可]所以，在见过真正的强者眼界之后，\n仅仅你这番话，是不会让我动摇的哦。",
            "\t[心魔之主]该死，这样都没能让你放松警惕，\n区区一个小丫头，心境倒是稳得可怕。",
            "\t[心魔之主]你有资格知道我的身份，\n我乃——心魔之主。\n是你内心一切恐惧的事物、一切负面情绪的源头。",
            "\t[纳可]一切的负面情绪？\n就只是这样吗，凭你展露的手段，\n恐怕还不足以让我倒下。",
            "\t[心魔之主]哼，纵然这幻境能激发你的负面情绪，\n也无法读取你内心最深层次的想法，\n就这样留下了破绽！",
            "\t[心魔之主]那好，既然你如此执迷不悟，\n那就只能催动，我最后的手段了。",
            "\t[心魔之主]——强行抹杀！\n汇集心魔的一切力量，\n誓要令你……彻底沉眠！"
        ],
        "1,1": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                {
                    "type": "if",
                    "condition": "(flag:346f==0)",
                    "true": [
                        {
                            "type": "setCurtain",
                            "color": [
                                0,
                                0,
                                0,
                                1
                            ],
                            "time": 1000,
                            "keep": true
                        },
                        {
                            "type": "setValue",
                            "name": "flag:346f",
                            "value": "1"
                        },
                        {
                            "type": "changeFloor",
                            "floorId": "MT346",
                            "loc": [
                                1,
                                1
                            ],
                            "direction": "right"
                        }
                    ],
                    "false": [
                        {
                            "type": "changeFloor",
                            "floorId": "MT346",
                            "loc": [
                                1,
                                1
                            ],
                            "direction": "right"
                        }
                    ]
                }
            ]
        }
    },
    "changeFloor": {
        "6,6": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "1,2": [
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 1000,
                "keep": true
            },
            "\t[纳可]呼……呼啊……\n\n我……我赢了……吗。",
            "\t[纳可]刚才与那心魔之主交谈，\n得知被编造的“真相”那一刻，\n真的差一点就要崩溃了……",
            "\t[纳可]虽然峰大哥不会那样做，\n可我与他之间的实力差距太大了……\n即使面对的只是他虚假的幻象，压力也自然而生。",
            "\t[纳可]想想都后怕，一旦我的道心出现一丝裂痕，\n恐怕顷刻之间，便会被幻境和心魔抹杀，\n意识就此消失仅剩躯壳。",
            "\t[纳可]这还是，在那道灵魂印记的庇护之下，\n绝大多数的精神力冲击都被挡了下来。",
            "\t[纳可]如果换做一般的天空级，\n甚至是云霄级，\n根本不可能经受冲击活下来的吧？",
            "\t[纳可]怎么会这样。\n左阿前辈留下的传承到底是什么……\n这般强大真实的幻境，难道想杀了我吗？",
            "纳可心中惊惧交加，\n她告诫自己要保持冷静，\n但意识仿佛像烧红的烙铁，嗡嗡作响。",
            "她想了很多事情，\n想到自己的姐姐如果面临与自己相同的困境，\n没有印记庇护，她能活下来吗？",
            "随时都可能死亡的恐惧，\n对姐姐安危的担忧，\n缠绕着少女的内心，几乎让人发疯。",
            "在纳可绝望之际，\n耳边突然响起清脆悦耳的少女声音，\n如同春风拂过。",
            "\t[溪月]喂喂。\n可爱的小姑娘，听得见吗？\n是我呀，溪月。",
            "\t[溪月]如果你听得见，请继续往前走。\n跟随着我的指引，去往幻境的核心之处。",
            "\t[溪月]你的确是我要找的破局之人，\n现在，该让你知道真相啦。",
            "那声音仿佛有着一丝灵性的魔力，\n扫去了纳可内心中的恐慌迷茫。",
            "纳可的直觉告诉她，\n对方并没有想要害她的打算。",
            "\t[纳可]是你……溪月小姐，谢谢你。\n我感觉很清醒了……\n继续向前是吗，我明白了。",
            {
                "type": "setCurtain",
                "time": 1000
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  4,  4,  4,173,173,173,173,173,173,173,173,173,173],
    [  4, 87,  4, 21, 82,619,  0,641,173,644,173,643,173],
    [173,883,173,1229,173,173,1231,173,173,1232,173,1233,173],
    [173,  0,173, 60,173,173, 47,  0,173,579, 81,579,173],
    [173,587,1111,  0, 21,173,  0, 50,173,1230, 60,1113,173],
    [173,173,173,173,1228,173,173,173,173,173,173, 81,173],
    [173,173,173,173, 47,1231, 88,173,173,173,173, 22,173],
    [173,173,173,173,173,173, 60,1228, 21,173,173,1111,173],
    [173,  0,587,173,1113, 81,  0,173, 60,173,173,619,173],
    [173,636,620, 81, 60,173,619,173,  0,572, 81,  0,173],
    [173,173,1229,173,173,173,173,173,1228,173,173,1234,173],
    [173, 21, 22,1230,619,1113,585,  0, 21,173,173,638,173],
    [173,173,173,173,173,173,173,173,173,173,173,173,173]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,153,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

],
    "color": [
        0,
        0,
        0,
        0.2
    ],
    "weather": [
        "fog",
        3
    ]
}