main.floors.MT351=
{
    "floorId": "MT351",
    "title": "351 层",
    "name": "351 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 5000000,
    "defaultGround": 210137,
    "bgm": "18.mp3",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 1000
        },
        "残留的水元素结界仍在水牢中流淌，\n但那若隐若现的窒息感已然消散。\n十几道身影，正围站在天光洒落的平台上。",
        {
            "type": "setText",
            "position": "down"
        },
        "\t[纳可]诶，诶？\n所以说，这里的所有人，\n都是来自溪月小姐……的家族？",
        "\t[冰溪月]溪月只是暂时的名字，重新自我介绍一下吧。\n在下，冰家，\r[aqua]冰溪月\r。\n喏，我身边这位也不是蓝柒，而是\r[aqua]冰蓝\r。",
        "\t[冰蓝]……嗯嗯……",
        "\t[冰溪月]嘻嘻，很抱歉到现在才告诉你。\n不过也是没有办法的事情。",
        "\t[冰溪月]另外，强榜这二十个人，不能说全部，\n但大多数都是被我们陆续安排进来，\n作为死士一样潜伏的哦。",
        "\t[秋兴]哎啊啊，小姐。\n这种说法有点太残忍了吧？\n家主大人待我等不薄，我等也不过是奉命行事。",
        "\t[纳娜米]原来是这样，怪不得……\n这么多拥有领域的强者聚集在这里。",
        "\t[冰溪月]唔，事实上还不仅如此。\n为了得到水牢的信息，\n家族先后付出了几位云霄级前辈的性命为代价。",
        "\t[纳可]是那些魂灵吗……。\n那，蓝柒——不，冰蓝小姐，\n之所以排出【强榜】是为了？",
        "\t[冰蓝]……左阿是一个戒心很重的人。\n我将实力控制在天空级六阶，\n长此以往，他必然会有疑心。",
        "\t[冰蓝]【强榜】是一种掩饰，\n这让左阿误以为我是那种享受着压制他人，\n高高在上的家伙。",
        "\t[莫尔]是的，而且在那老贼的眼中，这样一个榜单，\n反而看似对促进他安排的杀戮规则有益，\n呵，他也以为自己能轻松掌控全局。",
        "\t[纳娜米]所以，这些都在你们的计算之中吗。\n那，那我和可可——",
        "纳娜米的情绪突然有些激动，\n虽然纳可最终成功破局，\n但她本不想自己妹妹被牵扯进这种事情之中。",
        "\t[纳可]姐姐，没关系的。",
        "\t[秋兴]两位小姐有所不知。\n在那个疯子的规则下，\n被囚禁进来的家伙，情绪可没有那么稳定。",
        "\t[秋兴]啊——差不多是这么回事，\n只会到处杀杀杀。最后要么被杀死，\n要么杀死别人，再被杀死。",
        "\t[莫尔]是啊，所以小姐她们一直在暗中阻止这一切，\n以及命令我等保护……",
        "\t[冰蓝]秋兴，莫尔，不要说了。\n两位，大恩不言谢。\n我冰蓝在此以门主前辈之名起誓。",
        "\t[冰蓝]自此之后，凡我族血脉所及之处，\n便敬二位为坐上宾，\n即便献上性命，也定护你们周全。",
        "\t[冰溪月]哦哦，气场很足的嘛。\n话说小蓝你今天一次性说了这么多话？\n有点难得呀。",
        "\t[冰溪月]是时候了，回家了哦。\n纳可小姐……谢谢你。\n拿着这个，后会有期啦。",
        "冰溪月玉手一挥，\n一枚镌刻着\r[aqua]“冰”\r字的玉简落入纳可手中。",
        "\t[冰溪月]这是我们家族的传讯玉简。\n若遇险境，捏碎即可。",
        "\t[纳可]唔，要走了吗？……",
        "\t[纳娜米]虽然还有很多想问的，\n但你们背负的东西比想象的要沉重呢。\n好好休息一下吧。",
        "\t[秋兴]哈哈，强榜强者“落叶刀”，\n从今天起就正式退役了。\n两位天才小姐，下次见面恐怕是打不过你们咯。",
        "\t[莫尔]别贫了，走吧。\n族中前辈早就等得着急了。\n那么，就此别过，保重。",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 1000,
            "keep": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    5,
                    6
                ]
            ],
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    7,
                    6
                ]
            ],
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    4,
                    7
                ]
            ],
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    8,
                    7
                ]
            ],
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    5,
                    8
                ]
            ],
            "remove": true
        },
        {
            "type": "changePos",
            "loc": [
                6,
                8
            ],
            "direction": "up"
        },
        {
            "type": "setBlock",
            "number": "E703",
            "loc": [
                [
                    6,
                    6
                ]
            ]
        },
        {
            "type": "setCurtain",
            "time": 1000
        },
        "\t[纳可]姐姐……刚才你说的，\n在幻境里看到了前所未见的东西，\n是真的吗？",
        "\t[纳娜米]是啊，那片景象……真的很奇怪。\n可可，你说你闯过的幻境是根据你的记忆，\n生成与信念相背离的事物，试图让你堕入黑暗。",
        "\t[纳娜米]可我不记得我的记忆里有——\n或者我曾去过那幻境中的地方。",
        "\t[纳娜米]一片金辉交映的天空，\n巨兽翻腾衔云而舞，仙乐回荡震彻云霄。",
        "\t[纳可]哇，听起来挺神奇的……",
        "\t[纳娜米]可是……\n每当我试图看清那些兽影，\n听清那仙乐，意识就好像被震得眩晕起来。",
        "\t[纳可]竟是如此，\n每个人的幻境都有所不同……吗？\n那姐姐，你有没有什么头绪呀。",
        "\t[纳娜米]不知道，但我想回家族之后，\n先闭关一段时间。",
        "\t[纳娜米]虽然怪异无比，\n但我走出来时，却觉得领悟繁多。\n就像那个地方藏着什么突破的契机一样。",
        "\t[纳可]真的？\n太好了姐姐，我们快回去，\n把消息告诉峰大哥和父亲他们……",
        "\t[纳娜米]呼——好，此间事已了，\n是时候离开了。",
        {
            "type": "setValue",
            "name": "flag:newitem",
            "value": "1"
        },
        {
            "type": "setText",
            "position": "center"
        },
        "由于距离已经过于遥远，\n跳关选项、心境之门的入口已关闭。\n请使用自动化按钮新增的选项进行幸运计分。",
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    6
                ]
            ],
            "remove": true
        },
        {
            "type": "follow",
            "name": "nanami.png"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,6": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        },
        "5,6": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        },
        "4,7": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        },
        "7,6": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        },
        "8,7": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        },
        "5,8": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        },
        "6,2": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                {
                    "type": "if",
                    "condition": "(flag:351f==0)",
                    "true": [
                        {
                            "type": "setCurtain",
                            "color": [
                                0,
                                0,
                                0,
                                1
                            ],
                            "time": 1000,
                            "keep": true
                        },
                        "当纳可和纳娜米行出一段距离，\n回头望去，那庞大的水牢已然不见，\n淹没在了寒冷的冰原雪景之中。",
                        "然而她们都未曾注意到，\n某一瞬间，一道微不可察的蓝光，\n飞入了纳可的眉心深处……",
                        {
                            "type": "changeFloor",
                            "floorId": "MT352",
                            "loc": [
                                6,
                                2
                            ],
                            "direction": "down"
                        },
                        {
                            "type": "setCurtain",
                            "time": 1000
                        }
                    ],
                    "false": [
                        {
                            "type": "changeFloor",
                            "floorId": "MT352",
                            "loc": [
                                6,
                                2
                            ],
                            "direction": "down"
                        }
                    ]
                }
            ]
        }
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,210128,210129,210129,210129,210130,  0,  0,210171,  0],
    [  0,  0,210171,  0,210136,  0, 87,  0,210138,  0,  0,  0,  0],
    [  0,  0,  0,  0,210136,621,  0,621,210138,  0,  0,  0,  0],
    [  0,210174,  0,  0,210136,  0,622,  0,210138,  0,210166,  0,  0],
    [  0,  0,  0,  0,210136, 86, 86, 86,210138,  0,  0,  0,210149],
    [  0,210128,210129,210129,210139,1209,  0,1237,210140,210129,210129,210130,  0],
    [  0,210136,210029,  0,1192,  0,  0,  0,1216,  0,210029,210138,  0],
    [  0,210136,  0,210165,  0,1248,  0,  0,  0,210165,  0,210138,  0],
    [  0,210144,210145,210145,210145,210145,210145,210145,210145,210145,210145,210146,  0],
    [  0,210160,210161,210161,210161,210161,210161,210161,210161,210161,210161,210162,  0],
    [  0,210168,210169,210169,210169,210169,210169,210169,210169,210169,210169,210170,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,210021,  0,  0,  0,  0,  0,  0,  0,210021,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}