main.floors.MT357=
{
    "floorId": "MT357",
    "title": "357 层",
    "name": "357 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 5000000,
    "defaultGround": 305,
    "bgm": "21.mp3",
    "firstArrive": [
        {
            "type": "changePos",
            "direction": "right"
        },
        "\t[纳可]诶，那边那个人看起来没了气息。\n是已经死亡被淘汰了吗。",
        {
            "type": "animate",
            "name": "an",
            "loc": [
                5,
                3
            ]
        },
        {
            "type": "setBlock",
            "number": "E1263",
            "loc": [
                [
                    5,
                    3
                ]
            ]
        },
        {
            "type": "animate",
            "name": "jingya",
            "loc": "hero"
        },
        "\t[纳可]尸体竟然……变成了怪物？",
        "\t[纳可]真是莫名其妙的设定。\n我才不想变成难看的怪物啊……！",
        "\t[纳可]规则里说，“生存难度会随着时间而提升”，\n看来也是因为这个原因。",
        "\t[纳可]随着淘汰者越来越多，\n怪物也会不断变多，\n余下其他人的处境，将会越来越艰难——",
        "\t[纳可]一定要尽快赶路，尽早通过！\n……不对不对，要小心行事，\n不能在这里被干掉！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "1,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [178,178,178,178,178,178,178,178,178,178,178,178,178],
    [178,1015,  0,178,178,178, 87,178,178,635,178,620,178],
    [178,  0,620,178,178,178,643,178,178,1257,178,  0,178],
    [178, 23,  0, 81, 81,659,  0,622,1254,  0,1255, 21,178],
    [178,1261,178,178,178,178,1252,178,178,178,178, 81,178],
    [178,636,178,178,178,621,  0,178,178,178,178,  0,178],
    [178,1257,178,178,178,178, 81,178,178,178,178,1256,178],
    [178,  0,1259, 21, 81,  0,1253, 82,636,638,178,584,178],
    [178,635,178,178,178, 21,  0,178,178,178,178,1256,178],
    [178,178,178,178,178,1255,178,178,178,178,178,622,178],
    [178,178,178,178,178,  0,178,178,178, 82,639,  0,178],
    [178, 88,  0,1252, 81,635, 82,622,1253,  0,1259,621,178],
    [178,178,178,178,178,178,178,178,178,178,178,178,178]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}