main.floors.MT353=
{
    "floorId": "MT353",
    "title": "353 层",
    "name": "353 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 5000000,
    "defaultGround": 305,
    "bgm": "21.mp3",
    "firstArrive": [
        {
            "type": "setBlock",
            "number": "I925",
            "loc": [
                [
                    12,
                    6
                ]
            ],
            "floorId": "MT303"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,5": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                {
                    "type": "if",
                    "condition": "(flag:352f==2)",
                    "true": [],
                    "false": [
                        {
                            "type": "if",
                            "condition": "(flag:352f==1)",
                            "true": [
                                "诶？这里怎么会有一堵墙啊？\n啊，我知道了，想再多要一个灵宝嘛？\n想法不错，想想就好啦。",
                                {
                                    "type": "setValue",
                                    "name": "item:I1480",
                                    "value": "1"
                                },
                                {
                                    "type": "setValue",
                                    "name": "item:pickaxe",
                                    "operator": "+=",
                                    "value": "1"
                                },
                                {
                                    "type": "setValue",
                                    "name": "item:I733",
                                    "operator": "+=",
                                    "value": "1"
                                },
                                {
                                    "type": "setValue",
                                    "name": "flag:352f",
                                    "value": "2"
                                },
                                "获得了幸运箭头 - ←。\n补充了1破墙镐、1换位标靶。"
                            ],
                            "false": [
                                "一段剧情。",
                                {
                                    "type": "hide",
                                    "remove": true
                                },
                                {
                                    "type": "setValue",
                                    "name": "item:I792",
                                    "operator": "+=",
                                    "value": "1"
                                },
                                {
                                    "type": "setValue",
                                    "name": "flag:352f",
                                    "value": "1"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        "12,5": [
            "这是一个画在地上的宝石贴图。\n怎么可能这就让你偷到了哇，\n会变成0伤模拟器的。"
        ],
        "0,5": [
            "这是一个画在地上的宝石贴图。\n怎么可能这就让你偷到了哇，\n会变成0伤模拟器的。"
        ]
    },
    "changeFloor": {
        "6,10": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,0": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {
        "0,1": [
            "幸运数字下面藏着一把破和一个飞行器。\n（到底是怎么藏进去的哇！！）",
            {
                "type": "setValue",
                "name": "item:pickaxe",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "setValue",
                "name": "item:centerFly",
                "operator": "+=",
                "value": "1"
            }
        ]
    },
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [178,178,178,178,178,178, 87,178,178,178,622,178,178],
    [1029,178,1007,178,178,178,  0,178,178,178,178,178,10193],
    [  0,178,178,178,622,178,  0,178,733,178,178,178,  0],
    [178,178,178,178,178,178,  0,178,178,178,1006,178,178],
    [178,178,1006,178,178,178,  0,178,178,178,178,178,178],
    [10194,178,178,178,178,178,704,178,178,178,178,178,10195],
    [  0,178,178,178,733,178,  0,178, 23,178,178,178,  0],
    [178,178,732,178,178,178,  0,178,178,178,732,178,178],
    [178,178,178,178,178,178,  0,178,178,178,178,178,178],
    [178,178,  0, 86, 86, 86,  0, 86, 86, 86,  0,178,178],
    [178,1006, 83,178,178,178, 88,178,178,178, 83,1006,178],
    [1006,1007,178,178,178,178,178,178,178,178,178,1007,1006],
    [178,178,178,178,178,178,178,178,178,178,178,178,178]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [638,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,642],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [646,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,1016],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}