main.floors.MT36=
{
    "floorId": "MT36",
    "title": "36 层",
    "name": "36 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 10,
    "defaultGround": 30060,
    "bgm": "4.mp3",
    "firstArrive": [
        "\t[纳可]从外面看上去，这只是一座普通的建筑物，\n没想到地下的空间这么空旷。",
        "\t[纳可]好可怕的气息，刚进门就是这么可怕的怪物！",
        "\t[纳可]心里有些发毛……\n这种程度的“藏宝地”，\n恐怕潮汐级之下闯进来就是必死无疑呢。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,1": [
            "\t[老人]有些时候，单个的道具收效甚微。\n但是当你将多个道具联立使用，\n便可能产生意想不到的奇效。",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "6,9": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [147,147,147,147,147,147,147,147,147,147,147,147,147],
    [147,147,147,147,147,147,121,147,147,147,147,147,147],
    [147,147, 21,587, 21, 84,  0, 84, 22,585, 22,147,147],
    [147,147,147,147,147,147,902,147,147,147,147,147,147],
    [147,147,619,619, 84, 84,  0, 84, 84,635,635,147,147],
    [147,147,147,147,147,147, 86,147,147,147,147,147,147],
    [147,147,  0,572,265, 58,  0, 58,265,577,  0,147,147],
    [147,147, 59,  0,147, 86,147,147,147,  0,584,147,147],
    [147,147,  0, 58,147,576,  0,577,265,586,  0,147,147],
    [147,147, 59,  0,147,  0, 88,  0,147,  0,585,147,147],
    [147,147,  0,572,265,579,  0,578,147,576,  0,147,147],
    [147,147,147,147,147,147, 87,147,147,147,147,147,147],
    [147,147,147,147,147,147,147,147,147,147,147,147,147]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}