main.floors.MT37=
{
    "floorId": "MT37",
    "title": "37 层",
    "name": "37 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 10,
    "defaultGround": 30060,
    "bgm": "4.mp3",
    "firstArrive": [
        "\t[纳可]果然，这么多的荒兽，还有……\n被未知的力量影响，陷入疯狂的人类。",
        "\t[纳可]就像完全听不懂人说话一样，\n变成了只知道杀戮的怪物。",
        "\t[纳可]回去呼叫家族的人吗？\n恐怕要耽误太多的时间，姐姐也会有危险。\n不，现在不是想这些的时候。",
        "\t[纳可]父亲大人不是说过吗，\n只有生死战斗才是历练自己的最佳手段。",
        "\t[纳可]如果连眼前这点困难都退却的话，\n又有什么资格在血洛大陆立足呢！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "9,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [147,147,147,147,147,147,147,147,147,147,147,147,147],
    [147, 33,147,572,147, 47,147, 30,147, 87,147, 33,147],
    [147, 81,147,147,147,267,147,267,147,147,147, 81,147],
    [147, 34, 81,  0, 32,  0, 31,  0, 32,  0, 81, 34,147],
    [147,147,147, 82,147,257,147,275,147, 82,147,147,147],
    [ 34,147, 27,266,147, 27,147, 27,147,266, 28,147, 34],
    [ 58, 82, 22, 33,147, 81,147, 81,147, 33, 22, 82, 58],
    [ 34,147, 28,266,147, 28,147, 28,147,266, 27,147, 34],
    [147,147,147, 82,147,275,147,257,147, 82,147,147,147],
    [147, 34, 81,  0, 34,  0, 33,  0, 34,  0, 81, 34,147],
    [147, 81,147,147,  0, 32,  0, 32,  0,147,147, 81,147],
    [147, 33,147, 59, 82,  0, 88,  0, 82, 59,147, 33,147],
    [147,147,147,147,147,147,147,147,147,147,147,147,147]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}