main.floors.MT39=
{
    "floorId": "MT39",
    "title": "39 层",
    "name": "39 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 10,
    "defaultGround": 30060,
    "bgm": "4.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "2,9": [
            "你无法穿过这道门前往另一层。\n说起来，你是怎么找到这里的呀？\n破墙镐太多了叭。"
        ],
        "2,11": [
            "你无法穿过这道门前往另一层。\n说起来，你是怎么找到这里的呀？\n破墙镐太多了叭。"
        ]
    },
    "changeFloor": {
        "1,6": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [147,147,147,147,147,147,147,147,147,147,147,147,147],
    [147, 27, 28, 29,147,  0,270,  0,147, 28,147, 30,147],
    [147, 29, 33, 27,271, 21,147, 33,267,  0,278,  0,147],
    [147,147,257,147,147,147,147, 81,147,272, 27,147,147],
    [147,270, 58,275,147,  0, 34,275, 34,  0,147, 21,147],
    [147, 86,147, 58, 82,266,  0,147,147, 28,266,  0,147],
    [147, 88, 86,267,147,147,267,147,147,270,147,147,147],
    [147,147,147,147,147,147,  0, 21,147,  0,147, 27,147],
    [147,147,147,147,147,147, 27,  0,270, 33,271,578,147],
    [147,150754,150755,150756,147,147, 82,147,147,147, 81,147,147],
    [147,150762,150763,150764,147,147, 22,147, 28,147, 21,  0,147],
    [147,150770,150771,150772,147,147, 32,257,  0, 82,  0, 87,147],
    [147,147,147,147,147,147,147,147,147,147,147,147,147]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}