main.floors.MT42=
{
    "floorId": "MT42",
    "title": "42 层",
    "name": "42 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 10,
    "defaultGround": 30060,
    "bgm": "4.mp3",
    "firstArrive": [
        "\t[纳可]在地宫中行走，虽然危机四伏，\n可时不时也能找到一些好的宝物。\n比如那面盾牌。",
        "\t[纳可]有强者说过……机缘永远是自己争取到的。\n想要静坐着，等着它砸到头上并不现实。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "1,10": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "8,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [150368,150369,150370,147,147,147,147,147,147,147,147,147,147],
    [150376,150377,150378,147, 27,579, 28,147, 22,  0,270, 21,147],
    [150384,150385,150386,147,147,325,147,147,147,271,147, 86,147],
    [150392,150393,150394,147,147,578,  0,147,  0, 27,147,578,147],
    [147,147,147,147, 33,  0, 21,277, 34,  0,147,270,147],
    [147,147,787,147,147,272,147,147,147,278,147, 81,147],
    [147, 33,326, 33,147, 27, 31, 81, 32, 28,147,576,147],
    [147,278,147,278,147,147,277,147,147,272, 86,277,147],
    [147,  0, 27,  0, 82, 28, 32, 81, 31, 27,147, 28,147],
    [147,270,147,147,147, 82,147,147,278,147,147,272,147],
    [147, 88,147,  0,277, 21,  0,326, 29,  0, 81,  0,147],
    [147,  0,270, 22,147,  0, 27,147, 87, 22,147, 50,147],
    [147,147,147,147,147,147,147,147,147,147,147,147,147]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}