main.floors.MT501=
{
    "floorId": "MT501",
    "title": "501 层",
    "name": "501 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 2000000000,
    "defaultGround": 130013,
    "bgm": "29.mp3",
    "weather": null,
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 1000
        },
        "纳可醒来。\n得到秘宝世界。",
        {
            "type": "openShop",
            "id": "Q1"
        },
        {
            "type": "openShop",
            "id": "L1"
        },
        {
            "type": "openShop",
            "id": "X1"
        },
        "二阶之前的所有领悟与秘法均被分解，\n化为了100点领悟值。",
        {
            "type": "unloadEquip",
            "pos": 0
        },
        {
            "type": "unloadEquip",
            "pos": 1
        },
        {
            "type": "unloadEquip",
            "pos": 2
        },
        {
            "type": "unloadEquip",
            "pos": 3
        },
        {
            "type": "unloadEquip",
            "pos": 4
        },
        {
            "type": "unloadEquip",
            "pos": 5
        },
        {
            "type": "setValue",
            "name": "item:I893",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:I894",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:I895",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:I896",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:I897",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:I898",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:I899",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:I900",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:I901",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:I920",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:I921",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:I922",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:I928",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:I929",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:I925",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:I930",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:I931",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:I932",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:I933",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:I977",
            "value": "0"
        },
        "电脑端领悟值显示在状态栏的左下角，\n按V打开秘宝世界。\n手机端则按下边栏第五个键。",
        {
            "type": "setValue",
            "name": "status:money",
            "operator": "+=",
            "value": "100"
        },
        {
            "type": "setGlobalFlag",
            "name": "s:enableMoney",
            "value": true
        },
        "此后，击败实力在\r[#C76EE7]云霄级八阶及之上\r的有生力量，\n或\r[yellow]收集地图上的光点\r，都可以累积领悟点数，\n以在秘宝世界兑换各种资源。",
        {
            "type": "setValue",
            "name": "item:I945",
            "value": "1"
        },
        "得到了【散灵之环】。\n此后，你可以在背包内使用它，\n来清除你身上的负面效果。",
        "\t[纳可]……穿上装备吧。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [159,159,159,159,159,159,159,159,159,159,159,159,159],
    [159,159,159,159,159,159,159,159,159,159,159,159,159],
    [159,30228,30229,30229,30229,30229,30229,30229,30229,30229,30229,30230,159],
    [159,30236,30237,30237,30237,30237,30237,30237,30237,30237,110176,110176,159],
    [159,130144,130145,130144,130145,  0,  0,130164,  0,  0,  0,  0,159],
    [159,  0,  0,  0,  0,  0,  0,  0,  0,  0,110192,110192,159],
    [159,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,159],
    [159,130165,  0,  0,130165,  0,  0,  0,130165,  0,  0,130165,159],
    [159,130088,130089,130090,  0,  0,  0,  0,  0,130088,130089,130090,159],
    [159,130096,130097,130098,130095,  0,  0,  0,130094,130096,130097,130098,159],
    [159,130104,130105,130106,130095,  0,  0,  0,130094,130104,130105,130106,159],
    [159,130100,  0,130100,  0,  0, 87,  0,  0,130100,  0,130100,159],
    [159,159,159,159,159,159,159,159,159,159,159,159,159]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,130136,130137,130136,130137,  0,  0,130156,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,110184,110184,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,130157,  0,  0,130157,  0,  0,  0,130157,  0,  0,130157,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,130087,  0,  0,  0,130086,  0,  0,  0,  0],
    [  0,  0,  0,  0,130087,  0,  0,  0,130086,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30237,30237,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}