main.floors.MT52=
{
    "floorId": "MT52",
    "title": "52 层",
    "name": "52 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 20,
    "defaultGround": 150654,
    "bgm": "5.mp3",
    "firstArrive": null,
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,2": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                {
                    "type": "if",
                    "condition": "flag:51f==1",
                    "true": [],
                    "false": [
                        "\t[纳可]姐姐！",
                        {
                            "type": "animate",
                            "name": "xihuan",
                            "loc": "hero"
                        },
                        "\t[纳娜米]可可？！\n你为什么在这里，而且……\n这种地方为什么要用中心对称飞行器呀！！",
                        "\t[纳娜米]这里很危险，\n听姐姐的话，别胡闹，快回家族去。",
                        "\t[纳可]不。如果是听话的孩子，\n这种时候不可能丢下姐姐不管的。",
                        "\t[纳娜米]……怪姐姐没有说清楚。\n其实这次探险，是纳布家主默许的。\n或者说，是他有意安排我来的。",
                        "\t[纳可]诶，诶？",
                        "\t[纳娜米]实不相瞒，在之前的一次荒兽狩猎行动中，\n家族遭到不明来由的偷袭，损失惨重。",
                        "\t[纳娜米]偷袭者实力非常强大，\n他利用自己诡异的身法和速度，\n几乎是以摧枯拉朽般的姿态杀掉了那些族人。",
                        "\t[纳娜米]家主大怒，派出族中最为优秀的精英前去搜寻，\n并最终——发现了这座藏有宝藏的地宫，\n将消息散布出去！",
                        "\t[纳娜米]现在，方圆千里的大地级修行者，\n已经陆续接到消息赶来。\n可地宫的主人却没有什么动静。",
                        "\t[纳可]原来是这样吗？有点吓人的感觉。\n那姐姐，你为什么会……",
                        "\t[纳娜米]嗯……这一次的对手非常狡猾。\n如果家族中贸然派出天空级强者，\n只会引起对方的警觉。",
                        "\t[纳娜米]所以，才会悄悄把我这个不起眼的小辈派来，\n伪装成冒失的寻常冒险者。\n并且，现在我的手上，有足以击杀对方的底牌。",
                        "\t[纳娜米]但是下面的荒兽实在太多了。\n我这边最多只能应付几头，\n那张底牌又无法暴露，所以才被困在这里。",
                        "\t[纳可]交给我吧，姐姐。\n我们就一起，把它们通通干掉！",
                        "\t[纳娜米]不行不行，太危险了。\n……等等，可可，你是怎么来到这里的？\n难道上面的那头荒兽精英，被你解决了？",
                        "\t[纳可]都说过了，不要小看我啊。\n而且，如果连这点小问题都帮不了姐姐，\n那还要我做什么呢。",
                        "\t[纳娜米]……\n原来如此，小丫头不知不觉已经长大了吗……\n好，我知道了。",
                        "纳娜米加入了队伍！\n协同作战，能力的效力增加了30%！",
                        {
                            "type": "setValue",
                            "name": "item:I821",
                            "operator": "+=",
                            "value": "0.3"
                        },
                        {
                            "type": "setValue",
                            "name": "flag:51f",
                            "value": "1"
                        },
                        {
                            "type": "follow",
                            "name": "nanami.png"
                        },
                        {
                            "type": "openDoor",
                            "loc": [
                                6,
                                10
                            ]
                        },
                        {
                            "type": "hide",
                            "loc": [
                                [
                                    6,
                                    2
                                ]
                            ],
                            "remove": true
                        },
                        {
                            "type": "hide",
                            "loc": [
                                [
                                    6,
                                    6
                                ]
                            ],
                            "remove": true
                        }
                    ]
                }
            ]
        }
    },
    "changeFloor": {
        "1,9": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {
        "6,6": [
            {
                "type": "if",
                "condition": "flag:51f==1",
                "true": [],
                "false": [
                    "\t[纳可]姐姐！",
                    {
                        "type": "moveHero",
                        "time": 300,
                        "steps": [
                            "up:4"
                        ]
                    },
                    {
                        "type": "animate",
                        "name": "xihuan",
                        "loc": [
                            6,
                            3
                        ]
                    },
                    "\t[纳娜米]可可？！\n你为什么在这里，这里很危险，\n听姐姐的话，别胡闹，快回家族去。",
                    "\t[纳可]不。如果是听话的孩子，\n这种时候不可能丢下姐姐不管的。",
                    "\t[纳娜米]……怪姐姐没有说清楚。\n其实这次探险，是纳布家主默许的。\n或者说，是他有意安排我来的。",
                    "\t[纳可]诶，诶？",
                    "\t[纳娜米]实不相瞒，在之前的一次荒兽狩猎行动中，\n家族遭到不明来由的偷袭，损失惨重。",
                    "\t[纳娜米]偷袭者实力非常强大，\n他利用自己诡异的身法和速度，\n几乎是以摧枯拉朽般的姿态杀掉了那些族人。",
                    "\t[纳娜米]家主大怒，派出族中最为优秀的精英前去搜寻，\n并最终——发现了这座藏有宝藏的地宫，\n将消息散布出去！",
                    "\t[纳娜米]现在，方圆千里的大地级修行者，\n已经陆续接到消息赶来。\n可地宫的主人却没有什么动静。",
                    "\t[纳可]原来是这样吗？有点吓人的感觉。\n那姐姐，你为什么会……",
                    "\t[纳娜米]嗯……这一次的对手非常狡猾。\n如果家族中贸然派出天空级强者，\n只会引起对方的警觉。",
                    "\t[纳娜米]所以，才会悄悄把我这个不起眼的小辈派来，\n伪装成冒失的寻常冒险者。\n并且，现在我的手上，有足以击杀对方的底牌。",
                    "\t[纳娜米]但是下面的荒兽实在太多了。\n我这边最多只能应付几头，\n那张底牌又无法暴露，所以才被困在这里。",
                    "\t[纳可]交给我吧，姐姐。\n我们就一起，把它们通通干掉！",
                    "\t[纳娜米]不行不行，太危险了。\n……等等，可可，你是怎么来到这里的？\n难道上面的那头荒兽精英，被你解决了？",
                    "\t[纳可]都说过了，不要小看我啊。\n而且，如果连这点小问题都帮不了姐姐，\n那还要我做什么呢。",
                    "\t[纳娜米]……\n原来如此，小丫头不知不觉已经长大了吗……\n好，我知道了。",
                    "纳娜米加入了队伍！\n协同作战，能力的效力增加了30%！",
                    {
                        "type": "setValue",
                        "name": "item:I821",
                        "operator": "+=",
                        "value": "0.3"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:51f",
                        "value": "1"
                    },
                    {
                        "type": "follow",
                        "name": "nanami.png"
                    },
                    {
                        "type": "openDoor",
                        "loc": [
                            6,
                            10
                        ]
                    },
                    {
                        "type": "hide",
                        "loc": [
                            [
                                6,
                                2
                            ]
                        ],
                        "remove": true
                    }
                ]
            }
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [144,144,144,144,144,144,144,144,144,144,144,144,144],
    [144,144,144,144,144,144,  0,144,144,144,144,144,144],
    [144,144,144,144,144,  0,903,  0,144,144,144,144,144],
    [144,144,144,144,  0,  0,  0,  0,  0,144,144,144,144],
    [150029,150029,150029,150029,150029,  0,  0,  0,150029,150029,150029,150029,150029],
    [150037,150037,150037,150037,150037,  0,  0,  0,150037,150037,150037,150037,150037],
    [150053,150053,150053,150053,150053,150205, 86,150207,150053,150053,150053,150053,150053],
    [144,144,144,144,144, 34,  0, 34,144,144,144,144,144],
    [144,144,144,144, 33,  0, 58,  0, 33,144,144,144,144],
    [144, 88,  0, 86,  0, 34,  0, 34,  0, 86,334, 30,144],
    [144,144,144,144,144,  0, 85,  0,144,144,144,144,144],
    [144,144,144,144,144,144, 87,144,144,144,144,144,144],
    [144,144,144,144,144,144,144,144,144,144,144,144,144]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,150181,  0,150183,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,150189,150190,150191,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,150197,  0,150199,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,151316,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,151316,151316,151316,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,151316,151316,151316,151316,151316,  0,  0,  0,  0],
    [  0,  0,  0,151316,151316,151316,151316,151316,151316,151316,  0,  0,  0],
    [  0,  0,  0,  0,151316,151316,151316,151316,151316,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}