main.floors.MT525=
{
    "floorId": "MT525",
    "title": "525 层",
    "name": "525 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 5000000000,
    "defaultGround": 360033,
    "bgm": "30.mp3",
    "weather": [
        "fog",
        1
    ],
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,12": [
            {
                "type": "choices",
                "text": "\t[绿色按钮,A985]如果觉得打不动的话，\n不妨来点补给再前进吧！\n又或者，如果你更喜欢绿钥匙……？",
                "choices": [
                    {
                        "text": "获得4把绿钥匙",
                        "color": [
                            75,
                            217,
                            63,
                            1
                        ],
                        "need": "flag:525f<1",
                        "action": [
                            {
                                "type": "animate",
                                "name": "green"
                            },
                            {
                                "type": "setValue",
                                "name": "item:greenKey",
                                "operator": "+=",
                                "value": "4"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:525f",
                                "operator": "+=",
                                "value": "1"
                            }
                        ]
                    },
                    {
                        "text": "获得2把绿钥匙、1兆基础攻击",
                        "color": [
                            118,
                            209,
                            125,
                            1
                        ],
                        "need": "flag:525f<1",
                        "action": [
                            {
                                "type": "animate",
                                "name": "green"
                            },
                            {
                                "type": "setValue",
                                "name": "item:greenKey",
                                "operator": "+=",
                                "value": "2"
                            },
                            {
                                "type": "setValue",
                                "name": "status:atk",
                                "operator": "+=",
                                "value": "1e12"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:saltygreen",
                                "operator": "+=",
                                "value": "2"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:525f",
                                "operator": "+=",
                                "value": "1"
                            }
                        ]
                    },
                    {
                        "text": "获得2兆基础攻击",
                        "color": [
                            167,
                            217,
                            167,
                            1
                        ],
                        "need": "flag:525f<1",
                        "action": [
                            {
                                "type": "animate",
                                "name": "green"
                            },
                            {
                                "type": "setValue",
                                "name": "status:atk",
                                "operator": "+=",
                                "value": "2e12"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:saltygreen",
                                "operator": "+=",
                                "value": "4"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:525f",
                                "operator": "+=",
                                "value": "1"
                            }
                        ]
                    },
                    {
                        "text": "离去…",
                        "action": []
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "1,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [360048,360049,360049,360049,360049,360049,360049,360049,360049,360049,360049,360049,360050],
    [360065,360065,360065,360065,360065,360065,360065,360065,360065,360065,360065,360065,360065],
    [360081,360081,360081,360081,360081,360081,360081,360081,360081,360081,360081,360081,360081],
    [187,1528, 15,644,1534,640,187,643,1520,639,1531,645,187],
    [187, 82,187,187,187,1530,187,187,187, 82,187, 82,187],
    [187,1529,  0, 22,187,  0,1010,1527, 86,1524,187,639,187],
    [187,187,187, 86,1525, 21,  0,187,187, 86,187,1525,187],
    [187,640,1523,1010,187,  0,1009,187, 21,1523, 81,639,187],
    [187,187,187,187,187,187, 15,187,  0,187,187, 82,187],
    [187,639,641,187,639,187,1525,187,1009,187,638,640,187],
    [187,187,1528,187,1524,187, 21,187,1524,187,1527,187,187],
    [187, 88,  0,1526,  0, 81,640,1522,645,1528,  0, 87,187],
    [187,187,187,187,187,187,985,187,187,187,187,187,187]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,360085,  0,  0,  0,360069,  0,  0,  0,  0],
    [  0,  0,  0,  0,360101,  0,  0,  0,360101,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}