main.floors.MT532=
{
    "floorId": "MT532",
    "title": "532 层",
    "name": "532 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 5000000000,
    "defaultGround": 360033,
    "bgm": "30.mp3",
    "weather": [
        "fog",
        1
    ],
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "1,4": [
            {
                "type": "switch",
                "condition": "flag:532f",
                "caseList": [
                    {
                        "case": "0",
                        "action": [
                            "一个非常浅的窟窿。\n……这种地方难道不是用来藏东西的吗。",
                            {
                                "type": "setValue",
                                "name": "flag:532f",
                                "operator": "+=",
                                "value": "1"
                            },
                            {
                                "type": "comment",
                                "text": "当判别值是值的场合执行此事件"
                            }
                        ]
                    },
                    {
                        "case": "1",
                        "action": [
                            "一个非常浅的窟窿。\n……这种地方难道不是用来藏东西的吗。",
                            {
                                "type": "setValue",
                                "name": "flag:532f",
                                "operator": "+=",
                                "value": "1"
                            },
                            {
                                "type": "comment",
                                "text": "当判别值是值的场合执行此事件"
                            }
                        ]
                    },
                    {
                        "case": "2",
                        "action": [
                            "一个非常浅的窟窿。\n……这种地方难道不是用来藏东西的吗。",
                            {
                                "type": "setValue",
                                "name": "flag:532f",
                                "operator": "+=",
                                "value": "1"
                            },
                            {
                                "type": "comment",
                                "text": "当判别值是值的场合执行此事件"
                            }
                        ]
                    },
                    {
                        "case": "3",
                        "action": [
                            "一个非常浅的窟窿。\n似乎没有什么东西。",
                            {
                                "type": "setValue",
                                "name": "flag:532f",
                                "operator": "+=",
                                "value": "1"
                            },
                            {
                                "type": "comment",
                                "text": "当判别值是值的场合执行此事件"
                            }
                        ]
                    },
                    {
                        "case": "4",
                        "action": [
                            "一个非常浅的窟窿。\n似乎没有什么东西。",
                            {
                                "type": "setValue",
                                "name": "flag:532f",
                                "operator": "+=",
                                "value": "1"
                            },
                            {
                                "type": "comment",
                                "text": "当判别值是值的场合执行此事件"
                            }
                        ]
                    },
                    {
                        "case": "5",
                        "action": [
                            "一个非常浅的窟窿。\n似乎没有什么东西。",
                            {
                                "type": "setValue",
                                "name": "flag:532f",
                                "operator": "+=",
                                "value": "1"
                            },
                            {
                                "type": "comment",
                                "text": "当判别值是值的场合执行此事件"
                            }
                        ]
                    },
                    {
                        "case": "6",
                        "action": [
                            "一个非常浅的窟窿。\n似乎真的没有什么东西。",
                            {
                                "type": "setValue",
                                "name": "flag:532f",
                                "operator": "+=",
                                "value": "1"
                            },
                            {
                                "type": "comment",
                                "text": "当判别值是值的场合执行此事件"
                            }
                        ]
                    },
                    {
                        "case": "7",
                        "action": [
                            "一个非常浅的窟窿。\n似乎真的没有什么东西。",
                            {
                                "type": "setValue",
                                "name": "flag:532f",
                                "operator": "+=",
                                "value": "1"
                            },
                            {
                                "type": "comment",
                                "text": "当判别值是值的场合执行此事件"
                            }
                        ]
                    },
                    {
                        "case": "8",
                        "action": [
                            "一个非常浅的窟窿。\n似乎真的没有什么东西。",
                            {
                                "type": "setValue",
                                "name": "flag:532f",
                                "operator": "+=",
                                "value": "1"
                            },
                            {
                                "type": "comment",
                                "text": "当判别值是值的场合执行此事件"
                            }
                        ]
                    },
                    {
                        "case": "9",
                        "action": [
                            "一个非常浅的窟窿。\n……就在刚刚，好像突然多出了什么东西。",
                            "得到了幸运字符 - %！",
                            {
                                "type": "setValue",
                                "name": "item:I1143",
                                "value": "1"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:532f",
                                "operator": "+=",
                                "value": "1"
                            },
                            {
                                "type": "comment",
                                "text": "当判别值是值的场合执行此事件"
                            }
                        ]
                    },
                    {
                        "case": "10",
                        "action": [
                            "一个非常浅的窟窿。\n现在真的什么都没有了！",
                            {
                                "type": "comment",
                                "text": "当判别值是值的场合执行此事件"
                            }
                        ]
                    },
                    {
                        "case": "default",
                        "action": [
                            {
                                "type": "comment",
                                "text": "当没有符合的值的场合执行default事件"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "11,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [646,1561,643, 16,1544,187,187,187,187,187,187,187,187],
    [1562,644, 83,1542,1011,187,187,187,1010,  0,187, 88,187],
    [1011, 15,1547,  0,1543,639,1530,642,  0,1531, 15,1538,187],
    [ 17, 17, 17, 17,1010,187,187,  0,1532,187,187, 86,187],
    [ 17,360241, 17, 17, 17,638,187,187, 21,187,645,1538,187],
    [644,  0,187,1010, 15, 21,1532,640,  0,1534,  0,733,187],
    [  0,1546,187,187,187,1540,187,187,1528,187,187,1538,187],
    [187,639,187,640,187, 22,187,1010,  0,1009,187, 21,187],
    [187,  0,1538,  0, 82,1537,1011,187,1531,  0, 82,  0,187],
    [187,187, 82,187,187, 86,187,187, 81,187,187,1535,187],
    [187,1010,1534, 82,1532,645,187,  0,639,  0,187,1009,187],
    [187,638,1010,187,1009,  0,1528, 21,  0,640,1530, 87,187],
    [187,187,187,187,187,187,187,187,187,187,187,187,187]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,360034,360161,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,360034,360177,  0,  0,  0,  0,  0,  0,  0,  0],
    [360049,360049,360049,360050,360177,  0,  0,  0,  0,  0,  0,  0,  0],
    [360065,360065,360065,360065,360193,  0,  0,  0,  0,  0,  0,  0,  0],
    [360081,360081,360081,360081,360209,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}