main.floors.MT556=
{
    "floorId": "MT556",
    "title": "556 层",
    "name": "556 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 10000000000,
    "defaultGround": 370097,
    "bgm": "31.mp3",
    "weather": [
        "cloud",
        3
    ],
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "12,7": [
            {
                "type": "choices",
                "text": "\t[绿色按钮,A985]如果觉得打不动的话，\n不妨来点补给再前进吧！\n又或者，如果你更喜欢绿钥匙……？",
                "choices": [
                    {
                        "text": "获得6把绿钥匙",
                        "color": [
                            75,
                            217,
                            63,
                            1
                        ],
                        "need": "flag:556f<1",
                        "action": [
                            {
                                "type": "animate",
                                "name": "green"
                            },
                            {
                                "type": "setValue",
                                "name": "item:greenKey",
                                "operator": "+=",
                                "value": "6"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:556f",
                                "operator": "+=",
                                "value": "1"
                            }
                        ]
                    },
                    {
                        "text": "获得3把绿钥匙、100领悟",
                        "color": [
                            118,
                            209,
                            125,
                            1
                        ],
                        "need": "flag:556f<1",
                        "action": [
                            {
                                "type": "animate",
                                "name": "green"
                            },
                            {
                                "type": "setValue",
                                "name": "item:greenKey",
                                "operator": "+=",
                                "value": "3"
                            },
                            {
                                "type": "setValue",
                                "name": "status:money",
                                "operator": "+=",
                                "value": "100"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:556f",
                                "operator": "+=",
                                "value": "1"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:saltygreen",
                                "operator": "+=",
                                "value": "3"
                            }
                        ]
                    },
                    {
                        "text": "获得200领悟",
                        "color": [
                            167,
                            217,
                            167,
                            1
                        ],
                        "need": "flag:556f<1",
                        "action": [
                            {
                                "type": "animate",
                                "name": "green"
                            },
                            {
                                "type": "setValue",
                                "name": "status:money",
                                "operator": "+=",
                                "value": "200"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:556f",
                                "operator": "+=",
                                "value": "1"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:saltygreen",
                                "operator": "+=",
                                "value": "6"
                            }
                        ]
                    },
                    {
                        "text": "离去…",
                        "action": []
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "12,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "12,4": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [1048,1048,1048,1048,1048,1048,1048,1048,1048,1048,1048,1006,1048],
    [1048,1048,643,1555,  0,1048,639, 15,645,1048,1010,1562,644],
    [1048,640, 81,1048,1011,1554,  0,1048,  0,1558,  0,644,1048],
    [1048,1556,1048,1048, 17, 17, 17, 17, 17, 17,370345, 83,1048],
    [1048,  0, 22,1048, 17,1559,1437,1562,732, 17,1551,  0, 87],
    [1048,1048, 81,641, 17,643,1048,370345,  0, 17,642,370345,1048],
    [1048,1554,1009,1048, 17, 81,1554,1048,1558, 17,  0,1048,1048],
    [1048,  0,1048,1048, 17,1048,  0, 15,1015, 17,1552, 21,985],
    [1048, 82,1010,1048, 17,1011,1555,  0,1557, 17,370344,  0,1048],
    [1048,639,1048,640, 82,1553,1048,1009,  0,1553,1048,1010,1048],
    [1048,1557,645,1556,1048,645,1048, 81,1048,  0, 21,1551,1048],
    [1048,642,1048,  0, 23,1048, 47,1557,1048,1010,370345,  0, 88],
    [1048,1048,1048,1048,1048,1048,1048,1048,1048,1048,1048,1048,1048]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,370363,370364,370364,370364,370364,370365,  0,  0,  0],
    [  0,  0,  0,  0,370371,  0,  0,  0,  0,370373,370054,370054,370054],
    [  0,  0,  0,  0,370371,  0,  0,  0,  0,370373,370054,  0,  0],
    [  0,  0,  0,  0,370371,  0,  0,  0,  0,370373,370054,  0,  0],
    [  0,  0,  0,  0,370371,  0,  0,  0,  0,370373,370054,370054,  0],
    [  0,  0,  0,  0,370379,370359,370359,370359,370359,370381,  0,370054,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,370054,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,370054,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,370054,370054],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}