main.floors.MT649=
{
    "floorId": "MT649",
    "title": "649 层",
    "name": "649 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "11.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 100000000000,
    "defaultGround": 906,
    "bgm": "34.mp3",
    "weather": [
        "rain",
        3
    ],
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "5,0": [
            {
                "type": "choices",
                "text": "\t[转换器（红）,A984]你可以将手中的道具转换为血量。",
                "choices": [
                    {
                        "text": "1红→240京   剩余次数：${5-flag:649h1}",
                        "color": [
                            234,
                            120,
                            136,
                            1
                        ],
                        "need": "item:redKey>0",
                        "condition": "flag:649h1<5",
                        "action": [
                            {
                                "type": "setValue",
                                "name": "status:hp",
                                "operator": "+=",
                                "value": "240e16"
                            },
                            {
                                "type": "setValue",
                                "name": "item:redKey",
                                "operator": "-=",
                                "value": "1"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:649h1",
                                "operator": "+=",
                                "value": "1"
                            },
                            {
                                "type": "insert",
                                "loc": [
                                    5,
                                    0
                                ]
                            }
                        ]
                    },
                    {
                        "text": "1破→240京   剩余次数：${5-flag:649h2}",
                        "color": [
                            167,
                            170,
                            187,
                            1
                        ],
                        "need": "item:pickaxe>0",
                        "condition": "flag:649h2<5",
                        "action": [
                            {
                                "type": "setValue",
                                "name": "status:hp",
                                "operator": "+=",
                                "value": "240e16"
                            },
                            {
                                "type": "setValue",
                                "name": "item:pickaxe",
                                "operator": "-=",
                                "value": "1"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:649h2",
                                "operator": "+=",
                                "value": "1"
                            },
                            {
                                "type": "insert",
                                "loc": [
                                    5,
                                    0
                                ]
                            }
                        ]
                    },
                    {
                        "text": "1飞→240京   剩余次数：${5-flag:649h3}",
                        "color": [
                            243,
                            232,
                            188,
                            1
                        ],
                        "need": "item:centerFly>0",
                        "condition": "flag:649h3<5",
                        "action": [
                            {
                                "type": "setValue",
                                "name": "status:hp",
                                "operator": "+=",
                                "value": "240e16"
                            },
                            {
                                "type": "setValue",
                                "name": "item:centerFly",
                                "operator": "-=",
                                "value": "1"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:649h3",
                                "operator": "+=",
                                "value": "1"
                            },
                            {
                                "type": "insert",
                                "loc": [
                                    5,
                                    0
                                ]
                            }
                        ]
                    },
                    {
                        "text": "离开",
                        "action": []
                    }
                ]
            }
        ],
        "7,0": [
            {
                "type": "choices",
                "text": "\t[转换器（橙）,A986]你可以将手中的高阶道具转换为血量。",
                "choices": [
                    {
                        "text": "1吸→520京   剩余次数：${3-flag:649h4}",
                        "color": [
                            128,
                            239,
                            233,
                            1
                        ],
                        "need": "item:I732>0",
                        "condition": "flag:649h4<3",
                        "action": [
                            {
                                "type": "setValue",
                                "name": "status:hp",
                                "operator": "+=",
                                "value": "520e16"
                            },
                            {
                                "type": "setValue",
                                "name": "item:I732",
                                "operator": "-=",
                                "value": "1"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:649h4",
                                "operator": "+=",
                                "value": "1"
                            },
                            {
                                "type": "insert",
                                "loc": [
                                    7,
                                    0
                                ]
                            }
                        ]
                    },
                    {
                        "text": "1换→520京   剩余次数：${3-flag:649h5}",
                        "color": [
                            236,
                            252,
                            252,
                            1
                        ],
                        "need": "item:I733>0",
                        "condition": "flag:649h5<3",
                        "action": [
                            {
                                "type": "setValue",
                                "name": "status:hp",
                                "operator": "+=",
                                "value": "520e16"
                            },
                            {
                                "type": "setValue",
                                "name": "item:I733",
                                "operator": "-=",
                                "value": "1"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:649h5",
                                "operator": "+=",
                                "value": "1"
                            },
                            {
                                "type": "insert",
                                "loc": [
                                    7,
                                    0
                                ]
                            }
                        ]
                    },
                    {
                        "text": "离开",
                        "action": []
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "6,9": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "6,0": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 17, 17, 17, 17, 17,984, 88,986, 17, 17, 17, 17, 17],
    [ 17, 17, 17, 17, 17,1437,  0,1437, 17, 17, 17, 17, 17],
    [ 17, 17, 17, 17, 17,  0,1437,  0, 17, 17, 17, 17, 17],
    [ 17, 17, 17, 17, 17,1438,  0,1438, 17, 17, 17, 17, 17],
    [ 17, 17, 17, 17, 17,  0,1437,  0, 17, 17, 17, 17, 17],
    [ 17, 17, 17, 17, 17,1437,  0,1437, 17, 17, 17, 17, 17],
    [ 17, 17, 17, 17, 17,  0,1438,  0, 17, 17, 17, 17, 17],
    [ 17, 17, 17, 17,  0,390012, 86,390012,  0, 17, 17, 17, 17],
    [ 17, 17,1011,1012, 84,  0, 24,  0, 84,1012,1011, 17, 17],
    [ 17, 17,390011,390011,390013, 24, 87, 24,390013,390011,390011, 17, 17],
    [ 17, 17,1011,1012, 84,  0, 24,  0, 84,1012,1011, 17, 17],
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17],
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,390022,  0,  0,  0,  0,  0,  0,390023,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,390021,  0],
    [  0,  0,  0,390023,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,390023,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,390021,  0,  0,  0,390004,  0,390004,  0,  0,  0,390022,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,390005,  0,  0,  0,390005,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,390056,390057,390058,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,390056,390057,390058,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,390056,390057,390058,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,390056,390057,390058,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,390056,390057,390058,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,390056,390057,390058,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,390056,390057,390058,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,390048,390057,390057,390057,390050,  0,  0,  0,  0],
    [  0,  0,390048,390049,390057,390057,390057,390057,390057,390049,390050,  0,  0],
    [  0,  0,390056,390057,390057,390057,390057,390057,390057,390057,390058,  0,  0],
    [  0,  0,390064,390065,390065,390065,390065,390065,390065,390065,390066,  0,  0],
    [  0,  0,390077,390078,390078,390078,390078,390078,390078,390078,390079,  0,  0],
    [  0,  0,  0,390086,390086,390086,390086,390086,390086,390086,  0,  0,  0]
],
    "fg2map": [

]
}