main.floors.MT71=
{
    "floorId": "MT71",
    "title": "71 层",
    "name": "71 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "ground",
    "bgm": "6.mp3",
    "weather": null,
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "5,5": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        },
        "7,5": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        }
    },
    "changeFloor": {
        "6,0": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {
        "6,9": [
            "\t[纳可]父亲大人，姐姐。",
            "\t[纳布]都来了啊。\n可可，娜娜，这次辛苦你们了。",
            "\t[纳娜米]可可，这次我们可是立了大功的呀！\n城主府居然给了那么多的奖赏。",
            "\t[纳娜米]甚至还有两枚进化果实，\n这可是难得一见的，能使修炼者突破境界的奇物！",
            "\t[纳可]是呀……比想象中的奖励还要丰厚很多。",
            "\t[纳布]可可，你是有什么心事吗？",
            "\t[纳可]……\n\n没有。",
            "虽然地宫养殖者死后，地宫已经完全消失，\n禁忌的噬血之术也在燕岗领失传。\n但是他临死前说过的话，始终徘徊在纳可耳边。",
            "在这片大陆上，仿佛弱小便是一种原罪。\n弱者的命运完全由强者把控着。\n因此才有那么多人，为了得到力量而不惜一切代价。",
            "纳可始终无法释怀，\n但她只是把一切藏在心里，没有告诉父亲和姐姐。",
            "\t[纳娜米]家主前辈，可可她想说的话，自己会说的。\n不要再问了……",
            "\t[纳布]也罢。\n毕竟小丫头，今年也十一岁了啊。\n感觉怎么样？快要突破大地级了吧？",
            "\t[纳可]是的……\n自地宫一行之后，感触很深，\n已经隐约触摸到了那道门槛。",
            "\t[纳娜米]达到大地级有两种办法呢，\n第一种是慢慢积累领悟，最终水到渠成。\n第二种——在历练中快速突破。",
            "\t[纳可]……我不想再等待了。\n父亲大人，姐姐，我想前往荒兽森林，\n找寻突破的契机。",
            "\t[纳娜米]可可……",
            "\t[纳布]荒兽森林十分凶险，\n但你有这份冒险的心，那为父必定支持。",
            "\t[纳布]你在家族中取到的剑和盾，从此以后就是你的了。\n虽然它们未到珍宝级别，\n可也能让大地级二阶，乃至三阶都伤不到你。",
            "\t[纳布]还有一张隐藏着传送术式的护身符咒。\n如果你遇到危险，就使用它。",
            "\t[纳娜米]家主前辈，荒兽森林太危险了，\n把我之前使用的那把镭射枪交给可可吧？",
            "\t[纳布]不行。这虽然能让可可轻松应对困境，\n但也会少了突破所应有的压力。",
            "\t[纳可]父亲大人，镭射枪是什么？",
            "\t[纳布]也是时候告诉你这些了。\n这些东西，牵涉到一个传说。",
            "\t[纳布]\r[aqua]【天外族群】\r的传说。\n待可可你突破到大地级，我会告诉你更多的。",
            "\t[纳可]这样吗……我明白了。\n那么，等着我的好消息吧。",
            "\t[纳娜米]哼，不让姐姐省心。\n要加油啊，小丫头。\n……就像之前一样，一定要安然无恙回来。",
            {
                "type": "hide",
                "loc": [
                    [
                        5,
                        5
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        7,
                        5
                    ]
                ],
                "remove": true
            },
            {
                "type": "openDoor",
                "loc": [
                    6,
                    2
                ]
            }
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1, 87,  1,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  1,  1,  0,  1,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  1,  1, 85,  1,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  1,  1,  0,  1,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  0,  0,  0,  0,  0,  1,  1,  1,  1],
    [  1,  1,  1,  1,  0,704,  0,703,  0,  1,  1,  1,  1],
    [  1,  1,  1,  1,  0,  0,  0,  0,  0,  1,  1,  1,  1],
    [  1,  1,  1,  1,  0,  0,  0,  0,  0,  1,  1,  1,  1],
    [  1,  1,  1,  1,  0,  0,  0,  0,  0,  1,  1,  1,  1],
    [  1,  1,  1,  1,  1,  1, 86,  1,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  1,  1,  0,  1,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  1,  1,  0,  1,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  1,  1,  0,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}