main.floors.MT741=
{
    "floorId": "MT741",
    "title": "741 层",
    "name": "741 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 5000000000000,
    "defaultGround": 460456,
    "bgm": "39.mp3",
    "weather": [
        "snow",
        1
    ],
    "firstArrive": [
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    22
                ]
            ],
            "floorId": "MT755"
        },
        "系统提示：\n接下来角色要在较长的时间之内，\n面对远强于自己的敌人。\n\n请尽可能依靠领悟商店来迅速增强实力，\n不要急于提升领悟速度。\n相对于领悟点数，\n在冗音世界之中存活下来更关键。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,7": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [296,296,296,296,296,296,296,296,296,296,296,296,296],
    [296,296,646,1953, 22,1949,296,1012,1950,1014,1955,1017,296],
    [296,296, 16,296,296,  0,296, 82,296,296,296,1947,296],
    [296,295,1945,296,296,644,1955,643, 82,1943, 22,  0,296],
    [296,  0,1019,296,296,1944,296,296,296, 83,296,296,296],
    [296,644,  0,295,295,  0, 47,1947,  0, 21,296,296,296],
    [296,  0,1943, 15, 15,1015,  0,296,644,  0,295,295,296],
    [296,1945,296,296,296,  0, 88,296,  0,1012,1943,  0,296],
    [296, 21,1945,295,296,1006,  0, 81,1944,296,296,643,296],
    [296,296,643,  0,296,296,1948,296, 21,1945,296, 82,296],
    [296,296,296, 21,1944,1012,  0,296,296,  0,296,646,296],
    [296,296,296,296,296,  0, 87,296,296,1019,1946,  0,296],
    [295,295,296,296,296,296,296,296,296,296,296,296,296]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}