main.floors.MT757=
{
    "floorId": "MT757",
    "title": "757 层",
    "name": "757 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 10000000000000,
    "defaultGround": 1897,
    "bgm": "40.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "12,1": [
            {
                "type": "if",
                "condition": "(flag:757f==0)",
                "true": [
                    "\t[修行者]谢谢你救了我。\n我会为你提供200个【塔中亡灵】。",
                    {
                        "type": "setValue",
                        "name": "flag:wl",
                        "operator": "+=",
                        "value": "200"
                    },
                    {
                        "type": "hide",
                        "loc": [
                            [
                                12,
                                1
                            ]
                        ],
                        "remove": true
                    },
                    {
                        "type": "setValue",
                        "name": "flag:757f",
                        "value": "1"
                    }
                ],
                "false": [
                    "纳可尝试唤回修行者。\n但毫无反应。"
                ]
            }
        ]
    },
    "changeFloor": {
        "1,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "6,2": [
            {
                "type": "setValue",
                "name": "flag:door_MT757_7_3",
                "operator": "+=",
                "value": "1"
            }
        ],
        "8,2": [
            {
                "type": "setValue",
                "name": "flag:door_MT757_7_3",
                "operator": "+=",
                "value": "1"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "7,3": {
            "0": {
                "condition": "flag:door_MT757_7_3==2",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_MT757_7_3",
                        "operator": "=",
                        "value": "null"
                    }
                ]
            }
        }
    },
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [1888,1888,1888,1888,1888,1888,1888,1888,1888,1888,  4,  4,  4],
    [1888, 88,  0, 82, 82, 47,  0,570,  0, 47,965, 84,121],
    [1888,  0,  0,1888,1888,  0,1973,  0,1973,  0,  4,  4,  4],
    [1888,  0,1888,1888,1888,1888,1888, 85,1888,1888,1888,1888,1888],
    [1888, 24,1888,1006,1006,1888,643,  0,643,1888,1012,1486,1888],
    [1888, 24,1888,1006,1184, 84,  0,643,  0, 84, 23,1012,1888],
    [1888,  0,1888,1888,1888,1888, 91, 86, 91,1888,1888,1888,1888],
    [1888, 24,1888, 22, 22,1888,1019,  0,1019,1888,1486,1486,1888],
    [1888, 24,1888, 22,1007, 84,  0,1019,  0, 84,1012,1486,1888],
    [1888,  0,  4,  4,  4,  4, 91, 86, 91,  4,  4,  4,  4],
    [1888,  0,  4,1017,1021,  4,644,  0,644,  4,1022,1018,  4],
    [1888, 87,  4,1013,643,965,  0,644,  0,965,644,1014,  4],
    [1888,1888,  4,  4,  4,  4,1888,1888,1888,  4,  4,  4,  4]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0, 94,  0, 94,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0, 94,  0, 94,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}