main.floors.MT767=
{
    "floorId": "MT767",
    "title": "767 层",
    "name": "767 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 10000000000000,
    "defaultGround": 1891,
    "bgm": "40.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "11,1": [
            {
                "type": "setValue",
                "name": "flag:door_MT767_10_11",
                "operator": "+=",
                "value": "1"
            }
        ],
        "5,9": [
            {
                "type": "setValue",
                "name": "flag:door_MT767_6_8",
                "operator": "+=",
                "value": "1"
            }
        ],
        "7,9": [
            {
                "type": "setValue",
                "name": "flag:door_MT767_6_8",
                "operator": "+=",
                "value": "1"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "10,11": {
            "0": {
                "condition": "flag:door_MT767_10_11==1",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_MT767_10_11",
                        "operator": "=",
                        "value": "null"
                    }
                ]
            }
        },
        "6,8": {
            "0": {
                "condition": "flag:door_MT767_6_8==2",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_MT767_6_8",
                        "operator": "=",
                        "value": "null"
                    }
                ]
            }
        }
    },
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [1882,1882,1882,1882,1882,1882,1882,1882,1882,1882,1882,1882,1882],
    [1882, 21,1968,  0,1882,  0, 87,  0,1882,  0,1019,1966,1882],
    [1882, 22,1967, 21, 81, 21, 21, 21, 81,1963,2070,1012,1882],
    [1882, 21,1968,  0,1882,  0,1973,  0,1882,  0,1019,  0,1882],
    [1882,1882, 83,1882,1882,1882, 82,1882,1882,1882, 83,1882,1882],
    [1882,643, 21,  0,1882,  0,1438, 82,1882, 21,1965, 22,1882],
    [1882,1012,2070,1971, 81,1012,1970,1438,1882,644,643,644,1882],
    [1882,644, 22,  0,1882, 82, 21,  0,1882,  0,1969,  0,1882],
    [1882,1882, 82,1882,1882,1882, 85,1882,1882,1882, 81,1882,1882],
    [1882,  0,1963,  0,1882,1966,  0,1966,1882,  0,1967,1012,1882],
    [1882,643,  0,1962, 81,  0,733,  0, 81,2070,1882,1882,1882],
    [1882, 91,644,  0,1882,  0, 88,  0,1882,1972, 85,1018,1882],
    [1882,1882,1882,1882,1882,1882,1882,1882,1882,1882,1882,1882,1882]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 90,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0, 94,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 90,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}