main.floors.MT784=
{
    "floorId": "MT784",
    "title": "784 层",
    "name": "784 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "14.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0,
            "sx": 150,
            "sy": 150
        }
    ],
    "ratio": 20000000000000,
    "defaultGround": 906,
    "bgm": "41.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "var lastTime = core.getFlag('lastTime', 0);\n\nif (Date.now() - lastTime > 20) {\n\tvar image = core.material.images.images['14.jpg'];\n\tvar width = 416,\n\t\theight = 416;\n\n\tcore.canvas.bg.translate(width / 2, height / 2);\n\tcore.canvas.bg.rotate(Math.PI / 180 / 6);\n\tcore.canvas.bg.translate(-width / 2, -height / 2);\n\tcore.canvas.bg.drawImage(image, -288, -96);\n\n\tcore.setFlag('lastTime', Date.now());\n\n\tvar rotateTime = core.getFlag('rotateTime', 0);\n\trotateTime += 1;\n\tif (rotateTime >= 6 * 180) {\n\t\trotateTime -= 6 * 180;\n\t}\n\tcore.setFlag('rotateTime', rotateTime);\n}",
    "events": {
        "5,12": [
            {
                "type": "choices",
                "text": "\t[绿色按钮,A985]如果觉得打不动的话，\n不妨来点补给再前进吧！\n又或者，如果你更喜欢绿钥匙……？",
                "choices": [
                    {
                        "text": "获得8把绿钥匙",
                        "color": [
                            75,
                            217,
                            63,
                            1
                        ],
                        "need": "flag:784f<1",
                        "action": [
                            {
                                "type": "animate",
                                "name": "green"
                            },
                            {
                                "type": "setValue",
                                "name": "item:greenKey",
                                "operator": "+=",
                                "value": "8"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:784f",
                                "operator": "+=",
                                "value": "1"
                            }
                        ]
                    },
                    {
                        "text": "获得4把绿钥匙，并传送到绿色音碑之前",
                        "color": [
                            118,
                            209,
                            125,
                            1
                        ],
                        "need": "flag:784f<1",
                        "action": [
                            {
                                "type": "animate",
                                "name": "green"
                            },
                            {
                                "type": "setValue",
                                "name": "item:greenKey",
                                "operator": "+=",
                                "value": "4"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:784f",
                                "operator": "+=",
                                "value": "1"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:saltygreen",
                                "operator": "+=",
                                "value": "4"
                            },
                            {
                                "type": "changeFloor",
                                "floorId": "MT788",
                                "loc": [
                                    1,
                                    5
                                ],
                                "direction": "down"
                            }
                        ]
                    },
                    {
                        "text": "传送到蓝色音碑之前",
                        "color": [
                            167,
                            217,
                            167,
                            1
                        ],
                        "need": "flag:784f<1",
                        "action": [
                            {
                                "type": "animate",
                                "name": "green"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:784f",
                                "operator": "+=",
                                "value": "1"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:saltygreen",
                                "operator": "+=",
                                "value": "8"
                            },
                            {
                                "type": "changeFloor",
                                "floorId": "MT793",
                                "loc": [
                                    7,
                                    9
                                ],
                                "direction": "up"
                            }
                        ]
                    },
                    {
                        "text": "离去…",
                        "action": []
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "6,0": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "6,11": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 17, 17, 17, 17, 17,  0, 87,  0, 17, 17, 17, 17, 17],
    [ 17, 17, 17,1014, 17,1019,1981,646, 82,1438, 17,643, 17],
    [ 17, 17,  0,1019, 17,180011,1985,  0,180011,1986,1013,1983, 17],
    [ 17,732,1983,  0, 16,643,  0,180011, 17,  0,1982,644, 17],
    [ 17,180011, 15,180011, 17,1987,180011, 17, 17,180011,1015, 81, 17],
    [ 17, 21,  0,644, 15,1982,1013,1981, 17, 17,180011,1438, 17],
    [ 17,  0,1984,  0,180011,  0,180011,1012,  0, 17, 17,1985, 17],
    [ 17,180011, 15,1986, 17, 21,1983,  0,1984, 81,  0,644, 17],
    [ 17,1982,  0, 21, 17,180011,  0,1012,180011,180011,1984,  0, 17],
    [ 17,  0,180011,180011, 17, 17,180011, 16, 17, 17, 82,180011, 17],
    [ 17,1982,  0,1981,  0, 21,  0, 22,  0,1981,  0, 50, 17],
    [ 17,  0,643,  0,1981,  0, 88,  0,1981,  0,643,  0, 17],
    [ 17,180011,180011,180011,180088,985,  0, 23,180088,180011,180011,180011, 17]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,180080,  0,  0,  0,180080,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,180006,180006,180006,  0,  0,  0,  0,  0],
    [  0,  0,  0,180003,  0,180003,180003,180003,180003,180003,  0,180003,  0],
    [  0,  0,180003,180003,  0,  0,180003,180003,  0,180003,180003,180003,  0],
    [  0,180003,180003,180003,180003,180003,180003,  0,  0,180003,180003,180003,  0],
    [  0,  0,180003,  0,  0,180003,  0,  0,  0,  0,180003,180003,  0],
    [  0,180003,180003,180003,180003,180003,180003,180003,  0,  0,  0,180003,  0],
    [  0,180003,180003,180003,  0,180003,  0,180003,180003,  0,  0,180003,  0],
    [  0,  0,180003,180003,  0,180003,180003,180003,180003,180003,180003,180003,  0],
    [  0,180003,180003,180003,  0,  0,180003,180003,  0,  0,180003,180003,  0],
    [  0,180003,  0,  0,  0,  0,  0,180003,  0,  0,180003,  0,  0],
    [  0,180003,180003,180003,180003,180003,180003,180003,180003,180003,180003,180003,  0],
    [  0,180003,180003,180003,180003,180003,180003,180003,180003,180003,180003,180003,  0],
    [  0,  0,  0,  0,180003,180003,180003,180003,180003,  0,  0,  0,  0]
],
    "fg2map": [

]
}