main.floors.MT90=
{
    "floorId": "MT90",
    "title": "90 层",
    "name": "90 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 50,
    "defaultGround": 20000,
    "bgm": "6.mp3",
    "weather": [
        "cloud",
        5
    ],
    "firstArrive": [
        "系统提示：通关本区域不需要击败百方，\n只要击败两个【百家近卫】即可。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "1,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {
        "6,7": [
            "\t[纳可]前面有人。",
            "\t[百方]哟，你就是那个，剿灭了血杀殿余孽的小丫头？\n真是看不出来啊。",
            "\t[纳可]（来者不善。）\n你们……是什么人？",
            "\t[百方]你问我？呵呵。\n燕岗城百家，百方。\n没想到来荒兽森林历练，居然这么巧让我碰到你。",
            "\t[百方]竟敢抢夺我百家的藏宝图，\n害得我哥哥被家族问责，\n你可知罪！",
            "\t[纳可]抢夺藏宝图？\n啊，想起来了。\n那个家伙是你哥哥吗。",
            "\t[纳可]可那是他先动手的，\n我只不过是给他一个教训罢了。",
            "\t[百方]教训？你可知道，区区一个纳家，\n可没有资本和我百家对抗。\n百家，可是拥有天空级巅峰的强者。",
            "\t[百方]我们百家错失了得到宝藏的机会，\n今天这笔账，可要好好算一算。",
            "\t[纳可]你说得对，但是你哥哥连大地级都没到，\n你是怎么修炼到大地级七阶的呀？",
            "\t[百方]……哈？",
            "\t[纳可]（机会来了！）",
            {
                "type": "moveHero",
                "steps": [
                    "up:1"
                ]
            },
            {
                "type": "battle",
                "loc": [
                    5,
                    5
                ]
            },
            {
                "type": "battle",
                "loc": [
                    7,
                    5
                ]
            },
            "纳可眼疾手快地挥出几剑，\n精准地点中眼前百家人马的要害。\n瞬息之间，百方身边的近卫全部失去战斗能力！",
            "\t[百方]什么，居然先一步出手，该死——",
            "百方调动身体中的原力，\n瞬息之间拍出一掌，\n蕴含着足足七阶境界的力量！",
            "\t[纳可]呜！",
            "避无可避的少女，\n当机立断地取出护身符咒，\n逃遁而去。",
            {
                "type": "setHeroOpacity",
                "opacity": 0
            },
            "\t[百方]…………",
            "\t[百方]跑了？这下不好办了。\n再想下手，可没有那么好的机会了啊。\n呵呵呵……",
            {
                "type": "openDoor",
                "loc": [
                    6,
                    2
                ]
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        4
                    ]
                ],
                "remove": true
            },
            {
                "type": "setHeroOpacity",
                "opacity": 1
            },
            {
                "type": "changeFloor",
                "floorId": "MT91",
                "loc": [
                    6,
                    1
                ],
                "direction": "down"
            }
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [20811,20812,20813,20814,150,150,150,150,150,20811,20812,20813,20814],
    [20819,20820,20821,20822,150,150, 87,150,150,20819,20820,20821,20822],
    [20827,20828,20829,150,150,150, 85,150,150,150,20828,20829,20830],
    [150,150,150,150,150,  0,  0,  0,150,150,150,150,150],
    [150,150,150,150,  0,  0,705,  0,  0,150,150,150,150],
    [150,150,150,  0,  0,376,  0,376,  0,  0,150,150,150],
    [150,150,150,150,150,  0,  0,  0,150,150,150,150,150],
    [150,150,150,150,150,150, 86,150,150,150,150,150,150],
    [150,150,150,150,150,150, 23,150,150,150,150,150,150],
    [150,150,150,150,150,579,  0, 22,150,150,150,150,150],
    [150,150,150,150,584,  0,586,  0,150,150,150,150,150],
    [150, 88,  0, 86,  0,585,  0,150,150,150,150,150,150],
    [150,150,150,150,150,150,150,150,150,150,150,150,150]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,20830,  0,  0,  0,  0,  0,20827,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,20840,  0,  0,  0,  0,  0,  0,  0,20843,  0,  0],
    [  0,  0,20848,20849,  0,  0,  0,  0,  0,20850,20851,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}