main.floors.TS33=
{
    "floorId": "TS33",
    "title": "枢机网络 3层",
    "name": "枢机网络 3层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "02.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 2000,
    "defaultGround": 30060,
    "bgm": "11.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "1,11": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "11,1": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {
        "6,3": [
            {
                "type": "animate",
                "name": "baozha",
                "loc": [
                    3,
                    5
                ]
            },
            {
                "type": "animate",
                "name": "baozha",
                "loc": [
                    10,
                    5
                ]
            },
            {
                "type": "hide",
                "loc": [
                    [
                        1,
                        4
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        3,
                        4
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        2,
                        5
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        1,
                        6
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        3,
                        6
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        9,
                        4
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        9,
                        6
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        11,
                        5
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        8,
                        5
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        4,
                        5
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        5
                    ]
                ],
                "remove": true
            },
            {
                "type": "openDoor",
                "loc": [
                    6,
                    7
                ]
            },
            "领悟了\r[red]燃灼术\r！\n将为你自动装备，可在装备栏查看详情。",
            {
                "type": "setValue",
                "name": "item:I929",
                "value": "1"
            },
            {
                "type": "loadEquip",
                "id": "I929"
            },
            {
                "type": "exit"
            }
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 22, 15, 22, 15, 22, 15,585,918,918,918,918,918,918],
    [918,918,918,918,918,918,  0,918,918,918,  0, 88,918],
    [1006, 82,1006, 82,1006, 82,637,435, 60,426,635,  0,918],
    [  4,  4,  4,  4,  4,  4, 86,  4,  4,  4,  4,  4,  4],
    [  0,495,  0,495,  0,  0,  0,  0,  0,496,  0,  0,  0],
    [  0,  0,495,  0,721,  0,1838,  0,722,  0,  0,496,  0],
    [  0,495,  0,495,  0,  0,  0,  0,  0,496,  0,  0,  0],
    [  4,  4,  4,  4,  4,  4, 86,  4,  4,  4,  4,  4,  4],
    [918,639,445,638,918,1006,  0, 22,441,918,619,439, 22],
    [918,918, 83,918,918,436, 15,918, 60,436,  0,918,1007],
    [918,  0,579,918,  0,584,435,50032,50033,50034,50032,50033,50034],
    [918, 87,  0,442, 21,918, 22,50040,50041,50041,50041,50041,50042],
    [918,918,918,918,918,918,636,50048,50049,50050,50048,50049,50050]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,50189,  0,  0,50189,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,50197,  0,  0,50197,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}